
Процедура ПриЗаписи(Отказ)
	
	ВыполнятьОбменССерверомШтрихМ = ЭтотОбъект.Значение;
	
	Отбор = Новый Структура();
	Отбор.Вставить("Ключ", "ОбменТоваромССерверомШтрихМ");
	Отбор.Вставить("ОбластьДанных", РаботаВМоделиСервиса.ЗначениеРазделителяСеанса());
	
	ТаблицаЗаданий = ОчередьЗаданий.ПолучитьЗадания(Отбор);
	
	Для Каждого ЗаданиеОчереди ИЗ ТаблицаЗаданий Цикл
		Если ЗаданиеОчереди.Использование <> ВыполнятьОбменССерверомШтрихМ Тогда
			ОчередьЗаданий.ИзменитьЗадание(ЗаданиеОчереди.Идентификатор,
			Новый Структура("Использование", ВыполнятьОбменССерверомШтрихМ));
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
