
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Структура подчиненности".
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Формирует массив реквизитов документа. 
// 
// Параметры: 
// ИмяДокумента - Строка - имя документа.
// 
// Возвращаемое значение: 
// Массив - массив наименований реквизитов документа. 
// 
Функция МассивРеквизитовОбъектаДляФормированияПредставления(ИмяДокумента) Экспорт
	
	МассивДопРеквизитов = Новый Массив;
	
	// УНФ
	// Возможно указать не более 3 доп. реквизитов для формирования представления
	Если ИмяДокумента = "АвансовыйОтчет" Тогда
		
		МассивДопРеквизитов.Добавить("Сотрудник");
		
	ИначеЕсли ИмяДокумента = "ЗаданиеНаРаботу" Тогда
		
		МассивДопРеквизитов.Добавить("ВидОперации");
		МассивДопРеквизитов.Добавить("Состояние");
		
	ИначеЕсли ИмяДокумента = "ЗаказНаПроизводство" Тогда
		
		МассивДопРеквизитов.Добавить("ВидОперации");
		МассивДопРеквизитов.Добавить("СостояниеЗаказа");
		
	ИначеЕсли ИмяДокумента = "ЗаказПокупателя" Тогда
		
		МассивДопРеквизитов.Добавить("ВидОперации");
		МассивДопРеквизитов.Добавить("СостояниеЗаказа");
		
	ИначеЕсли ИмяДокумента = "ЗаказПоставщику" Тогда
		
		МассивДопРеквизитов.Добавить("ВидОперации");
		МассивДопРеквизитов.Добавить("СостояниеЗаказа");
		
	ИначеЕсли ИмяДокумента = "КадровоеПеремещение" Тогда
		
		МассивДопРеквизитов.Добавить("ВидОперации");
		
	ИначеЕсли ИмяДокумента = "ОтчетКомиссионера" Тогда
		
		МассивДопРеквизитов.Добавить("Контрагент"); // Комиссионер
		
	ИначеЕсли ИмяДокумента = "ОтчетКомитенту" Тогда
		
		МассивДопРеквизитов.Добавить("Контрагент"); // Комитент
		
	ИначеЕсли ИмяДокумента = "ОтчетОРозничныхПродажах" Тогда
		
		МассивДопРеквизитов.Добавить("КассаККМ");
		
	ИначеЕсли ИмяДокумента = "ПеремещениеЗапасов" Тогда
		
		МассивДопРеквизитов.Добавить("ВидОперации");
		
	ИначеЕсли ИмяДокумента = "ПеремещениеПоЯчейкам" Тогда
		
		МассивДопРеквизитов.Добавить("ВидОперации");
		
	ИначеЕсли ИмяДокумента = "ПриходнаяНакладная" Тогда
		
		МассивДопРеквизитов.Добавить("ВидОперации");
		
	ИначеЕсли ИмяДокумента = "ПлатежнаяВедомость" Тогда
		
		МассивДопРеквизитов.Добавить("ВидОперации");
		
	ИначеЕсли ИмяДокумента = "ПлатежноеПоручение" Тогда
		
		МассивДопРеквизитов.Добавить("ВидОперации");
		МассивДопРеквизитов.Добавить("БанковскийСчет");
		
	ИначеЕсли ИмяДокумента = "ПоступлениеВКассу" Тогда
		
		МассивДопРеквизитов.Добавить("ВидОперации");
		МассивДопРеквизитов.Добавить("Касса");
		
	ИначеЕсли ИмяДокумента = "ПоступлениеНаСчет" Тогда
		
		МассивДопРеквизитов.Добавить("ВидОперации");
		МассивДопРеквизитов.Добавить("БанковскийСчет");
		
	ИначеЕсли ИмяДокумента = "РасходИзКассы" Тогда
		
		МассивДопРеквизитов.Добавить("ВидОперации");
		МассивДопРеквизитов.Добавить("Касса");
		
	ИначеЕсли ИмяДокумента = "РасходнаяНакладная" Тогда
		
		МассивДопРеквизитов.Добавить("ВидОперации");
		
	ИначеЕсли ИмяДокумента = "РасходСоСчета" Тогда
		
		МассивДопРеквизитов.Добавить("ВидОперации");
		МассивДопРеквизитов.Добавить("БанковскийСчет");
		
	ИначеЕсли ИмяДокумента = "СборкаЗапасов" Тогда
		
		МассивДопРеквизитов.Добавить("ВидОперации");
		
	ИначеЕсли ИмяДокумента = "СверкаВзаиморасчетов" Тогда
		
		МассивДопРеквизитов.Добавить("Статус");
		
	ИначеЕсли ИмяДокумента = "СдельныйНаряд" Тогда
		
		МассивДопРеквизитов.Добавить("Исполнитель");
		
	ИначеЕсли ИмяДокумента = "Событие" Тогда
		
		МассивДопРеквизитов.Добавить("ТипСобытия");
		
	ИначеЕсли ИмяДокумента = "СчетФактура" Тогда
		
		МассивДопРеквизитов.Добавить("ВидОперации");
		
	ИначеЕсли ИмяДокумента = "СчетФактураПолученный" Тогда
		
		МассивДопРеквизитов.Добавить("ВидОперации");
		
	ИначеЕсли ИмяДокумента = "ЧекККМ" Тогда
		
		МассивДопРеквизитов.Добавить("КассаККМ");
		
	ИначеЕсли ИмяДокумента = "ЧекККМВозврат" Тогда
		
		МассивДопРеквизитов.Добавить("КассаККМ");
		
	КонецЕсли;
	
	// Конец. УНФ
	
	Возврат МассивДопРеквизитов
	
КонецФункции

// Получает представление документа для печати.
//
// Параметры:
//  Выборка  - КоллекцияДанных - структура или выборка из результатов запроса
//                 в которой содержатся дополнительные реквизиты, на основании
//                 которых можно сформировать переопределенное представление 
//                 документа для вывода в отчет "Структура подчиненности".
//
// Возвращаемое значение:
//   Строка,Неопределено   - переопределенное представление документа, или Неопределено,
//                           если для данного типа документов такое не задано.
//
Функция ПредставлениеОбъектаДляВыводаВОтчет(Выборка) Экспорт
	
	// УНФ
	
	ПредставлениеДокумента = Выборка.Представление;
	Если (Выборка.СуммаДокумента <> 0) 
		И (Выборка.СуммаДокумента <> NULL) Тогда
		
		ПредставлениеДокумента = ПредставлениеДокумента + " " + НСтр("ru='на сумму'") + " " + Выборка.СуммаДокумента;
		
		Если ЗначениеЗаполнено(Выборка.Валюта) Тогда
			
			ПредставлениеДокумента = ПредставлениеДокумента + " " + Выборка.Валюта;
			
		ИначеЕсли ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.ИнвентаризацияЗапасов")
			ИЛИ ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.ОприходованиеЗапасов")
			ИЛИ ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.ПрочиеРасходы")
			ИЛИ ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.СписаниеЗапасов") Тогда
			
			ПредставлениеДокумента = ПредставлениеДокумента + " " + Константы.ВалютаУчета.Получить();
			
		ИначеЕсли ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.ЗаданиеНаРаботу") Тогда
			
			Если ЗначениеЗаполнено(Выборка.Ссылка.ВидЦен) Тогда
				
				ПредставлениеДокумента = ПредставлениеДокумента + " " + Выборка.Ссылка.ВидЦен.ВалютаЦены;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Для ИндексДополнительногоРеквизита = 1 По 3 Цикл
		
		ДополнительноеЗначение = Выборка["ДополнительныйРеквизит" + Строка(ИндексДополнительногоРеквизита)];
		
		Если ЗначениеЗаполнено(ДополнительноеЗначение) Тогда
			
			ПредставлениеДокумента = ПредставлениеДокумента + ", " + СокрЛП(ДополнительноеЗначение);
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Конец. УНФ
	
	Возврат ПредставлениеДокумента;
	
КонецФункции

// Возвращает имя реквизита документа, в котором содержится информация о Сумме и Валюте документа для вывода в
// структуру подчиненности.
// По умолчанию используются реквизиты Валюта и СуммаДокумента. Если для конкретного документа или конфигурации в целом
// используются другие
// реквизиты, то переопределить значения по умолчанию можно в данной функции.
//
// Параметры:
//  ИмяДокумента  - Строка - имя документа, для которого надо получить имя реквизита.
//  Реквизит      - Строка - Строка, может принимать значения "Валюта" и "СуммаДокумента".
//
// Возвращаемое значение:
//   Строка   - Имя реквизита документа, в котором содержится информация о Валюте или Сумме.
//
Функция ИмяРеквизитаДокумента(ИмяДокумента, Реквизит) Экспорт
	
	
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти
