
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Если ПараметрыВыполненияКоманды.Источник=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыВыполненияКоманды.Источник.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаЭлемента" Тогда
		РаботаСНоменклатуройКлиент.ПодготовитьРеквизитыСтрокиПоЭлементу(ПараметрыВыполненияКоманды, "ЗаказПоставщику");
	Иначе
		РаботаСНоменклатуройКлиент.ПодготовитьРеквизитыСтрокСписка(ПараметрыВыполненияКоманды, "ЗаказПоставщику");
	КонецЕсли;
	
КонецПроцедуры
