

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
// Процедура - обработчик события ПриСозданииНаСервере.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка	= Ложь;
	Контрагент				= Параметры.Контрагент;
	ЭтаФорма.Заголовок		= НСтр("ru ='Список договоров контрагента: '") + Строка(Контрагент);
	СортироватьПоДоговорам	= Параметры.СортироватьПоДоговорам;
	
	ДоговорыКонтрагентов.Загрузить(Параметры.ДоговорыКонтрагентов.Выгрузить());
	
	ПроверитьЗаполнениеДоговоров = Ложь;
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
// Процедура - обработчик события ПередЗакрытием формы.
//
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если ПроверитьЗаполнениеДоговоров Тогда
	
		Для каждого Договор Из ДоговорыКонтрагентов Цикл
			
			Если НЕ ЗначениеЗаполнено(Договор.Договор) Тогда
				
				ТекстСообщения = НСтр("ru = 'В таблице присутствуют строки с незаполненным договором контрагента'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , , , Отказ);
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры // ПередЗакрытием()


//////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД

&НаКлиенте
// Процедура обрабочитк команды ОК
//
Процедура ОК(Команда)
	
	ПроверитьЗаполнениеДоговоров = Истина;
	Модифицированность = Ложь;
	Закрыть(Новый Структура("ДоговорыКонтрагентов, СортироватьПоДоговорам", ДоговорыКонтрагентов, СортироватьПоДоговорам));
	
КонецПроцедуры // ОК()

&НаКлиенте
// Процедура обрабочитк команды Отмена
//
Процедура Отмена(Команда)
	
	ПроверитьЗаполнениеДоговоров = Ложь;
	Модифицированность = Ложь;
	Закрыть();
	
КонецПроцедуры // Отмена()

&НаКлиенте
// Процедура обрабочитк команды УстановитьФлажки
//
Процедура УстановитьФлажки(Команда)
	
	Для каждого СтрокаСписка Из ДоговорыКонтрагентов Цикл
		
		СтрокаСписка.Отметка = Истина;
		
	КонецЦикла;
	
КонецПроцедуры // УстановитьФлажки()

&НаКлиенте
// Процедура обрабочитк команды УстановитьФлажки
//
Процедура СнятьФлажки(Команда)
	
	Для каждого СтрокаСписка Из ДоговорыКонтрагентов Цикл
		
		СтрокаСписка.Отметка = Ложь;
		
	КонецЦикла;
	
КонецПроцедуры // СнятьФлажки()

