// Процедура проверяет правильность заполнения реквизитов формы.
//
&НаКлиенте
Процедура ПроверитьЗаполнениеРеквизитовФормы(Отказ)
	
	// Проверка заполненности реквизитов.
	НомерСтроки = 0;
	
	Для каждого СтрокаПредоплата Из Предоплата Цикл
		НомерСтроки = НомерСтроки + 1;
		Если УчетВалютныхОпераций
		И НЕ ЗначениеЗаполнено(СтрокаПредоплата.Курс) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru = 'Не заполнена колонка ""Курс"" в строке '")
				+ Строка(НомерСтроки)
				+ НСтр("ru = ' списка ""Расшифровка расчетов"".'");
			Сообщение.Поле = "Документ";
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
		Если УчетВалютныхОпераций
		И НЕ ЗначениеЗаполнено(СтрокаПредоплата.Кратность) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru = 'Не заполнена колонка ""Кратность"" в строке '")
				+ Строка(НомерСтроки)
				+ НСтр("ru = ' списка ""Расшифровка расчетов"".'");
			Сообщение.Поле = "Документ";
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаПредоплата.СуммаРасчетов) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru = 'Не заполнена колонка ""Сумма расчетов"" в строке '")
				+ Строка(НомерСтроки)
				+ НСтр("ru = ' списка ""Расшифровка расчетов"".'");
			Сообщение.Поле = "Документ";
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
		Если УчетВалютныхОпераций
		И НЕ ЗначениеЗаполнено(СтрокаПредоплата.СуммаПлатежа) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru = 'Не заполнена колонка ""Сумма платежа"" в строке '")
				+ Строка(НомерСтроки)
				+ НСтр("ru = ' списка ""Расшифровка расчетов"".'");
			Сообщение.Поле = "Документ";
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ПроверитьЗаполнениеРеквизитовФормы()

// Процедура рассчитывает итоговые суммы.
//
&НаКлиенте
Процедура РассчитатьСуммыИтог()
	
	СуммаПлатежаИтог = 0;
	СуммаРасчетовИтог = 0;
	
	Для каждого ТекСтрока Из Предоплата Цикл
		СуммаПлатежаИтог = СуммаПлатежаИтог + ТекСтрока.СуммаПлатежа;
		СуммаРасчетовИтог = СуммаРасчетовИтог + ТекСтрока.СуммаРасчетов;
	КонецЦикла;
	
КонецПроцедуры // РассчитатьСуммыИтог()

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Компания = Параметры.Компания;
	Контрагент = Параметры.Контрагент;
	Договор = Параметры.Договор;
	Курс = Параметры.Курс;
	Кратность = Параметры.Кратность;
	ВалютаДокумента = Параметры.ВалютаДокумента;
	ВалютаРасчетов = Параметры.Договор.ВалютаРасчетов;
	ЕстьЗаказ = Параметры.ЕстьЗаказ;
	ЗаказВШапке = Параметры.ЗаказВШапке;
	СсылкаРеквизитФормы = Параметры.Ссылка;
	Дата = Параметры.Дата;
	СуммаДокумента = Параметры.СуммаДокумента;
	УчетВалютныхОпераций = Константы.ФункциональнаяУчетВалютныхОпераций.Получить();
	АдресПредоплатаВХранилище = Параметры.АдресПредоплатаВХранилище;
	ЭтоПодбор = Параметры.Подбор;
	
	Элементы.ПредоплатаДокумент.Видимость = Контрагент.ВестиРасчетыПоДокументам;
	Элементы.ПредоплатаЗаказ.Видимость = Контрагент.ВестиРасчетыПоЗаказам;
	Элементы.СписокАвансовДокумент.Видимость = Контрагент.ВестиРасчетыПоДокументам;
	Элементы.СписокАвансовЗаказ.Видимость = Контрагент.ВестиРасчетыПоЗаказам;
	
	Если ЗаказВШапке И Контрагент.ВестиРасчетыПоЗаказам Тогда // заказ в шапке
		Заказ = Параметры.Заказ;
		Элементы.ПредоплатаЗаказ.Видимость = Ложь;
		НоваяСтрока = СписокЗаказов.Добавить();
		НоваяСтрока.Заказ = Параметры.Заказ;
		НоваяСтрока.Всего = Параметры.СуммаДокумента;
		НоваяСтрока.ВсегоРасч = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(
			Параметры.СуммаДокумента,
			?(ВалютаРасчетов = ВалютаДокумента, Курс, 1),
			Курс,
			?(ВалютаРасчетов = ВалютаДокумента, Кратность, 1),
			Кратность
		);
	ИначеЕсли ЕстьЗаказ И Контрагент.ВестиРасчетыПоЗаказам Тогда // заказ в табличной части
		Заказ = Документы.ЗаказПокупателя.ПустаяСсылка();
		Если Параметры.Свойство("Заказ")
		   И ТипЗнч(Параметры.Заказ) = Тип("Массив") Тогда
			ТаблицаЗаказов = СписокЗаказов.Выгрузить();
			Для каждого ЭлементМассива Из Параметры.Заказ Цикл
				СтрокаЗаказов = ТаблицаЗаказов.Добавить();
				СтрокаЗаказов.Заказ = ЭлементМассива.Заказ;
				СтрокаЗаказов.Всего = ЭлементМассива.Всего;
				СтрокаЗаказов.ВсегоРасч = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(
					ЭлементМассива.Всего,
					?(ВалютаРасчетов = ВалютаДокумента, Курс, 1),
					Курс,
					?(ВалютаРасчетов = ВалютаДокумента, Кратность, 1),
					Кратность
				);
			КонецЦикла;
			ТаблицаЗаказов.Свернуть("Заказ", "ВсегоРасч");
			ТаблицаЗаказов.Сортировать("Заказ Возр");
			СписокЗаказов.Загрузить(ТаблицаЗаказов);
		КонецЕсли;
	Иначе // нет заказа
		Заказ = Документы.ЗаказПокупателя.ПустаяСсылка();
		НоваяСтрока = СписокЗаказов.Добавить();
		НоваяСтрока.Заказ = Документы.ЗаказПокупателя.ПустаяСсылка();
		НоваяСтрока.Всего = Параметры.СуммаДокумента;
		НоваяСтрока.ВсегоРасч = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(
			Параметры.СуммаДокумента,
			?(ВалютаРасчетов = ВалютаДокумента, Курс, 1),
			Курс,
			?(ВалютаРасчетов = ВалютаДокумента, Кратность, 1),
			Кратность
		);
	КонецЕсли;
	
	Если НЕ Параметры.Подбор Тогда
		Элементы.Шапка.Видимость = Ложь;
		Элементы.Авансы.Видимость = Ложь;
		Элементы.ЗаполнитьАвтоматически.Видимость = Ложь;
		Заголовок = "Восстановление предоплаты";
	КонецЕсли;
	
	Элементы.ПредоплатаДокумент.ТолькоПросмотр = Параметры.Подбор;
	Элементы.ПредоплатаЗаказ.ТолькоПросмотр = Параметры.Подбор;
	
	Элементы.ПредоплатаДобавить.Видимость = НЕ Параметры.Подбор;
	Элементы.ПредоплатаСкопировать.Видимость = НЕ Параметры.Подбор;
	
	Элементы.Предоплата.ПодчиненныеЭлементы.ПредоплатаДокумент.ОграничениеТипа = СсылкаРеквизитФормы.Метаданные().ТабличныеЧасти.Предоплата.Реквизиты.Документ.Тип;
	
	Если ЕстьЗаказ И СсылкаРеквизитФормы.Метаданные().ТабличныеЧасти.Предоплата.Реквизиты.Найти("Заказ")<>Неопределено Тогда
		Элементы.Предоплата.ПодчиненныеЭлементы.ПредоплатаЗаказ.ОграничениеТипа = СсылкаРеквизитФормы.Метаданные().ТабличныеЧасти.Предоплата.Реквизиты.Заказ.Тип;
	ИначеЕсли ТипЗнч(Заказ) = Тип("ДокументСсылка.ПриемИПередачаВРемонт") Тогда
		Элементы.Предоплата.ПодчиненныеЭлементы.ПредоплатаЗаказ.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.ПриемИПередачаВРемонт");
	КонецЕсли;
	
	НациональнаяВалюта = Константы.НациональнаяВалюта.Получить();
	СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта", НациональнаяВалюта));
	КурсНациональнаяВалюта = СтруктураПоВалюте.Курс;
	КратностьНациональнаяВалюта = СтруктураПоВалюте.Кратность; 
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта", ВалютаУчета));
	КурсВалютаУчета = СтруктураПоВалюте.Курс;
	КратностьВалютаУчета = СтруктураПоВалюте.Кратность;
	
	Если ЕстьЗаказ Тогда
		СтрокаКолонок =
			"Документ,
			|Заказ,
			|СуммаПлатежа,
			|Курс,
			|Кратность,
			|СуммаРасчетов";
	Иначе
		СтрокаКолонок =
			"Документ,
			|СуммаПлатежа,
			|Курс,
			|Кратность,
			|СуммаРасчетов";
		Элементы.ПредоплатаЗаказ.Видимость = Ложь;
		Элементы.СписокАвансовЗаказ.Видимость = Ложь;
	КонецЕсли;
	
	Предоплата.Загрузить(ПолучитьИзВременногоХранилища(АдресПредоплатаВХранилище));
	
	Для каждого ТекСтрока Из Предоплата Цикл // для корректной работы перетаскивания
		Если НЕ ЗначениеЗаполнено(ТекСтрока.Заказ) Тогда
			ТекСтрока.Заказ = Документы.ЗаказПокупателя.ПустаяСсылка();
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьАвансы();
	
КонецПроцедуры // ПриСозданииНаСервере()

// Процедура - обработчик события ПриОткрытии.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РассчитатьСуммыИтог();
	
КонецПроцедуры // ПриОткрытии()

// Процедура - обработчик нажатия кнопки ОК.
//
&НаКлиенте
Процедура ОК(Команда)
	
	Отказ = Ложь;
	
	ПроверитьЗаполнениеРеквизитовФормы(Отказ);
	
	Если НЕ Отказ Тогда
		ЗаписатьПодборВХранилище();
		Закрыть(КодВозвратаДиалога.OK);
	КонецЕсли;
	
КонецПроцедуры // ОК()

// Процедура - обработчик нажатия кнопки Обновить.
//
&НаКлиенте
Процедура Обновить(Команда)
	
	ЗаполнитьАвансы();
	
КонецПроцедуры // Обновить()

// Процедура - обработчик нажатия кнопки ЗапрашиватьСумму.
//
&НаКлиенте
Процедура ЗапрашиватьСумму(Команда)
	
	ЗапрашиватьСумму = НЕ ЗапрашиватьСумму;
	Элементы.ЗапрашиватьСумму.Пометка = ЗапрашиватьСумму;
	
КонецПроцедуры // ЗапрашиватьСумму()

// Процедура помещает результаты подбора в хранилище.
//
&НаСервере
Процедура ЗаписатьПодборВХранилище()
	
	ПредоплатаВХранилище = Предоплата.Выгрузить(, СтрокаКолонок);
	ПоместитьВоВременноеХранилище(ПредоплатаВХранилище, АдресПредоплатаВХранилище);
	
КонецПроцедуры // ЗаписатьПодборВХранилище()

// Получает набор данных с сервера для процедуры ПредоплатаДокументПриИзменении.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеДокументПриИзменении(Документ)
	
	СтруктураДанные = Новый Структура();
	
	СтруктураДанные.Вставить("СуммаРасчетов", Документ.РасшифровкаПлатежа.Итог("СуммаРасчетов"));
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеДокументПриИзменении()

// Заполняет к зачету строкой аванса.
//
&НаКлиенте
Процедура ВыборАванса(ТекущаяСтрока)
	
	СуммаРасчетов = ТекущаяСтрока.СуммаРасчетов;
	Если ЗапрашиватьСумму Тогда
		ПоказатьВводЧисла(Новый ОписаниеОповещения("ВыборАвансаЗавершение", ЭтотОбъект, Новый Структура("ТекущаяСтрока, СуммаРасчетов", ТекущаяСтрока, СуммаРасчетов)), СуммаРасчетов, "Введите сумму расчетов", , );
        Возврат;
	КонецЕсли;
	
	ВыборАвансаФрагмент(СуммаРасчетов, ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ВыборАвансаЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    ТекущаяСтрока = ДополнительныеПараметры.ТекущаяСтрока;
    СуммаРасчетов = ?(Результат = Неопределено, ДополнительныеПараметры.СуммаРасчетов, Результат);
    
    
    Если НЕ (Результат <> Неопределено) Тогда
        Возврат;
    КонецЕсли;
    
    ВыборАвансаФрагмент(СуммаРасчетов, ТекущаяСтрока);

КонецПроцедуры

&НаКлиенте
Процедура ВыборАвансаФрагмент(СуммаРасчетов, Знач ТекущаяСтрока)
    
    Перем НоваяСтрока, Строки, СтруктураПоиска;
    
    СтруктураПоиска = Новый Структура("Документ, Заказ", ТекущаяСтрока.Документ, ТекущаяСтрока.Заказ);
    Строки = Предоплата.НайтиСтроки(СтруктураПоиска);
    
    Если Строки.Количество() > 0 Тогда
        НоваяСтрока = Строки[0];
        СуммаРасчетов = СуммаРасчетов + НоваяСтрока.СуммаРасчетов;
    Иначе
        НоваяСтрока = Предоплата.Добавить();
    КонецЕсли;
    
    НоваяСтрока.Документ = ТекущаяСтрока.Документ;
    НоваяСтрока.Заказ = ТекущаяСтрока.Заказ;
    НоваяСтрока.СуммаРасчетов = СуммаРасчетов;
    
    НоваяСтрока.Курс = ?(НоваяСтрока.Курс = 0, ТекущаяСтрока.Курс, НоваяСтрока.Курс);
    НоваяСтрока.Кратность = ?(НоваяСтрока.Кратность = 0, ТекущаяСтрока.Кратность, НоваяСтрока.Кратность);
    
    Если НЕ УчетВалютныхОпераций Тогда
        НоваяСтрока.СуммаПлатежа = ТекущаяСтрока.СуммаРасчетов;
    Иначе
        Если СуммаРасчетов = ТекущаяСтрока.СуммаРасчетов
            И ВалютаДокумента = ВалютаУчета Тогда
            НоваяСтрока.СуммаПлатежа = ТекущаяСтрока.СуммаПлатежа;
        Иначе
            НоваяСтрока.СуммаПлатежа = УправлениеНебольшойФирмойКлиент.ПересчитатьИзВалютыВВалюту(
            НоваяСтрока.СуммаРасчетов,
            НоваяСтрока.Курс,
            ?(ВалютаДокумента = НациональнаяВалюта, КурсНациональнаяВалюта, Курс),
            НоваяСтрока.Кратность,
            ?(ВалютаДокумента = НациональнаяВалюта, КратностьНациональнаяВалюта, Кратность)
            );
        КонецЕсли;
    КонецЕсли;
    
    Элементы.Предоплата.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
    
    РассчитатьСуммыИтог();
    ЗаполнитьАвансы();

КонецПроцедуры

// Процедура помещает результаты выбора в подбор.
//
&НаКлиенте
Процедура СписокАвансовВыборЗначения(Элемент, СтандартнаяОбработка, Значение)
	
	СтандартнаяОбработка = Ложь;
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	ВыборАванса(ТекущаяСтрока);
	
КонецПроцедуры // СписокАвансовВыборЗначения()

// Процедура - обработчик события ПриНачалеРедактирования табличной части Предоплата.
//
&НаКлиенте
Процедура ПредоплатаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока
	   И ЗаказВШапке
	   И ЗначениеЗаполнено(Заказ) Тогда
		Элемент.ТекущиеДанные.Заказ = Заказ;
	КонецЕсли;
	
	Если Копирование Тогда
		РассчитатьСуммыИтог();
		ЗаполнитьАвансы();
	КонецЕсли;
	
КонецПроцедуры // ПредоплатаПриНачалеРедактирования()

// Процедура - обработчик события ПриИзменении поля ввода СуммаРасчетов табличной части
// Предоплата. Расчитывает сумму платежа.
//
&НаКлиенте
Процедура ПредоплатаСуммаРасчетовПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Предоплата.ТекущиеДанные;
		
	СтрокаТабличнойЧасти.Курс = ?(
		СтрокаТабличнойЧасти.Курс = 0,
			?(Курс = 0,
			1,
			Курс),
		СтрокаТабличнойЧасти.Курс
	);
	
	СтрокаТабличнойЧасти.Кратность = ?(
		СтрокаТабличнойЧасти.Кратность = 0,
			?(Кратность = 0,
			1,
			Кратность),
		СтрокаТабличнойЧасти.Кратность
	);
	
	СтрокаТабличнойЧасти.СуммаПлатежа = УправлениеНебольшойФирмойКлиент.ПересчитатьИзВалютыВВалюту(
		СтрокаТабличнойЧасти.СуммаРасчетов,
		СтрокаТабличнойЧасти.Курс,
		?(ВалютаДокумента = НациональнаяВалюта, КурсНациональнаяВалюта, Курс),
		СтрокаТабличнойЧасти.Кратность,
		?(ВалютаДокумента = НациональнаяВалюта,КратностьНациональнаяВалюта, Кратность)
	);
	
КонецПроцедуры // ПредоплатаСуммаРасчетовПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода Курс табличной части
// Предоплата. Расчитывает сумму платежа.
//
&НаКлиенте
Процедура ПредоплатаКурсПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Предоплата.ТекущиеДанные;
	
	СтрокаТабличнойЧасти.Курс = ?(
		СтрокаТабличнойЧасти.Курс = 0,
		1,
		СтрокаТабличнойЧасти.Курс
	);
	
	СтрокаТабличнойЧасти.Кратность = ?(
		СтрокаТабличнойЧасти.Кратность = 0,
		1,
		СтрокаТабличнойЧасти.Кратность
	);
	
	СтрокаТабличнойЧасти.СуммаПлатежа = УправлениеНебольшойФирмойКлиент.ПересчитатьИзВалютыВВалюту(
		СтрокаТабличнойЧасти.СуммаРасчетов,
		СтрокаТабличнойЧасти.Курс,
		?(ВалютаДокумента = НациональнаяВалюта, КурсНациональнаяВалюта, Курс),
		СтрокаТабличнойЧасти.Кратность,
		?(ВалютаДокумента = НациональнаяВалюта,КратностьНациональнаяВалюта, Кратность)
	);
	
КонецПроцедуры // ПредоплатаКурсПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода Кратность табличной части
// Предоплата. Расчитывает сумму платежа.
//
&НаКлиенте
Процедура ПредоплатаКратностьПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Предоплата.ТекущиеДанные;
	
	СтрокаТабличнойЧасти.Курс = ?(
		СтрокаТабличнойЧасти.Курс = 0,
		1,
		СтрокаТабличнойЧасти.Курс
	);
	
	СтрокаТабличнойЧасти.Кратность = ?(
		СтрокаТабличнойЧасти.Кратность = 0,
		1,
		СтрокаТабличнойЧасти.Кратность
	);
	
	СтрокаТабличнойЧасти.СуммаПлатежа = УправлениеНебольшойФирмойКлиент.ПересчитатьИзВалютыВВалюту(
		СтрокаТабличнойЧасти.СуммаРасчетов,
		СтрокаТабличнойЧасти.Курс,
		?(ВалютаДокумента = НациональнаяВалюта, КурсНациональнаяВалюта, Курс),
		СтрокаТабличнойЧасти.Кратность,
		?(ВалютаДокумента = НациональнаяВалюта,КратностьНациональнаяВалюта, Кратность)
	);
	
КонецПроцедуры // ПредоплатаКратностьПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода Документ табличной части
// Предоплата.
//
&НаКлиенте
Процедура ПредоплатаДокументПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Предоплата.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Документ) Тогда
		
		СтруктураДанные = ПолучитьДанныеДокументПриИзменении(СтрокаТабличнойЧасти.Документ);
		
		СтрокаТабличнойЧасти.СуммаРасчетов = СтруктураДанные.СуммаРасчетов;
		
		СтрокаТабличнойЧасти.Курс = 
			?(СтрокаТабличнойЧасти.Курс = 0,
				?(Курс = 0,
				1,
				Курс),
			СтрокаТабличнойЧасти.Курс
		);
		
		СтрокаТабличнойЧасти.Кратность =
			?(СтрокаТабличнойЧасти.Кратность = 0,
				?(Кратность = 0,
				1,
				Кратность),
			СтрокаТабличнойЧасти.Кратность
		);
			
		СтрокаТабличнойЧасти.СуммаПлатежа = УправлениеНебольшойФирмойКлиент.ПересчитатьИзВалютыВВалюту(
			СтрокаТабличнойЧасти.СуммаРасчетов,
			СтрокаТабличнойЧасти.Курс,
			?(ВалютаДокумента = НациональнаяВалюта, КурсНациональнаяВалюта, Курс),
			СтрокаТабличнойЧасти.Кратность,
			?(ВалютаДокумента = НациональнаяВалюта,КратностьНациональнаяВалюта, Кратность)
		);
		
	КонецЕсли;
	
КонецПроцедуры // ПредоплатаДокументПриИзменении()

// Процедура - обработчик события НачалоПеретаскивания списка СписокАвансов.
//
&НаКлиенте
Процедура СписокАвансовНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Структура = Новый Структура;
	Структура.Вставить("Документ", ТекущиеДанные.Документ);
	Структура.Вставить("Заказ", ТекущиеДанные.Заказ);
	Структура.Вставить("СуммаРасчетов", ТекущиеДанные.СуммаРасчетов);
	Структура.Вставить("Курс", ТекущиеДанные.Курс);
	Структура.Вставить("Кратность", ТекущиеДанные.Кратность);
	
	ПараметрыПеретаскивания.Значение = Структура;
	
	ПараметрыПеретаскивания.ДопустимыеДействия = ДопустимыеДействияПеретаскивания.Копирование;
	
КонецПроцедуры // СписокАвансовНачалоПеретаскивания()

// Процедура - обработчик события ПроверкаПеретаскивания списка Предоплата.
//
&НаКлиенте
Процедура ПредоплатаПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Копирование;
	
КонецПроцедуры // ПредоплатаПроверкаПеретаскивания()

// Процедура - обработчик события Перетаскивание списка Предоплата.
//
&НаКлиенте
Процедура ПредоплатаПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	ТекущаяСтрока = ПараметрыПеретаскивания.Значение;
	ВыборАванса(ТекущаяСтрока);
	
КонецПроцедуры // ПредоплатаПеретаскивание()

// Процедура - обработчик события ПриИзменении списка Предоплата.
//
&НаКлиенте
Процедура ПредоплатаПриИзменении(Элемент)
	
	РассчитатьСуммыИтог();
	ЗаполнитьАвансы();
	
КонецПроцедуры // ПредоплатаПриИзменении()

// Процедура заполняет предоплату.
//
&НаСервере
Процедура ЗаполнитьПредоплату()
	
	ТаблицаЗаказов = СписокЗаказов.Выгрузить();
	
	// Заполнение предоплаты.
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетыСПокупателямиОстатки.Документ КАК Документ,
	|	РасчетыСПокупателямиОстатки.Заказ КАК Заказ,
	|	РасчетыСПокупателямиОстатки.ДокументДата КАК ДокументДата,
	|	РасчетыСПокупателямиОстатки.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
	|	СУММА(РасчетыСПокупателямиОстатки.СуммаОстаток) КАК СуммаОстаток,
	|	СУММА(РасчетыСПокупателямиОстатки.СуммаРегОстаток) КАК СуммаРегОстаток,
	|	СУММА(РасчетыСПокупателямиОстатки.СуммаВалОстаток) КАК СуммаВалОстаток
	|ПОМЕСТИТЬ ВременнаяТаблицаРасчетыСПокупателямиОстатки
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыСПокупателямиОстатки.Договор КАК Договор,
	|		РасчетыСПокупателямиОстатки.Документ КАК Документ,
	|		РасчетыСПокупателямиОстатки.Документ.Дата КАК ДокументДата,
	|		РасчетыСПокупателямиОстатки.Заказ КАК Заказ,
	|		ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	|		ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаРегОстаток, 0) КАК СуммаРегОстаток,
	|		ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаВалОстаток, 0) КАК СуммаВалОстаток
	|	ИЗ
	|		РегистрНакопления.РасчетыСПокупателями.Остатки(
	|				,
	|				Организация = &Организация
	|					И Контрагент = &Контрагент
	|					И Договор = &Договор
	|					// ТекстЗаказВШапке
	|					И ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)) КАК РасчетыСПокупателямиОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияДокументаРасчетыСПокупателями.Договор,
	|		ДвиженияДокументаРасчетыСПокупателями.Документ,
	|		ДвиженияДокументаРасчетыСПокупателями.Документ.Дата,
	|		ДвиженияДокументаРасчетыСПокупателями.Заказ,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаРасчетыСПокупателями.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ЕСТЬNULL(ДвиженияДокументаРасчетыСПокупателями.Сумма, 0)
	|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаРасчетыСПокупателями.Сумма, 0)
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаРасчетыСПокупателями.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ЕСТЬNULL(ДвиженияДокументаРасчетыСПокупателями.СуммаРег, 0)
	|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаРасчетыСПокупателями.СуммаРег, 0)
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаРасчетыСПокупателями.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ЕСТЬNULL(ДвиженияДокументаРасчетыСПокупателями.СуммаВал, 0)
	|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаРасчетыСПокупателями.СуммаВал, 0)
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.РасчетыСПокупателями КАК ДвиженияДокументаРасчетыСПокупателями
	|	ГДЕ
	|		ДвиженияДокументаРасчетыСПокупателями.Регистратор = &Ссылка
	|		И ДвиженияДокументаРасчетыСПокупателями.Период <= &Период
	|		И ДвиженияДокументаРасчетыСПокупателями.Организация = &Организация
	|		И ДвиженияДокументаРасчетыСПокупателями.Контрагент = &Контрагент
	|		И ДвиженияДокументаРасчетыСПокупателями.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)) КАК РасчетыСПокупателямиОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСПокупателямиОстатки.Документ,
	|	РасчетыСПокупателямиОстатки.Заказ,
	|	РасчетыСПокупателямиОстатки.ДокументДата,
	|	РасчетыСПокупателямиОстатки.Договор.ВалютаРасчетов
	|
	|ИМЕЮЩИЕ
	|	СУММА(РасчетыСПокупателямиОстатки.СуммаВалОстаток) < 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетыСПокупателямиОстатки.Документ КАК Документ,
	|	РасчетыСПокупателямиОстатки.Заказ КАК Заказ,
	|	РасчетыСПокупателямиОстатки.ДокументДата КАК ДокументДата,
	|	РасчетыСПокупателямиОстатки.ВалютаРасчетов КАК ВалютаРасчетов,
	|	-СУММА(РасчетыСПокупателямиОстатки.СуммаУчета) КАК СуммаУчета,
	|	-СУММА(РасчетыСПокупателямиОстатки.СуммаРасчетов) КАК СуммаРасчетов,
	|	-СУММА(РасчетыСПокупателямиОстатки.СуммаПлатежа) КАК СуммаПлатежа,
	|	СУММА(ВЫБОР КОГДА ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаРег, 0) = 0 ТОГДА 
	|		(РасчетыСПокупателямиОстатки.СуммаУчета / ВЫБОР
	|			КОГДА ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаРасчетов, 0) <> 0
	|				ТОГДА РасчетыСПокупателямиОстатки.СуммаРасчетов
	|			ИНАЧЕ 1
	|		КОНЕЦ) * (КурсыВалютыУчетаКурс / КурсыВалютыУчетаКратность)
	|	ИНАЧЕ
	|		(РасчетыСПокупателямиОстатки.СуммаРег / ВЫБОР
	|			КОГДА ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаРасчетов, 0) <> 0
	|				ТОГДА РасчетыСПокупателямиОстатки.СуммаРасчетов
	|			ИНАЧЕ 1
	|		КОНЕЦ)
	|	КОНЕЦ) КАК Курс,
	|	1 КАК Кратность,
	|	РасчетыСПокупателямиОстатки.КурсыВалютыДокументаКурс КАК КурсыВалютыДокументаКурс,
	|	РасчетыСПокупателямиОстатки.КурсыВалютыДокументаКратность КАК КурсыВалютыДокументаКратность
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыСПокупателямиОстатки.ВалютаРасчетов КАК ВалютаРасчетов,
	|		РасчетыСПокупателямиОстатки.Документ КАК Документ,
	|		РасчетыСПокупателямиОстатки.ДокументДата КАК ДокументДата,
	|		РасчетыСПокупателямиОстатки.Заказ КАК Заказ,
	|		ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаОстаток, 0) КАК СуммаУчета,
	|		ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаВалОстаток, 0) КАК СуммаРасчетов,
	|		ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаОстаток, 0) * КурсыВалютыУчета.Курс * &КратностьВалютыДокумента / (&КурсВалютыДокумента * КурсыВалютыУчета.Кратность) КАК СуммаПлатежа,
	|		ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаРегОстаток, 0) КАК СуммаРег,
	|		КурсыВалютыУчета.Курс КАК КурсыВалютыУчетаКурс,
	|		КурсыВалютыУчета.Кратность КАК КурсыВалютыУчетаКратность,
	|		&КурсВалютыДокумента КАК КурсыВалютыДокументаКурс,
	|		&КратностьВалютыДокумента КАК КурсыВалютыДокументаКратность
	|	ИЗ
	|		ВременнаяТаблицаРасчетыСПокупателямиОстатки КАК РасчетыСПокупателямиОстатки
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, Валюта = &ВалютаУчета) КАК КурсыВалютыУчета
	|			ПО (ИСТИНА)) КАК РасчетыСПокупателямиОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСПокупателямиОстатки.Документ,
	|	РасчетыСПокупателямиОстатки.Заказ,
	|	РасчетыСПокупателямиОстатки.ДокументДата,
	|	РасчетыСПокупателямиОстатки.ВалютаРасчетов,
	|	КурсыВалютыУчетаКурс,
	|	КурсыВалютыУчетаКратность,
	|	РасчетыСПокупателямиОстатки.КурсыВалютыДокументаКурс,
	|	РасчетыСПокупателямиОстатки.КурсыВалютыДокументаКратность
	|
	|ИМЕЮЩИЕ
	|	-СУММА(РасчетыСПокупателямиОстатки.СуммаРасчетов) > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументДата";
	
	Если НЕ Контрагент.ВестиРасчетыПоЗаказам Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "// ТекстЗаказВШапке", "И Заказ = &Заказ");
		Запрос.УстановитьПараметр("Заказ", Документы.ЗаказПокупателя.ПустаяСсылка());
	ИначеЕсли ЗаказВШапке
	   ИЛИ НЕ ЕстьЗаказ Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "// ТекстЗаказВШапке", "И Заказ = &Заказ");
		Запрос.УстановитьПараметр("Заказ", Заказ);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "// ТекстЗаказВШапке", "И Заказ В (&МассивЗаказов)");
		Запрос.УстановитьПараметр("МассивЗаказов", СписокЗаказов.Выгрузить().ВыгрузитьКолонку("Заказ"));
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация", Компания);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("ВалютаДокумента", ВалютаДокумента);
	Запрос.УстановитьПараметр("ВалютаУчета", ВалютаУчета);
	Если ВалютаРасчетов = ВалютаДокумента Тогда
		Запрос.УстановитьПараметр("КурсВалютыДокумента", Курс);
		Запрос.УстановитьПараметр("КратностьВалютыДокумента", Кратность);
	Иначе
		Запрос.УстановитьПараметр("КурсВалютыДокумента", 1);
		Запрос.УстановитьПараметр("КратностьВалютыДокумента", 1);
	КонецЕсли;
	Запрос.УстановитьПараметр("Ссылка", СсылкаРеквизитФормы);
	
	Запрос.Текст = ТекстЗапроса;
	
	Предоплата.Очистить();
	
	ВыборкаРезультатаЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаРезультатаЗапроса.Следующий() Цикл
		
		НайденнаяСтрока = ТаблицаЗаказов.Найти(ВыборкаРезультатаЗапроса.Заказ, "Заказ");
		
		Если НайденнаяСтрока = Неопределено
		 ИЛИ НайденнаяСтрока.ВсегоРасч = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ВыборкаРезультатаЗапроса.СуммаРасчетов <= НайденнаяСтрока.ВсегоРасч Тогда // сумма остатка меньше или равна чем осталось распределить
			
			НоваяСтрока = Предоплата.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаРезультатаЗапроса);
			НайденнаяСтрока.ВсегоРасч = НайденнаяСтрока.ВсегоРасч - ВыборкаРезультатаЗапроса.СуммаРасчетов;
			
		Иначе // сумма остатка больше чем нужно распределить
			
			НоваяСтрока = Предоплата.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаРезультатаЗапроса);
			
			НоваяСтрока.СуммаРасчетов = НайденнаяСтрока.ВсегоРасч;
			НоваяСтрока.СуммаПлатежа = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(
				НоваяСтрока.СуммаРасчетов,
				ВыборкаРезультатаЗапроса.Курс,
				ВыборкаРезультатаЗапроса.КурсыВалютыДокументаКурс,
				ВыборкаРезультатаЗапроса.Кратность,
				ВыборкаРезультатаЗапроса.КурсыВалютыДокументаКратность
			);
			
			НайденнаяСтрока.ВсегоРасч = 0;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьПредоплату()

// Процедура - обработчик нажатия кнопки ЗаполнитьАвтоматически.
//
&НаКлиенте
Процедура ЗаполнитьАвтоматически(Команда)
	
	ЗаполнитьПредоплату();
	РассчитатьСуммыИтог();
	ЗаполнитьАвансы();
	
КонецПроцедуры // ЗаполнитьАвтоматически()

// Процедура заполняет список авансов.
//
&НаСервере
Процедура ЗаполнитьАвансы()
	
	Запрос = Новый Запрос();
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОтобранныеАвансы.Документ КАК Документ,
	|	ВЫБОР
	|		КОГДА НЕ &ЕстьЗаказ
	|			ТОГДА &Заказ
	|		КОГДА ОтобранныеАвансы.Заказ = НЕОПРЕДЕЛЕНО
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|		ИНАЧЕ ОтобранныеАвансы.Заказ
	|	КОНЕЦ КАК Заказ,
	|	&ВалютаРасчетов КАК ВалютаРасчетов,
	|	ОтобранныеАвансы.СуммаРасчетов КАК СуммаРасчетов,
	|	ОтобранныеАвансы.СуммаПлатежа КАК СуммаПлатежа
	|ПОМЕСТИТЬ ТаблицаОтобранныеАвансы
	|ИЗ
	|	&ТаблицаОтобранныеАвансы КАК ОтобранныеАвансы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетыСПокупателямиОстатки.Документ КАК Документ,
	|	РасчетыСПокупателямиОстатки.Заказ КАК Заказ,
	|	РасчетыСПокупателямиОстатки.ДокументДата КАК ДокументДата,
	|	РасчетыСПокупателямиОстатки.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
	|	СУММА(РасчетыСПокупателямиОстатки.СуммаОстаток) КАК СуммаОстаток,
	|	СУММА(РасчетыСПокупателямиОстатки.СуммаРегОстаток) КАК СуммаРегОстаток,
	|	СУММА(РасчетыСПокупателямиОстатки.СуммаВалОстаток) КАК СуммаВалОстаток
	|ПОМЕСТИТЬ ВременнаяТаблицаРасчетыСПокупателямиОстатки
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыСПокупателямиОстатки.Договор КАК Договор,
	|		РасчетыСПокупателямиОстатки.Документ КАК Документ,
	|		РасчетыСПокупателямиОстатки.Документ.Дата КАК ДокументДата,
	|		РасчетыСПокупателямиОстатки.Заказ КАК Заказ,
	|		ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	|		ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаРегОстаток, 0) КАК СуммаРегОстаток,
	|		ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаВалОстаток, 0) КАК СуммаВалОстаток
	|	ИЗ
	|		РегистрНакопления.РасчетыСПокупателями.Остатки(
	|				,
	|				Организация = &Организация
	|					И Контрагент = &Контрагент
	|					И Договор = &Договор
	|					// ТекстЗаказВШапке
	|					И ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)) КАК РасчетыСПокупателямиОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияДокументаРасчетыСПокупателями.Договор,
	|		ДвиженияДокументаРасчетыСПокупателями.Документ,
	|		ДвиженияДокументаРасчетыСПокупателями.Документ.Дата,
	|		ДвиженияДокументаРасчетыСПокупателями.Заказ,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаРасчетыСПокупателями.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ЕСТЬNULL(ДвиженияДокументаРасчетыСПокупателями.Сумма, 0)
	|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаРасчетыСПокупателями.Сумма, 0)
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаРасчетыСПокупателями.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ЕСТЬNULL(ДвиженияДокументаРасчетыСПокупателями.СуммаРег, 0)
	|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаРасчетыСПокупателями.СуммаРег, 0)
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаРасчетыСПокупателями.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ЕСТЬNULL(ДвиженияДокументаРасчетыСПокупателями.СуммаВал, 0)
	|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаРасчетыСПокупателями.СуммаВал, 0)
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.РасчетыСПокупателями КАК ДвиженияДокументаРасчетыСПокупателями
	|	ГДЕ
	|		ДвиженияДокументаРасчетыСПокупателями.Регистратор = &Ссылка
	|		И ДвиженияДокументаРасчетыСПокупателями.Период <= &Период
	|		И ДвиженияДокументаРасчетыСПокупателями.Организация = &Организация
	|		И ДвиженияДокументаРасчетыСПокупателями.Контрагент = &Контрагент
	|		И ДвиженияДокументаРасчетыСПокупателями.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)) КАК РасчетыСПокупателямиОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСПокупателямиОстатки.Документ,
	|	РасчетыСПокупателямиОстатки.Заказ,
	|	РасчетыСПокупателямиОстатки.ДокументДата,
	|	РасчетыСПокупателямиОстатки.Договор.ВалютаРасчетов
	|
	|ИМЕЮЩИЕ
	|	СУММА(РасчетыСПокупателямиОстатки.СуммаВалОстаток) < 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетыСПокупателямиОстатки.Документ КАК Документ,
	|	РасчетыСПокупателямиОстатки.Заказ КАК Заказ,
	|	РасчетыСПокупателямиОстатки.ДокументДата КАК ДокументДата,
	|	РасчетыСПокупателямиОстатки.ВалютаРасчетов КАК ВалютаРасчетов,
	|	-СУММА(РасчетыСПокупателямиОстатки.СуммаУчета) КАК СуммаУчета,
	|	-СУММА(РасчетыСПокупателямиОстатки.СуммаРасчетов) КАК СуммаРасчетов,
	|	-СУММА(РасчетыСПокупателямиОстатки.СуммаПлатежа) КАК СуммаПлатежа,
	|	-СУММА(РасчетыСПокупателямиОстатки.СуммаРег) КАК СуммаРег,
	|
	|
	|	СУММА(ВЫБОР КОГДА ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаРег, 0) = 0 ТОГДА 
	|		(РасчетыСПокупателямиОстатки.СуммаУчета / 
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаРасчетов, 0) <> 0
	|				ТОГДА РасчетыСПокупателямиОстатки.СуммаРасчетов
	|			ИНАЧЕ 1
	|		КОНЕЦ) * (КурсыВалютыУчета.Курс / КурсыВалютыУчета.Кратность)
	|	ИНАЧЕ
	|		(РасчетыСПокупателямиОстатки.СуммаРег / ВЫБОР
	|			КОГДА ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаРасчетов, 0) <> 0
	|				ТОГДА РасчетыСПокупателямиОстатки.СуммаРасчетов
	|			ИНАЧЕ 1
	|		КОНЕЦ)
	|	КОНЕЦ) КАК Курс,
	|
	|
	|	1 КАК Кратность
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыСПокупателямиОстатки.ВалютаРасчетов КАК ВалютаРасчетов,
	|		РасчетыСПокупателямиОстатки.Документ КАК Документ,
	|		РасчетыСПокупателямиОстатки.ДокументДата КАК ДокументДата,
	|		РасчетыСПокупателямиОстатки.Заказ КАК Заказ,
	|		ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаОстаток, 0) КАК СуммаУчета,
	|		ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаВалОстаток, 0) КАК СуммаРасчетов,
	|		ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаОстаток, 0) * КурсыВалютыУчета.Курс * КурсыВалютыДокумента.Кратность / (КурсыВалютыДокумента.Курс * КурсыВалютыУчета.Кратность) КАК СуммаПлатежа,
	|		ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаРегОстаток, 0) КАК СуммаРег
	|	ИЗ
	|		ВременнаяТаблицаРасчетыСПокупателямиОстатки КАК РасчетыСПокупателямиОстатки
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, Валюта = &ВалютаДокумента) КАК КурсыВалютыДокумента
	|			ПО (ИСТИНА)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, Валюта = &ВалютаУчета) КАК КурсыВалютыУчета
	|			ПО (ИСТИНА)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОтобранныеАвансы.ВалютаРасчетов,
	|		ОтобранныеАвансы.Документ,
	|		ОтобранныеАвансы.Документ.Дата,
	|		ОтобранныеАвансы.Заказ,
	|		0,
	|		ОтобранныеАвансы.СуммаРасчетов,
	|		ОтобранныеАвансы.СуммаПлатежа,
	|		0
	|	ИЗ
	|		ТаблицаОтобранныеАвансы КАК ОтобранныеАвансы) КАК РасчетыСПокупателямиОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, Валюта = &ВалютаУчета) КАК КурсыВалютыУчета
	|		ПО (ИСТИНА)
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСПокупателямиОстатки.Документ,
	|	РасчетыСПокупателямиОстатки.Заказ,
	|	РасчетыСПокупателямиОстатки.ДокументДата,
	|	РасчетыСПокупателямиОстатки.ВалютаРасчетов,
	|	КурсыВалютыУчета.Курс,
	|	КурсыВалютыУчета.Кратность
	|
	|ИМЕЮЩИЕ
	|	-СУММА(РасчетыСПокупателямиОстатки.СуммаРасчетов) > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументДата";
	
	Запрос.УстановитьПараметр("ЕстьЗаказ", ЕстьЗаказ);
	
	Если НЕ Контрагент.ВестиРасчетыПоЗаказам Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "// ТекстЗаказВШапке", "И Заказ = &Заказ");
		Запрос.УстановитьПараметр("Заказ", Документы.ЗаказПокупателя.ПустаяСсылка());
	ИначеЕсли ЗаказВШапке
	   ИЛИ НЕ ЕстьЗаказ Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "// ТекстЗаказВШапке", "И Заказ = &Заказ");
		Запрос.УстановитьПараметр("Заказ", Заказ);
	Иначе
		Запрос.УстановитьПараметр("Заказ", Документы.ЗаказПокупателя.ПустаяСсылка());
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "// ТекстЗаказВШапке", "И Заказ В (&МассивЗаказов)");
		Запрос.УстановитьПараметр("МассивЗаказов", СписокЗаказов.Выгрузить().ВыгрузитьКолонку("Заказ"));
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("Организация", Компания);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("ВалютаРасчетов", ВалютаРасчетов);
	Запрос.УстановитьПараметр("ВалютаДокумента", ВалютаДокумента);
	Запрос.УстановитьПараметр("ВалютаУчета", ВалютаУчета);
	Запрос.УстановитьПараметр("Ссылка", СсылкаРеквизитФормы);
	Запрос.УстановитьПараметр("ТаблицаОтобранныеАвансы", Предоплата.Выгрузить());
	
	Результат = Запрос.Выполнить();
	РезультатТЗ = Результат.Выгрузить();
	
	// Авансы учитываются по курсу на дату документа.
	// Получем информацию о сумме аванса, если он был в валюте.
	//Для Каждого ТекущаяСтрока Из РезультатТЗ Цикл
	//	Если ТекущаяСтрока.ВалютаРасчетов <> Константы.НациональнаяВалюта.Получить() Тогда
	//		
	//		КурсКратность = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ТекущаяСтрока.ДокументДата, Новый Структура("Валюта", ВалютаРасчетов));
	//		КурсКратностьВалДокумента = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта", ВалютаДокумента));
	//		
	//		ТекущаяСтрока.СуммаУчета = ТекущаяСтрока.СуммаРасчетов * КурсКратность.Курс / КурсКратность.Кратность;
	//		ТекущаяСтрока.Курс = КурсКратность.Курс;
	//		ТекущаяСтрока.Кратность = КурсКратность.Кратность;
	//		ТекущаяСтрока.СуммаПлатежа = ТекущаяСтрока.СуммаРасчетов * КурсКратность.Курс * КурсКратностьВалДокумента.Кратность / (КурсКратностьВалДокумента.Курс * КурсКратность.Кратность);
	//		
	//	Иначе
	//		
	//		
	//		
	//	КонецЕсли;
	//КонецЦикла;
	
	СписокАвансов.Загрузить(РезультатТЗ);
	
КонецПроцедуры // ЗаполнитьАвансы()

// Процедура запрещает добавление новых строк если не разрешен ручной подбор.
//
&НаКлиенте
Процедура ПредоплатаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если ЭтоПодбор Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры // ПредоплатаПередНачаломДобавления()
