
&НаСервере
Функция ПолучитьНомераГТД()
	
	УсловияОтбора = Новый Структура("Организация, Номенклатура, Характеристика, Партия, СтранаПроисхождения");
	ЗаполнитьЗначенияСвойств(УсловияОтбора, Параметры);
	
	Возврат Справочники.НомераГТД.ПолучитьМассивИспользуемыхНомеровГТД(УсловияОтбора);
	
КонецФункции

&НаСервере
Процедура СформироватьОтборНомеровГТД()
	
	МассивГТД = ПолучитьНомераГТД();
	Если МассивГТД.Количество() > 0 Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка", МассивГТД, ВидСравненияКомпоновкиДанных.ВСписке, "Отбор по номеру ГТД", Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СформироватьОтборНомеровГТД();
	
КонецПроцедуры
