&НаКлиенте
Перем КонтекстЭДОКлиент;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПрорисоватьСтатус(ЭтотОбъект);
	
	КонтекстЭДОСервер 		= ДокументооборотСКОВызовСервера.ПолучитьОбработкуЭДО();
	ВТребованииЕстьXMLФайл 	= КонтекстЭДОСервер.ЕстьТребованияКРазделам8_12(Объект.Требование);
	
	Если Параметры.Ключ.Пустая() Тогда
		ЗаполнитьДекларацию();
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
	УстановитьВозможностьВыбораКонтрагентов();
	
	ПослеИзмененияТребования();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Инициализируем контекст формы - контейнера клиентских методов
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриОткрытииЗавершение", ЭтотОбъект);
	ДокументооборотСКОКлиент.ПолучитьКонтекстЭДО(ОписаниеОповещения);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Контрагенты.Очистить();
	ТекущийОбъект.ДокументыОплаты.Очистить();
	ТекущийОбъект.ДатыПринятияНаУчет.Очистить();
	ТекущийОбъект.ПосредническаяДеятельность.Очистить();
	
	Для Каждого СтрокаКнигиПокупок Из Объект.КнигаПокупок Цикл
		ЗаписатьСведенияВТаблицу(СтрокаКнигиПокупок, "Продавец", ТекущийОбъект.Контрагенты);
		ЗаписатьСведенияВТаблицу(СтрокаКнигиПокупок, "ПродавецРасхождение", ТекущийОбъект.Контрагенты);
		
		ЗаписатьСведенияВТаблицу(СтрокаКнигиПокупок, "ДокументОплаты", ТекущийОбъект.ДокументыОплаты);
		ЗаписатьСведенияВТаблицу(СтрокаКнигиПокупок, "ДокументОплатыРасхождение", ТекущийОбъект.ДокументыОплаты);
		
		ЗаписатьСведенияВТаблицу(СтрокаКнигиПокупок, "ДатаПринятияНаУчет", ТекущийОбъект.ДатыПринятияНаУчет);
		ЗаписатьСведенияВТаблицу(СтрокаКнигиПокупок, "ДатаПринятияНаУчетРасхождение", ТекущийОбъект.ДатыПринятияНаУчет);
	КонецЦикла;
	
	Для Каждого СтрокаКнигиПокупок Из Объект.КнигаПокупокДл Цикл
		ЗаписатьСведенияВТаблицу(СтрокаКнигиПокупок, "Продавец", ТекущийОбъект.Контрагенты);
		ЗаписатьСведенияВТаблицу(СтрокаКнигиПокупок, "ПродавецРасхождение", ТекущийОбъект.Контрагенты);
		
		ЗаписатьСведенияВТаблицу(СтрокаКнигиПокупок, "ДокументОплаты", ТекущийОбъект.ДокументыОплаты);
		ЗаписатьСведенияВТаблицу(СтрокаКнигиПокупок, "ДокументОплатыРасхождение", ТекущийОбъект.ДокументыОплаты);
		
		ЗаписатьСведенияВТаблицу(СтрокаКнигиПокупок, "ДатаПринятияНаУчет", ТекущийОбъект.ДатыПринятияНаУчет);
		ЗаписатьСведенияВТаблицу(СтрокаКнигиПокупок, "ДатаПринятияНаУчетРасхождение", ТекущийОбъект.ДатыПринятияНаУчет);
	КонецЦикла;
	
	Для Каждого СтрокаКнигиПокупок Из Объект.КнигаПродаж Цикл
		ЗаписатьСведенияВТаблицу(СтрокаКнигиПокупок, "Покупатель", ТекущийОбъект.Контрагенты);
		ЗаписатьСведенияВТаблицу(СтрокаКнигиПокупок, "ПокупательРасхождение", ТекущийОбъект.Контрагенты);
		
		ЗаписатьСведенияВТаблицу(СтрокаКнигиПокупок, "ДокументОплаты", ТекущийОбъект.ДокументыОплаты);
		ЗаписатьСведенияВТаблицу(СтрокаКнигиПокупок, "ДокументОплатыРасхождение", ТекущийОбъект.ДокументыОплаты);
	КонецЦикла;
	
	Для Каждого СтрокаКнигиПокупок Из Объект.КнигаПродажДл Цикл
		ЗаписатьСведенияВТаблицу(СтрокаКнигиПокупок, "Покупатель", ТекущийОбъект.Контрагенты);
		ЗаписатьСведенияВТаблицу(СтрокаКнигиПокупок, "ПокупательРасхождение", ТекущийОбъект.Контрагенты);
		
		ЗаписатьСведенияВТаблицу(СтрокаКнигиПокупок, "ДокументОплаты", ТекущийОбъект.ДокументыОплаты);
		ЗаписатьСведенияВТаблицу(СтрокаКнигиПокупок, "ДокументОплатыРасхождение", ТекущийОбъект.ДокументыОплаты);
	КонецЦикла;
	
	Для Каждого СтрокаКнигиПокупок Из Объект.ЖурналУчетаВыставленныхСчетовФактур Цикл
		ЗаписатьСведенияВТаблицу(СтрокаКнигиПокупок, "ПосредническаяДеятельность", ТекущийОбъект.ПосредническаяДеятельность);
		ЗаписатьСведенияВТаблицу(СтрокаКнигиПокупок, "ПосредническаяДеятельностьРасхождение", ТекущийОбъект.ПосредническаяДеятельность);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьДобавленныеКолонкиТаблиц();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_ПоясненияКДекларацииПоНДС", , Объект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияОтправленныеРанееПоясненияНажатие(Элемент)
	
	КонтекстЭДОКлиент.ПоказатьОтправленныеОтветыНаТребованияФНС(Объект.Требование);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПредупрежедениеОбУточненнойДекларацииОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если Найти(НавигационнаяСсылкаФорматированнойСтроки, "_NewDeclaration") > 0 Тогда
		СтандартнаяОбработка = Ложь;
		
		КонтекстЭДОКлиент.ПодготовитьКорректирующуюДекларациюПоНДСИзПояснения(Объект.Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеДекларацииОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылка, СтандартнаяОбработка)
	
	Если Найти(НавигационнаяСсылка, "Декларация") > 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		ПоказатьЗначение(, Объект.Декларация);
		
	ИначеЕсли Найти(НавигационнаяСсылка, "Выбрать файл") > 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		ВыбратьФайлДекларации();
		
	ИначеЕсли Найти(НавигационнаяСсылка, "Выбрать из базы") > 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		ВыбратьДекларациюИзБазы();
		
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьПоТребованиюНажатие(Элемент)
	ПерезаполнитьПоТребованию(Неопределено);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКнигаПокупок

&НаКлиенте
Процедура КнигаПокупокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ДанныеСтроки = Объект.КнигаПокупок.Получить(ВыбраннаяСтрока);
	
	Если Поле.Имя = "КнигаПокупокРеквизитыСчетаФактуры" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуСчетаФактуры("КнигаПокупок", ДанныеСтроки, "");
	ИначеЕсли Поле.Имя = "КнигаПокупокРеквизитыСчетаФактурыРасхождение" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуРеквизитовСчетаФактуры("КнигаПокупок", ДанныеСтроки, "Расхождение");
	ИначеЕсли Поле.Имя = "КнигаПокупокПродавецИНН"
				И ДанныеСтроки.ПродавецКоличествоСтрок > 1 Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуСпискаКонтрагентов("КнигаПокупок", ДанныеСтроки, "Продавец", Элементы.КнигаПокупокГруппаПродавец.Заголовок);
	ИначеЕсли Поле.Имя = "КнигаПокупокПродавецИННРасхождение"
				И ДанныеСтроки.ПродавецРасхождениеКоличествоСтрок > 1 Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуСпискаКонтрагентов("КнигаПокупок", ДанныеСтроки, "ПродавецРасхождение", Элементы.КнигаПокупокГруппаПродавец.Заголовок);
	ИначеЕсли Поле.Имя = "КнигаПокупокДокументОплатыНомер"
				И ДанныеСтроки.ДокументОплатыКоличествоСтрок > 1 Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуДокументовОплаты("КнигаПокупок", ДанныеСтроки, "ДокументОплаты");
	ИначеЕсли Поле.Имя = "КнигаПокупокДокументОплатыРасхождениеНомер"
				И ДанныеСтроки.ДокументОплатыРасхождениеКоличествоСтрок > 1 Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуДокументовОплаты("КнигаПокупок", ДанныеСтроки, "ДокументОплатыРасхождение");
	ИначеЕсли Поле.Имя = "КнигаПокупокНомерТаможеннойДекларации" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуТаможеннойДекларации("КнигаПокупок", ДанныеСтроки, "НомерТаможеннойДекларации");
	ИначеЕсли Поле.Имя = "КнигаПокупокДатаПринятияНаУчетДата"
				И ДанныеСтроки.ДатаПринятияНаУчетКоличествоСтрок > 1 Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуДатыПринятияНаУчет("КнигаПокупок", ДанныеСтроки, "ДатаПринятияНаУчет");
	ИначеЕсли Поле.Имя = "КнигаПокупокДатаПринятияНаУчетРасхождениеДата"
				И ДанныеСтроки.ДатаПринятияНаУчетРасхождениеКоличествоСтрок > 1 Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуДатыПринятияНаУчет("КнигаПокупок", ДанныеСтроки, "ДатаПринятияНаУчетРасхождение");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПокупокРезультатПроверкиПриИзменении(Элемент)
	
	ВыбраннаяСтрока = Элементы.КнигаПокупок.ТекущаяСтрока;
	РезультатПроверкиПриИзмененииНаСервере("КнигаПокупок", ВыбраннаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПокупокРеквизитыСчетаФактурыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПокупок.ТекущиеДанные;
	
	ОткрытьФормуСчетаФактуры("КнигаПокупок", ДанныеСтроки, "");
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПокупокРеквизитыСчетаФактурыРасхождениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПокупок.ТекущиеДанные;
	
	ОткрытьФормуРеквизитовСчетаФактуры("КнигаПокупок", ДанныеСтроки, "Расхождение");
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПокупокКодВидаОперацииРасхождениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = КодыВидовОперацийПолученныхСчетовФактур();
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПокупокПродавецИННОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПокупок.ТекущиеДанные;
	
	ОткрытьФормуСпискаКонтрагентов("КнигаПокупок", ДанныеСтроки, "Продавец", Элементы.КнигаПокупокГруппаПродавец.Заголовок);
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПокупокПродавецИННРасхождениеОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПокупок.ТекущиеДанные;
	
	ОткрытьФормуСпискаКонтрагентов("КнигаПокупок", ДанныеСтроки, "ПродавецРасхождение", Элементы.КнигаПокупокГруппаПродавец.Заголовок);
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПокупокПродавецИННРасхождениеПриИзменении(Элемент)
	
	ПриИзмененииИННКонтрагентаСпискаРеквизитов("КнигаПокупок", Элементы.КнигаПокупок.ТекущаяСтрока, "ПродавецРасхождение");
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПокупокПродавецИННРасхождениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПокупок.ТекущиеДанные;
	
	ВыбратьКонтрагента("КнигаПокупок", ДанныеСтроки, "ПродавецРасхождение", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПокупокВалютаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПокупок.ТекущиеДанные;
	
	ОткрытьФормуВыбораВалюты("КнигаПокупок", ДанныеСтроки, "КодВалюты");
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПокупокВалютаРасхождениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПокупок.ТекущиеДанные;
	
	ОткрытьФормуВыбораВалюты("КнигаПокупок", ДанныеСтроки, "КодВалютыРасхождение");
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПокупокСуммаНДСРасхождениеПриИзменении(Элемент)
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПокупокДокументОплатыОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПокупок.ТекущиеДанные;
	
	ОткрытьФормуДокументовОплаты("КнигаПокупок", ДанныеСтроки, "ДокументОплаты");
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПокупокДокументОплатыРасхождениеОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПокупок.ТекущиеДанные;
	
	ОткрытьФормуДокументовОплаты("КнигаПокупок", ДанныеСтроки, "ДокументОплатыРасхождение");
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПокупокДокументОплатыРасхождениеДатаПриИзменении(Элемент)
	
	ПриИзмененииДокументаОплатыНаСервере("КнигаПокупок", Элементы.КнигаПокупок.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПокупокДокументОплатыРасхождениеНомерПриИзменении(Элемент)
	
	ПриИзмененииДокументаОплатыНаСервере("КнигаПокупок", Элементы.КнигаПокупок.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПокупокНомерТаможеннойДекларацииОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПокупок.ТекущиеДанные;
	
	ОткрытьФормуТаможеннойДекларации("КнигаПокупок", ДанныеСтроки, "НомерТаможеннойДекларации");
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПокупокНомерТаможеннойДекларацииРасхождениеОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПокупок.ТекущиеДанные;
	
	ОткрытьФормуТаможеннойДекларации("КнигаПокупок", ДанныеСтроки, "НомерТаможеннойДекларацииРасхождение");
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПокупокДатаПринятияНаУчетДатаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПокупок.ТекущиеДанные;
	
	ОткрытьФормуДатыПринятияНаУчет("КнигаПокупок", ДанныеСтроки, "ДатаПринятияНаУчет");
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПокупокДатаПринятияНаУчетРасхождениеДатаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПокупок.ТекущиеДанные;
	
	ОткрытьФормуДатыПринятияНаУчет("КнигаПокупок", ДанныеСтроки, "ДатаПринятияНаУчетРасхождение");
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПокупокДатаПринятияНаУчетРасхождениеДатаПриИзменении(Элемент)
	
	ДанныеСтроки = Элементы.КнигаПокупок.ТекущиеДанные;
	Если ДанныеСтроки.ДатаПринятияНаУчетРасхождениеДанные.Количество() = 0 Тогда
		СтруктураДанных = Новый Структура(РеквизитыДатПринятияНаУчет);
		ДанныеСтроки.ДатаПринятияНаУчетРасхождениеДанные.Добавить(СтруктураДанных);
	КонецЕсли;
	
	ДанныеСтроки.ДатаПринятияНаУчетРасхождениеДанные[0].Значение.ДатаПринятияНаУчет = ДанныеСтроки.ДатаПринятияНаУчетРасхождениеДата;
	ДанныеСтроки.ДатаПринятияНаУчетРасхождениеДанные[0].Представление = Формат(ДанныеСтроки.ДатаПринятияНаУчетРасхождениеДата, "ДЛФ=D");
	УстановитьПредставлениеДатыПринятияНаУчет(ДанныеСтроки, "ДатаПринятияНаУчетРасхождение");
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПокупокПосредникИННРасхождениеПриИзменении(Элемент)
	
	ДанныеСтроки = Элементы.КнигаПокупок.ТекущиеДанные;
	
	Сведения = СведенияОКонтрагентеПоИНН(ДанныеСтроки.ПосредникИННРасхождение);
	
	УстановитьСведенияОКонтрагентеРеквизита(ДанныеСтроки, "ПосредникИННРасхождение", Сведения);
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПокупокПосредникИННРасхождениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПокупок.ТекущиеДанные;
	
	ВыбратьКонтрагента("КнигаПокупок", ДанныеСтроки, "ПосредникИННРасхождение", Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКнигаПокупокДл

&НаКлиенте
Процедура КнигаПокупокДлВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ДанныеСтроки = Объект.КнигаПокупокДл.Получить(ВыбраннаяСтрока);
	
	Если Поле.Имя = "КнигаПокупокДлРеквизитыСчетаФактуры" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуСчетаФактуры("КнигаПокупокДл", ДанныеСтроки, "");
	ИначеЕсли Поле.Имя = "КнигаПокупокДлРеквизитыСчетаФактурыРасхождение" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуРеквизитовСчетаФактуры("КнигаПокупокДл", ДанныеСтроки, "Расхождение");
	ИначеЕсли Поле.Имя = "КнигаПокупокДлПродавецИНН"
				И ДанныеСтроки.ПродавецКоличествоСтрок > 1 Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуСпискаКонтрагентов("КнигаПокупокДл", ДанныеСтроки, "Продавец", Элементы.КнигаПокупокДлГруппаПродавец.Заголовок);
	ИначеЕсли Поле.Имя = "КнигаПокупокДлПродавецИННРасхождение"
				И ДанныеСтроки.ПродавецРасхождениеКоличествоСтрок > 1 Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуСпискаКонтрагентов("КнигаПокупокДл", ДанныеСтроки, "ПродавецРасхождение", Элементы.КнигаПокупокДлГруппаПродавец.Заголовок);
	ИначеЕсли Поле.Имя = "КнигаПокупокДлДокументОплатыНомер"
				И ДанныеСтроки.ДокументОплатыКоличествоСтрок > 1 Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуДокументовОплаты("КнигаПокупокДл", ДанныеСтроки, "ДокументОплаты");
	ИначеЕсли Поле.Имя = "КнигаПокупокДлДокументОплатыРасхождениеНомер"
				И ДанныеСтроки.ДокументОплатыРасхождениеКоличествоСтрок > 1 Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуДокументовОплаты("КнигаПокупокДл", ДанныеСтроки, "ДокументОплатыРасхождение");
	ИначеЕсли Поле.Имя = "КнигаПокупокДлНомерТаможеннойДекларации" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуТаможеннойДекларации("КнигаПокупокДл", ДанныеСтроки, "НомерТаможеннойДекларации");
	ИначеЕсли Поле.Имя = "КнигаПокупокДлДатаПринятияНаУчетДата"
				И ДанныеСтроки.ДатаПринятияНаУчетКоличествоСтрок > 1 Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуДатыПринятияНаУчет("КнигаПокупокДл", ДанныеСтроки, "ДатаПринятияНаУчет");
	ИначеЕсли Поле.Имя = "КнигаПокупокДлДатаПринятияНаУчетРасхождениеДата"
				И ДанныеСтроки.ДатаПринятияНаУчетРасхождениеКоличествоСтрок > 1 Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуДатыПринятияНаУчет("КнигаПокупокДл", ДанныеСтроки, "ДатаПринятияНаУчетРасхождение");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПокупокДлРезультатПроверкиПриИзменении(Элемент)
	
	ВыбраннаяСтрока = Элементы.КнигаПокупокДл.ТекущаяСтрока;
	РезультатПроверкиПриИзмененииНаСервере("КнигаПокупокДл", ВыбраннаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПокупокДлРеквизитыСчетаФактурыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПокупокДл.ТекущиеДанные;
	
	ОткрытьФормуСчетаФактуры("КнигаПокупокДл", ДанныеСтроки, "");
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПокупокДлРеквизитыСчетаФактурыРасхождениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПокупокДл.ТекущиеДанные;
	
	ОткрытьФормуРеквизитовСчетаФактуры("КнигаПокупокДл", ДанныеСтроки, "Расхождение");

КонецПроцедуры

&НаКлиенте
Процедура КнигаПокупокДлКодВидаОперацииРасхождениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = КодыВидовОперацийПолученныхСчетовФактур();
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПокупокДлПродавецИННОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПокупокДл.ТекущиеДанные;
	
	ОткрытьФормуСпискаКонтрагентов("КнигаПокупокДл", ДанныеСтроки, "Продавец", Элементы.КнигаПокупокДлГруппаПродавец.Заголовок);
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПокупокДлПродавецРасхождениеИННПриИзменении(Элемент)
	
	ПриИзмененииИННКонтрагентаСпискаРеквизитов("КнигаПокупокДл", Элементы.КнигаПокупокДл.ТекущаяСтрока, "ПродавецРасхождение");
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПокупокДлПродавецРасхождениеИНННачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПокупокДл.ТекущиеДанные;
	
	ВыбратьКонтрагента("КнигаПокупокДл", ДанныеСтроки, "ПродавецРасхождение", Истина);

КонецПроцедуры

&НаКлиенте
Процедура КнигаПокупокДлПродавецРасхождениеИННОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПокупокДл.ТекущиеДанные;
	
	ОткрытьФормуСпискаКонтрагентов("КнигаПокупокДл", ДанныеСтроки, "ПродавецРасхождение", Элементы.КнигаПокупокДлГруппаПродавец.Заголовок);
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПокупокДлКодВалютыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПокупокДл.ТекущиеДанные;
	
	ОткрытьФормуВыбораВалюты("КнигаПокупокДл", ДанныеСтроки, "КодВалюты");
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПокупокДлКодВалютыРасхождениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПокупокДл.ТекущиеДанные;
	
	ОткрытьФормуВыбораВалюты("КнигаПокупокДл", ДанныеСтроки, "КодВалютыРасхождение");
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПокупокДлСуммаНДСРасхождениеПриИзменении(Элемент)
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПокупокДлДатаПринятияНаУчетДатаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПокупокДл.ТекущиеДанные;
	
	ОткрытьФормуДатыПринятияНаУчет("КнигаПокупокДл", ДанныеСтроки, "ДатаПринятияНаУчет");
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПокупокДлДатаПринятияНаУчетРасхождениеДатаПриИзменении(Элемент)
	
	ДанныеСтроки = Элементы.КнигаПокупокДл.ТекущиеДанные;
	Если ДанныеСтроки.ДатаПринятияНаУчетРасхождениеДанные.Количество() = 0 Тогда
		СтруктураДанных = Новый Структура(РеквизитыДатПринятияНаУчет);
		ДанныеСтроки.ДатаПринятияНаУчетРасхождениеДанные.Добавить(СтруктураДанных);
	КонецЕсли;
	
	ДанныеСтроки.ДатаПринятияНаУчетРасхождениеДанные[0].Значение.ДатаПринятияНаУчет = ДанныеСтроки.ДатаПринятияНаУчетРасхождениеДата;
	ДанныеСтроки.ДатаПринятияНаУчетРасхождениеДанные[0].Представление = Формат(ДанныеСтроки.ДатаПринятияНаУчетРасхождениеДата, "ДЛФ=D");
	УстановитьПредставлениеДатыПринятияНаУчет(ДанныеСтроки, "ДатаПринятияНаУчетРасхождение");
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПокупокДлДатаПринятияНаУчетРасхождениеДатаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПокупокДл.ТекущиеДанные;
	
	ОткрытьФормуДатыПринятияНаУчет("КнигаПокупокДл", ДанныеСтроки, "ДатаПринятияНаУчетРасхождение");
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПокупокДлДокументОплатыНомерОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПокупокДл.ТекущиеДанные;
	
	ОткрытьФормуДокументовОплаты("КнигаПокупокДл", ДанныеСтроки, "ДокументОплаты");
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПокупокДлДокументОплатыДатаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПокупокДл.ТекущиеДанные;
	
	ОткрытьФормуДокументовОплаты("КнигаПокупокДл", ДанныеСтроки, "ДокументОплаты");
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПокупокДлДокументОплатыРасхождениеНомерПриИзменении(Элемент)
	
	ПриИзмененииДокументаОплатыНаСервере("КнигаПокупокДл", Элементы.КнигаПокупокДл.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПокупокДлДокументОплатыРасхождениеНомерОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПокупокДл.ТекущиеДанные;
	
	ОткрытьФормуДокументовОплаты("КнигаПокупокДл", ДанныеСтроки, "ДокументОплатыРасхождение");
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПокупокДлДокументОплатыРасхождениеДатаПриИзменении(Элемент)
	
	ПриИзмененииДокументаОплатыНаСервере("КнигаПокупокДл", Элементы.КнигаПокупокДл.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПокупокДлДокументОплатыРасхождениеДатаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПокупокДл.ТекущиеДанные;
	
	ОткрытьФормуДокументовОплаты("КнигаПокупокДл", ДанныеСтроки, "ДокументОплатыРасхождение");
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПокупокДлНомерТаможеннойДекларацииОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПокупокДл.ТекущиеДанные;
	
	ОткрытьФормуТаможеннойДекларации("КнигаПокупокДл", ДанныеСтроки, "НомерТаможеннойДекларации");
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПокупокДлНомерТаможеннойДекларацииРасхождениеОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПокупокДл.ТекущиеДанные;
	
	ОткрытьФормуТаможеннойДекларации("КнигаПокупокДл", ДанныеСтроки, "НомерТаможеннойДекларацииРасхождение");
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПокупокДлПосредникИННРасхождениеПриИзменении(Элемент)
	
	ДанныеСтроки = Элементы.КнигаПокупокДл.ТекущиеДанные;
	
	Сведения = СведенияОКонтрагентеПоИНН(ДанныеСтроки.ПосредникИННРасхождение);
	
	УстановитьСведенияОКонтрагентеРеквизита(ДанныеСтроки, "ПосредникИННРасхождение", Сведения);
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПокупокДлПосредникИННРасхождениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПокупокДл.ТекущиеДанные;
	
	ВыбратьКонтрагента("КнигаПокупокДл", ДанныеСтроки, "ПосредникИННРасхождение", Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКнигаПродаж

&НаКлиенте
Процедура КнигаПродажВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ДанныеСтроки = Объект.КнигаПродаж.Получить(ВыбраннаяСтрока);
	
	Если Поле.Имя = "КнигаПродажРеквизитыСчетаФактуры" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуСчетаФактуры("КнигаПродаж", ДанныеСтроки, "");
	ИначеЕсли Поле.Имя = "КнигаПродажРеквизитыСчетаФактурыРасхождение" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуРеквизитовСчетаФактуры("КнигаПродаж", ДанныеСтроки, "Расхождение");
	ИначеЕсли Поле.Имя = "КнигаПродажПокупательИНН"
				И ДанныеСтроки.ПокупательКоличествоСтрок > 1 Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуСпискаКонтрагентов("КнигаПродаж", ДанныеСтроки, "Покупатель", Элементы.КнигаПродажГруппаПокупатель.Заголовок);
	ИначеЕсли Поле.Имя = "КнигаПродажПокупательРасхождениеИНН"
				И ДанныеСтроки.ПокупательРасхождениеКоличествоСтрок > 1 Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуСпискаКонтрагентов("КнигаПродаж", ДанныеСтроки, "ПокупательРасхождение", Элементы.КнигаПродажГруппаПокупатель.Заголовок);
	ИначеЕсли Поле.Имя = "КнигаПродажДокументОплатыНомер"
				И ДанныеСтроки.ДокументОплатыКоличествоСтрок > 1 Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуДокументовОплаты("КнигаПродаж", ДанныеСтроки, "ДокументОплаты");
	ИначеЕсли Поле.Имя = "КнигаПродажДокументОплатыРасхождениеНомер"
				И ДанныеСтроки.ДокументОплатыРасхождениеКоличествоСтрок > 1 Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуДокументовОплаты("КнигаПродаж", ДанныеСтроки, "ДокументОплатыРасхождение");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПродажРезультатПроверкиПриИзменении(Элемент)
	
	ВыбраннаяСтрока = Элементы.КнигаПродаж.ТекущаяСтрока;
	РезультатПроверкиПриИзмененииНаСервере("КнигаПродаж", ВыбраннаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПродажРеквизитыСчетаФактурыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПродаж.ТекущиеДанные;
	
	ОткрытьФормуСчетаФактуры("КнигаПродаж", ДанныеСтроки, "");
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПродажРеквизитыСчетаФактурыРасхождениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПродаж.ТекущиеДанные;
	
	ОткрытьФормуРеквизитовСчетаФактуры("КнигаПродаж", ДанныеСтроки, "Расхождение");
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПродажКодВидаОперацииРасхождениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = КодыВидовОперацийВыданныхСчетовФактур();
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПродажПокупательИННОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПродаж.ТекущиеДанные;
	
	ОткрытьФормуСпискаКонтрагентов("КнигаПродаж", ДанныеСтроки, "Покупатель", Элементы.КнигаПродажГруппаПокупатель.Заголовок);
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПродажПокупательРасхождениеИННПриИзменении(Элемент)
	
	ПриИзмененииИННКонтрагентаСпискаРеквизитов("КнигаПродаж", Элементы.КнигаПродаж.ТекущаяСтрока, "ПокупательРасхождение");
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПродажПокупательРасхождениеИНННачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПродаж.ТекущиеДанные;
	
	ВыбратьКонтрагента("КнигаПродаж", ДанныеСтроки, "ПокупательРасхождение", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПродажПокупательРасхождениеИННОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПродаж.ТекущиеДанные;
	
	ОткрытьФормуСпискаКонтрагентов("КнигаПродаж", ДанныеСтроки, "ПокупательРасхождение", Элементы.КнигаПродажГруппаПокупатель.Заголовок);
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПродажКодВалютыРасхождениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПродаж.ТекущиеДанные;
	
	ОткрытьФормуВыбораВалюты("КнигаПродаж", ДанныеСтроки, "КодВалютыРасхождение");
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПродажСуммаНДС18РасхождениеПриИзменении(Элемент)
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПродажСуммаНДС10РасхождениеПриИзменении(Элемент)
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПродажДокументОплатыНомерОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПродаж.ТекущиеДанные;
	
	ОткрытьФормуДокументовОплаты("КнигаПродаж", ДанныеСтроки, "ДокументОплаты");
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПродажДокументОплатыДатаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПродаж.ТекущиеДанные;
	
	ОткрытьФормуДокументовОплаты("КнигаПродаж", ДанныеСтроки, "ДокументОплаты");
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПродажДокументОплатыРасхождениеНомерПриИзменении(Элемент)
	
	ПриИзмененииДокументаОплатыНаСервере("КнигаПродаж", Элементы.КнигаПродаж.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПродажДокументОплатыРасхождениеДатаПриИзменении(Элемент)
	
	ПриИзмененииДокументаОплатыНаСервере("КнигаПродаж", Элементы.КнигаПродаж.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПродажДокументОплатыРасхождениеНомерОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПродаж.ТекущиеДанные;
	
	ОткрытьФормуДокументовОплаты("КнигаПродаж", ДанныеСтроки, "ДокументОплатыРасхождение");
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПродажДокументОплатыРасхождениеДатаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПродаж.ТекущиеДанные;
	
	ОткрытьФормуДокументовОплаты("КнигаПродаж", ДанныеСтроки, "ДокументОплатыРасхождение");
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПродажПосредникИННРасхождениеПриИзменении(Элемент)
	
	ДанныеСтроки = Элементы.КнигаПродаж.ТекущиеДанные;
	
	Сведения = СведенияОКонтрагентеПоИНН(ДанныеСтроки.ПосредникИННРасхождение);
	
	УстановитьСведенияОКонтрагентеРеквизита(ДанныеСтроки, "ПосредникИННРасхождение", Сведения);

КонецПроцедуры

&НаКлиенте
Процедура КнигаПродажПосредникИННРасхождениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПродаж.ТекущиеДанные;
	
	ВыбратьКонтрагента("КнигаПродаж", ДанныеСтроки, "ПосредникИННРасхождение", Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКнигаПродажДл

&НаКлиенте
Процедура КнигаПродажДлВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ДанныеСтроки = Объект.КнигаПродажДл.Получить(ВыбраннаяСтрока);
	
	Если Поле.Имя = "КнигаПродажДлРеквизитыСчетаФактуры" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуСчетаФактуры("КнигаПродажДл", ДанныеСтроки, "");
	ИначеЕсли Поле.Имя = "КнигаПродажДлРеквизитыСчетаФактурыРасхождение" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуРеквизитовСчетаФактуры("КнигаПродажДл", ДанныеСтроки, "Расхождение");
	ИначеЕсли Поле.Имя = "КнигаПродажДлПокупательИНН"
				И ДанныеСтроки.ПокупательКоличествоСтрок > 1 Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуСпискаКонтрагентов("КнигаПродажДл", ДанныеСтроки, "Покупатель", Элементы.КнигаПродажДлГруппаПокупатель.Заголовок);
	ИначеЕсли Поле.Имя = "КнигаПродажДлПокупательРасхождениеИНН"
				И ДанныеСтроки.ПокупательРасхождениеКоличествоСтрок > 1 Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуСпискаКонтрагентов("КнигаПродажДл", ДанныеСтроки, "ПокупательРасхождение", Элементы.КнигаПродажДлГруппаПокупатель.Заголовок);
	ИначеЕсли Поле.Имя = "КнигаПродажДлДокументОплатыНомер"
				И ДанныеСтроки.ДокументОплатыКоличествоСтрок > 1 Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуДокументовОплаты("КнигаПродажДл", ДанныеСтроки, "ДокументОплаты");
	ИначеЕсли Поле.Имя = "КнигаПродажДлДокументОплатыРасхождениеНомер"
				И ДанныеСтроки.ДокументОплатыРасхождениеКоличествоСтрок > 1 Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуДокументовОплаты("КнигаПродажДл", ДанныеСтроки, "ДокументОплатыРасхождение");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПродажДлРезультатПроверкиПриИзменении(Элемент)
	
	ВыбраннаяСтрока = Элементы.КнигаПродажДл.ТекущаяСтрока;
	РезультатПроверкиПриИзмененииНаСервере("КнигаПродажДл", ВыбраннаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПродажДлРеквизитыСчетаФактурыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПродажДл.ТекущиеДанные;
	
	ОткрытьФормуСчетаФактуры("КнигаПродажДл", ДанныеСтроки, "");
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПродажДлРеквизитыСчетаФактурыРасхождениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПродажДл.ТекущиеДанные;
	
	ОткрытьФормуРеквизитовСчетаФактуры("КнигаПродажДл", ДанныеСтроки, "Расхождение");
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПродажДлКодВидаОперацииРасхождениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = КодыВидовОперацийВыданныхСчетовФактур();
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПродажДлПокупательИННОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПродажДл.ТекущиеДанные;
	
	ОткрытьФормуСпискаКонтрагентов("КнигаПродажДл", ДанныеСтроки, "Покупатель", Элементы.КнигаПродажДлГруппаПокупатель.Заголовок);
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПродажДлПокупательРасхождениеИННПриИзменении(Элемент)
	
	ПриИзмененииИННКонтрагентаСпискаРеквизитов("КнигаПродажДл", Элементы.КнигаПродажДл.ТекущаяСтрока, "ПокупательРасхождение");
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПродажДлПокупательРасхождениеИНННачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПродажДл.ТекущиеДанные;
	
	ВыбратьКонтрагента("КнигаПродажДл", ДанныеСтроки, "ПокупательРасхождение", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПродажДлПокупательРасхождениеИННОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПродажДл.ТекущиеДанные;
	
	ОткрытьФормуСпискаКонтрагентов("КнигаПродажДл", ДанныеСтроки, "ПокупательРасхождение", Элементы.КнигаПродажДлГруппаПокупатель.Заголовок);
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПродажДлКодВалютыРасхождениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПродажДл.ТекущиеДанные;
	
	ОткрытьФормуВыбораВалюты("КнигаПродажДл", ДанныеСтроки, "КодВалютыРасхождение");
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПродажДлСуммаНДС18РасхождениеПриИзменении(Элемент)
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПродажДлСуммаНДС10РасхождениеПриИзменении(Элемент)
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПродажДлДокументОплатыНомерОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПродажДл.ТекущиеДанные;
	
	ОткрытьФормуДокументовОплаты("КнигаПродажДл", ДанныеСтроки, "ДокументОплаты");
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПродажДлДокументОплатыДатаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПродажДл.ТекущиеДанные;
	
	ОткрытьФормуДокументовОплаты("КнигаПродажДл", ДанныеСтроки, "ДокументОплаты");
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПродажДлДокументОплатыРасхождениеНомерПриИзменении(Элемент)
	
	ПриИзмененииДокументаОплатыНаСервере("КнигаПродажДл", Элементы.КнигаПродажДл.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПродажДлДокументОплатыРасхождениеДатаПриИзменении(Элемент)
	
	ПриИзмененииДокументаОплатыНаСервере("КнигаПродажДл", Элементы.КнигаПродажДл.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПродажДлДокументОплатыРасхождениеНомерОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПродажДл.ТекущиеДанные;
	
	ОткрытьФормуДокументовОплаты("КнигаПродажДл", ДанныеСтроки, "ДокументОплатыРасхождение");
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПродажДлДокументОплатыРасхождениеДатаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПродажДл.ТекущиеДанные;
	
	ОткрытьФормуДокументовОплаты("КнигаПродажДл", ДанныеСтроки, "ДокументОплатыРасхождение");
	
КонецПроцедуры

&НаКлиенте
Процедура КнигаПродажДлПосредникИННРасхождениеПриИзменении(Элемент)
	
	ДанныеСтроки = Элементы.КнигаПродажДл.ТекущиеДанные;
	
	Сведения = СведенияОКонтрагентеПоИНН(ДанныеСтроки.ПосредникИННРасхождение);
	
	УстановитьСведенияОКонтрагентеРеквизита(ДанныеСтроки, "ПосредникИННРасхождение", Сведения);

КонецПроцедуры

&НаКлиенте
Процедура КнигаПродажДлПосредникИННРасхождениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.КнигаПродажДл.ТекущиеДанные;
	
	ВыбратьКонтрагента("КнигаПродажДл", ДанныеСтроки, "ПосредникИННРасхождение", Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЖурналУчетаВыставленныхСчетовФактур

&НаКлиенте
Процедура ЖурналУчетаВыставленныхСчетовФактурВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ДанныеСтроки = Объект.ЖурналУчетаВыставленныхСчетовФактур.Получить(ВыбраннаяСтрока);
	
	Если Поле.Имя = "ЖурналУчетаВыставленныхСчетовФактурРеквизитыСчетаФактуры" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуРеквизитовСчетаФактуры("ЖурналУчетаВыставленныхСчетовФактур", ДанныеСтроки, "");
	ИначеЕсли Поле.Имя = "ЖурналУчетаВыставленныхСчетовФактурРеквизитыСчетаФактурыРасхождение" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуРеквизитовСчетаФактуры("ЖурналУчетаВыставленныхСчетовФактур", ДанныеСтроки, "Расхождение");
	ИначеЕсли Поле.Имя = "ЖурналУчетаВыставленныхСчетовФактурПосредническаяДеятельностьПредставление" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуПосредническойДеятельности("ЖурналУчетаВыставленныхСчетовФактур", ДанныеСтроки, "ПосредническаяДеятельность");
	ИначеЕсли Поле.Имя = "ЖурналУчетаВыставленныхСчетовФактурПосредническаяДеятельностьРасхождениеПредставление" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуПосредническойДеятельности("ЖурналУчетаВыставленныхСчетовФактур", ДанныеСтроки, "ПосредническаяДеятельностьРасхождение");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналУчетаВыставленныхСчетовФактурРезультатПроверкиПриИзменении(Элемент)
	
	ВыбраннаяСтрока = Элементы.ЖурналУчетаВыставленныхСчетовФактур.ТекущаяСтрока;
	РезультатПроверкиПриИзмененииНаСервере("ЖурналУчетаВыставленныхСчетовФактур", ВыбраннаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналУчетаВыставленныхСчетовФактурРеквизитыСчетаФактурыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.ЖурналУчетаВыставленныхСчетовФактур.ТекущиеДанные;
	
	ОткрытьФормуРеквизитовСчетаФактуры("ЖурналУчетаВыставленныхСчетовФактур", ДанныеСтроки, "");
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналУчетаВыставленныхСчетовФактурРеквизитыСчетаФактурыРасхождениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.ЖурналУчетаВыставленныхСчетовФактур.ТекущиеДанные;
	
	ОткрытьФормуРеквизитовСчетаФактуры("ЖурналУчетаВыставленныхСчетовФактур", ДанныеСтроки, "Расхождение");
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналУчетаВыставленныхСчетовФактурПосредническаяДеятельностьПредставлениеОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.ЖурналУчетаВыставленныхСчетовФактур.ТекущиеДанные;
	
	ОткрытьФормуПосредническойДеятельности("ЖурналУчетаВыставленныхСчетовФактур", ДанныеСтроки, "ПосредническаяДеятельность");
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналУчетаВыставленныхСчетовФактурПосредническаяДеятельностьРасхождениеПредставлениеОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.ЖурналУчетаВыставленныхСчетовФактур.ТекущиеДанные;
	
	ОткрытьФормуПосредническойДеятельности("ЖурналУчетаВыставленныхСчетовФактур", ДанныеСтроки, "ПосредническаяДеятельностьРасхождение");
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналУчетаВыставленныхСчетовФактурПокупательИННРасхождениеПриИзменении(Элемент)
	
	ДанныеСтроки = Элементы.ЖурналУчетаВыставленныхСчетовФактур.ТекущиеДанные;
	
	Сведения = СведенияОКонтрагентеПоИНН(ДанныеСтроки.ПокупательИННРасхождение);
	
	УстановитьСведенияОКонтрагентеРеквизита(ДанныеСтроки, "ПокупательИННРасхождение", Сведения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналУчетаВыставленныхСчетовФактурПокупательИННРасхождениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.ЖурналУчетаВыставленныхСчетовФактур.ТекущиеДанные;
	
	ВыбратьКонтрагента("ЖурналУчетаВыставленныхСчетовФактур", ДанныеСтроки, "ПокупательИННРасхождение", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналУчетаВыставленныхСчетовФактурКодВидаОперацииРасхождениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = КодыВидовОперацийВыданныхСчетовФактур(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЖурналУчетаПолученныхСчетовФактур

&НаКлиенте
Процедура ЖурналУчетаПолученныхСчетовФактурВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ДанныеСтроки = Объект.ЖурналУчетаПолученныхСчетовФактур.Получить(ВыбраннаяСтрока);
	
	Если Поле.Имя = "ЖурналУчетаПолученныхСчетовФактурРеквизитыСчетаФактуры" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуРеквизитовСчетаФактуры("ЖурналУчетаПолученныхСчетовФактур", ДанныеСтроки, "");
	ИначеЕсли Поле.Имя = "ЖурналУчетаПолученныхСчетовФактурРеквизитыСчетаФактурыРасхождение" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуРеквизитовСчетаФактуры("ЖурналУчетаПолученныхСчетовФактур", ДанныеСтроки, "Расхождение");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналУчетаПолученныхСчетовФактурРезультатПроверкиПриИзменении(Элемент)
	
	ВыбраннаяСтрока = Элементы.ЖурналУчетаПолученныхСчетовФактур.ТекущаяСтрока;
	РезультатПроверкиПриИзмененииНаСервере("ЖурналУчетаПолученныхСчетовФактур", ВыбраннаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналУчетаПолученныхСчетовФактурРеквизитыСчетаФактурыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.ЖурналУчетаПолученныхСчетовФактур.ТекущиеДанные;
	
	ОткрытьФормуРеквизитовСчетаФактуры("ЖурналУчетаПолученныхСчетовФактур", ДанныеСтроки, "");
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналУчетаПолученныхСчетовФактурРеквизитыСчетаФактурыРасхождениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.ЖурналУчетаПолученныхСчетовФактур.ТекущиеДанные;
	
	ОткрытьФормуРеквизитовСчетаФактуры("ЖурналУчетаПолученныхСчетовФактур", ДанныеСтроки, "Расхождение");
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналУчетаПолученныхСчетовФактурКодВалютыРасхождениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.ЖурналУчетаПолученныхСчетовФактур.ТекущиеДанные;
	
	ОткрытьФормуВыбораВалюты("ЖурналУчетаПолученныхСчетовФактур", ДанныеСтроки, "КодВалютыРасхождение");
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналУчетаПолученныхСчетовФактурПродавецИННРасхождениеПриИзменении(Элемент)
	
	ДанныеСтроки = Элементы.ЖурналУчетаПолученныхСчетовФактур.ТекущиеДанные;
	
	Сведения = СведенияОКонтрагентеПоИНН(ДанныеСтроки.ПродавецИННРасхождение);
	
	УстановитьСведенияОКонтрагентеРеквизита(ДанныеСтроки, "ПродавецИННРасхождение", Сведения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналУчетаПолученныхСчетовФактурПродавецИННРасхождениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.ЖурналУчетаПолученныхСчетовФактур.ТекущиеДанные;
	
	ВыбратьКонтрагента("ЖурналУчетаПолученныхСчетовФактур", ДанныеСтроки, "ПродавецИННРасхождение", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналУчетаПолученныхСчетовФактурСубкомиссионерИННРасхождениеПриИзменении(Элемент)
	
	ДанныеСтроки = Элементы.ЖурналУчетаПолученныхСчетовФактур.ТекущиеДанные;
	
	Сведения = СведенияОКонтрагентеПоИНН(ДанныеСтроки.СубкомиссионерИННРасхождение);
	
	УстановитьСведенияОКонтрагентеРеквизита(ДанныеСтроки, "СубкомиссионерИННРасхождение", Сведения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналУчетаПолученныхСчетовФактурСубкомиссионерИННРасхождениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.ЖурналУчетаПолученныхСчетовФактур.ТекущиеДанные;
	
	ВыбратьКонтрагента("ЖурналУчетаПолученныхСчетовФактур", ДанныеСтроки, "СубкомиссионерИННРасхождение", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналУчетаПолученныхСчетовФактурКодВидаОперацииРасхождениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = КодыВидовОперацийПолученныхСчетовФактур(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВыставленныеСчетаФактурыНеплательщиковНДС

&НаКлиенте
Процедура ВыставленныеСчетаФактурыНеплательщиковНДСРезультатПроверкиПриИзменении(Элемент)
	
	ВыбраннаяСтрока = Элементы.ВыставленныеСчетаФактурыНеплательщиковНДС.ТекущаяСтрока;
	РезультатПроверкиПриИзмененииНаСервере("ВыставленныеСчетаФактурыНеплательщиковНДС", ВыбраннаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыставленныеСчетаФактурыНеплательщиковНДСКодВалютыРасхождениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.ВыставленныеСчетаФактурыНеплательщиковНДС.ТекущиеДанные;
	
	ОткрытьФормуВыбораВалюты("ВыставленныеСчетаФактурыНеплательщиковНДС", ДанныеСтроки, "КодВалютыРасхождение");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыставленныеСчетаФактурыНеплательщиковНДСПокупательИННРасхождениеПриИзменении(Элемент)
	
	ДанныеСтроки = Элементы.ВыставленныеСчетаФактурыНеплательщиковНДС.ТекущиеДанные;
	
	Сведения = СведенияОКонтрагентеПоИНН(ДанныеСтроки.ПокупательИННРасхождение);
	
	УстановитьСведенияОКонтрагентеРеквизита(ДанныеСтроки, "ПокупательИННРасхождение", Сведения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыставленныеСчетаФактурыНеплательщиковНДСПокупательИННРасхождениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.ВыставленныеСчетаФактурыНеплательщиковНДС.ТекущиеДанные;
	
	ВыбратьКонтрагента("ВыставленныеСчетаФактурыНеплательщиковНДС", ДанныеСтроки, "ПокупательИННРасхождение", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыставленныеСчетаФактурыНеплательщиковНДССуммаНДСРасхождениеПриИзменении(Элемент)
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНетКнигаПрод

&НаКлиенте
Процедура НетКнигаПродКодВидаОперацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = КодыВидовОперацийВыданныхСчетовФактур();
	
КонецПроцедуры

&НаКлиенте
Процедура НетКнигаПродКодВидаОперацииРасхождениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = КодыВидовОперацийВыданныхСчетовФактур();
	
КонецПроцедуры

&НаКлиенте
Процедура НетКнигаПродПокупательИННПриИзменении(Элемент)
	
	НетКнигаПродПокупательПриИзмененииКонтрагента(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НетКнигаПродПокупательИНННачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	НетКнигаПродПокупательНачалоВыбораКонтрагента(СтандартнаяОбработка, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НетКнигаПродПокупательИННРасхождениеПриИзменении(Элемент)
	
	НетКнигаПродПокупательПриИзмененииКонтрагента(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НетКнигаПродПокупательИННРасхождениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	НетКнигаПродПокупательНачалоВыбораКонтрагента(СтандартнаяОбработка, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НетКнигаПродПосредникИННПриИзменении(Элемент)
	
	НетКнигаПродПокупательПриИзмененииКонтрагента(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НетКнигаПродПосредникИНННачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	НетКнигаПродПокупательНачалоВыбораКонтрагента(СтандартнаяОбработка, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НетКнигаПродПосредникИННРасхождениеПриИзменении(Элемент)
	
	НетКнигаПродПокупательПриИзмененииКонтрагента(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НетКнигаПродПосредникИННРасхождениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	НетКнигаПродПокупательНачалоВыбораКонтрагента(СтандартнаяОбработка, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НетКнигаПродРазделПриИзменении(Элемент)
	
	НетКнигаПродУстановитьЗначениеРасхождения("Раздел");
	
КонецПроцедуры

&НаКлиенте
Процедура НетКнигаПродНомерСчетаФактурыПриИзменении(Элемент)
	
	НетКнигаПродУстановитьЗначениеРасхождения("НомерСчетаФактуры");
	
КонецПроцедуры

&НаКлиенте
Процедура НетКнигаПродКодВидаОперацииПриИзменении(Элемент)
	
	НетКнигаПродУстановитьЗначениеРасхождения("КодВидаОперации");
	
КонецПроцедуры

&НаКлиенте
Процедура НетКнигаПродСтоимостьВсегоПриИзменении(Элемент)
	
	НетКнигаПродУстановитьЗначениеРасхождения("СтоимостьВсего");
	
КонецПроцедуры

&НаКлиенте
Процедура НетКнигаПродДатаСчетаФактурыПриИзменении(Элемент)
	
	НетКнигаПродУстановитьЗначениеРасхождения("ДатаСчетаФактуры");
	
КонецПроцедуры

&НаКлиенте
Процедура НетКнигаПродСтоимостьРубВсегоПриИзменении(Элемент)
	
	НетКнигаПродУстановитьЗначениеРасхождения("СтоимостьРубВсего");
	
КонецПроцедуры

&НаКлиенте
Процедура НетКнигаПродПокупательКПППриИзменении(Элемент)
	
	НетКнигаПродПокупательПриИзмененииКонтрагента(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НетКнигаПродПокупательКППНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	НетКнигаПродПокупательНачалоВыбораКонтрагента(СтандартнаяОбработка, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НетКнигаПродПокупательКППРасхождениеПриИзменении(Элемент)
	
	НетКнигаПродПокупательПриИзмененииКонтрагента(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НетКнигаПродПокупательКППРасхождениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	НетКнигаПродПокупательНачалоВыбораКонтрагента(СтандартнаяОбработка, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НетКнигаПродПосредникКПППриИзменении(Элемент)
	
	НетКнигаПродПокупательПриИзмененииКонтрагента(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НетКнигаПродПосредникКППНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	НетКнигаПродПокупательНачалоВыбораКонтрагента(СтандартнаяОбработка, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НетКнигаПродПосредникКППРасхождениеПриИзменении(Элемент)
	
	НетКнигаПродПокупательПриИзмененииКонтрагента(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НетКнигаПродПосредникКППРасхождениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	НетКнигаПродПокупательНачалоВыбораКонтрагента(СтандартнаяОбработка, Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Отправить(Команда)
	
	Если (Модифицированность ИЛИ Параметры.Ключ.Пустая()) 
		И Не Записать() Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	ПроверитьЗаполнениеТабличныхЧастейПередОтправкой(Отказ);
	
	Если Не Отказ Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеОтправкиЗавершение", ЭтотОбъект);
		ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОтправитьПояснение(КонтекстЭДОКлиент, Объект.Ссылка, Объект.Организация, УникальныйИдентификатор, ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьПоТребованию(Команда)
	
	ТекстВопроса = НСтр("ru = 'Перезаполнить пояснение без учета ранее отправленных пояснений?
						|Изменения данного документа будут потеряны.'");
	
	Оповещение = Новый ОписаниеОповещения("ПерезаполнитьПоТребованиюЗавершение", ЭтотОбъект);
	
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьПоТребованиюЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ПерезаполнитьПоТребованиюНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораФайлДекларации(ФайлыБылиВыбраны, АдресДанных, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если ФайлыБылиВыбраны Тогда
		
		ИдДекларации = ИдДекларации(АдресДанных, ВыбранноеИмяФайла);
		Если ЗначениеЗаполнено(ИдДекларации) Тогда
			Объект.Декларация 	= ИдДекларации;
			Модифицированность 	= Истина;
			УправлениеДекларацией(ЭтотОбъект);
		КонецЕсли;
		
	КонецЕсли;
			
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НетКнигаПродУстановитьЗначениеРасхождения(ИмяКолонки)
	
	ДанныеСтроки = Элементы.НетКнигаПрод.ТекущиеДанные;
	
	ИмяКолонкиРасхождения = ИмяКолонки + "Расхождение";
	Если ДанныеСтроки.Свойство(ИмяКолонки)
		И ДанныеСтроки.Свойство(ИмяКолонкиРасхождения) Тогда
		ДанныеСтроки[ИмяКолонкиРасхождения] = ДанныеСтроки[ИмяКолонки];
	КонецЕсли;
	
	ИмяКолонкиПередставление = ИмяКолонки + "Представление";
	ИмяКолонкиРасхожденияПередставление = ИмяКолонкиРасхождения + "Представление";
	
	Если ДанныеСтроки.Свойство(ИмяКолонкиПередставление)
		И ДанныеСтроки.Свойство(ИмяКолонкиРасхожденияПередставление) Тогда
		ДанныеСтроки[ИмяКолонкиРасхожденияПередставление] = ДанныеСтроки[ИмяКолонкиПередставление];
	КонецЕсли;
	
	ИмяКолонкиКонтрагенты = ИмяКолонки + "Контрагенты";
	ИмяКолонкиРасхожденияКонтрагенты = ИмяКолонкиРасхождения + "Контрагенты";
	
	Если ДанныеСтроки.Свойство(ИмяКолонкиКонтрагенты)
		И ДанныеСтроки.Свойство(ИмяКолонкиРасхожденияКонтрагенты) Тогда
		ДанныеСтроки[ИмяКолонкиРасхожденияКонтрагенты] = ДанныеСтроки[ИмяКолонкиКонтрагенты];
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФайлДекларации()
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ОбработкаВыбораФайлДекларации", 
		ЭтотОбъект);
	
	НачатьПомещениеФайла(ОписаниеОповещения);
			
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДекларацию()
	
	КонтекстЭДОСервер = ДокументооборотСКОВызовСервера.ПолучитьОбработкуЭДО();
	Если КонтекстЭДОСервер <> Неопределено Тогда
		Объект.Декларация = КонтекстЭДОСервер.ДекларацияИзФайлаТребованияОПредставленииПоясненийКДекларацииНДС(Объект.Требование);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	РеквизитыДатПринятияНаУчет = Документы.ПоясненияКДекларацииПоНДС.РеквизитыДатПринятияНаУчет();
	РеквизитыДокументовОплаты  = Документы.ПоясненияКДекларацииПоНДС.РеквизитыДокументовОплаты();
	РеквизитыКонтрагентов      = Документы.ПоясненияКДекларацииПоНДС.РеквизитыКонтрагентов();
	РеквизитыПосредническойДеятельности = Документы.ПоясненияКДекларацииПоНДС.РеквизитыПосредническойДеятельности();
	
	РанееОтправленныеПояснения = Справочники.ДокументыРеализацииПолномочийНалоговыхОрганов.ОтправленныеОтветыНаТребованиеПоясненийКДекларацииНДС(Объект.Требование);
	
	Элементы.ДекорацияОтправленныеРанееПояснения.Видимость = 
		РанееОтправленныеПояснения.Количество() > 1
		ИЛИ РанееОтправленныеПояснения.Количество() = 1 И РанееОтправленныеПояснения[0] <> Объект.Ссылка;
	
	ЗаполнитьДобавленныеКолонкиТаблиц();
	СкрытьНезаполненныеКолонкиПериодОтраженияЗаписи();
	
	ТекстСообщения = "";
	КонтекстЭДОСервер = ДокументооборотСКОВызовСервера.ПолучитьОбработкуЭДО(ТекстСообщения);
	Если КонтекстЭДОСервер = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	ПроверитьСостояниеОтправкиПояснения();
	
	УправлениеЭлементамиУправленияОтправки();
	
	УстановитьУсловноеОформление();
	
	УстановитьВидимостьТабличныхЧастей();
	
	УправлениеФормой(ЭтотОбъект);
	
	УправлениеДекларацией(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УправлениеЭлементамиУправленияОтправки()
	
	КонтекстЭДОСервер = ДокументооборотСКОВызовСервера.ПолучитьОбработкуЭДО();
	Если КонтекстЭДОСервер = Неопределено Тогда 
		Элементы.КнопкаОтправить.Доступность = Ложь;
		Возврат;
	КонецЕсли;
	
	Если ПояснениеОтправлено Тогда
		
		ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиФормы.Нет;
		ТолькоПросмотр = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьСостояниеОтправкиПояснения()
	
	КонтекстЭДОСервер = ДокументооборотСКОВызовСервера.ПолучитьОбработкуЭДО();
	Если КонтекстЭДОСервер = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	СтатусОтправки 			= КонтекстЭДОСервер.ПолучитьСтатусОтправкиОбъекта(Объект.Ссылка);
	ПояснениеОтправлено 	= ЗначениеЗаполнено(СтатусОтправки) И СтатусОтправки <> Перечисления.СтатусыОтправки.ВКонверте;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	УстановитьУсловноеОформлениеКнигаПокупок();
	УстановитьУсловноеОформлениеКнигаПокупокДл();
	УстановитьУсловноеОформлениеКнигаПродаж();
	УстановитьУсловноеОформлениеКнигаПродажДл();
	УстановитьУсловноеОформлениеЖурналУчетаВыставленныхСчетовФактур();
	УстановитьУсловноеОформлениеВыставленныеСчетаФактуры();
	УстановитьУсловноеОформлениеНетКнигаПрод();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеКнигаПокупок()
	
	#Область ВидимостьСтрокиРасхождений
		
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПокупокНадписьРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПокупокРеквизитыСчетаФактурыРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПокупокКодВидаОперацииРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПокупокПродавецИННРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПокупокКодВалютыРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПокупокСтоимостьРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПокупокСуммаНДСРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПокупокДатаПринятияНаУчетРасхождениеДата");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПокупокДокументОплатыРасхождениеНомер");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПокупокДокументОплатыРасхождениеДата");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПокупокНомерТаможеннойДекларацииРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПокупокПосредникИННРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПокупокНадписьРасхождение");
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.КнигаПокупок.РезультатПроверки", ВидСравненияКомпоновкиДанных.НеРавно, Перечисления.РезультатПроверкиСтрокиДекларации.ВыявленыРасхождения);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
		
	#КонецОбласти
	
	#Область УсловноеОформлениеПоляПродавец
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПокупокПродавецИНН");
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.КнигаПокупок.ПродавецКоличествоСтрок", ВидСравненияКомпоновкиДанных.Больше, 0);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", Новый ПолеКомпоновкиДанных("Объект.КнигаПокупок.ПродавецПредставление"));
		
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПокупокПродавецИННРасхождение");
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.КнигаПокупок.ПродавецРасхождениеКоличествоСтрок", ВидСравненияКомпоновкиДанных.Больше, 0);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", Новый ПолеКомпоновкиДанных("Объект.КнигаПокупок.ПродавецРасхождениеПредставление"));
		
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПокупокПродавецИННРасхождение");
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.КнигаПокупок.ПродавецРасхождениеКоличествоСтрок", ВидСравненияКомпоновкиДанных.Больше, 1);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	#КонецОбласти
	
	#Область УсловноеОформлениеПоляПосредник
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПокупокПосредникИНН");
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.КнигаПокупок.ПосредникИНН", ВидСравненияКомпоновкиДанных.Заполнено);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", Новый ПолеКомпоновкиДанных("Объект.КнигаПокупок.ПосредникИННПредставление"));
		
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПокупокПосредникИННРасхождение");
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.КнигаПокупок.ПосредникИННРасхождение", ВидСравненияКомпоновкиДанных.Заполнено);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", Новый ПолеКомпоновкиДанных("Объект.КнигаПокупок.ПосредникИННРасхождениеПредставление"));
	#КонецОбласти
	
	#Область УсловноеОформлениеПоляДокументОплаты
		ДобавитьУсловноеОформлениеВидимостиМногострочногоЗначения("КнигаПокупокДокументОплатыНомер",
													"КнигаПокупокДокументОплатыДата",
													"Объект.КнигаПокупок.ДокументОплатыКоличествоСтрок",
													"Объект.КнигаПокупок.ДокументОплатыПредставление");
		
		ДобавитьУсловноеОформлениеВидимостиМногострочногоЗначения("КнигаПокупокДокументОплатыРасхождениеНомер",
													"КнигаПокупокДокументОплатыРасхождениеДата",
													"Объект.КнигаПокупок.ДокументОплатыРасхождениеКоличествоСтрок",
													"Объект.КнигаПокупок.ДокументОплатыРасхождениеПредставление");
	#КонецОбласти
	
	#Область УсловноеОформлениеПоляДатаПринятияНаУчет
		ДобавитьУсловноеОформлениеВидимостиМногострочногоЗначения("КнигаПокупокДатаПринятияНаУчетДата",
													"",
													"Объект.КнигаПокупок.ДатаПринятияНаУчетКоличествоСтрок",
													"Объект.КнигаПокупок.ДатаПринятияНаУчетПредставление");
		
		ДобавитьУсловноеОформлениеВидимостиМногострочногоЗначения("КнигаПокупокДатаПринятияНаУчетРасхождениеДата",
													"",
													"Объект.КнигаПокупок.ДатаПринятияНаУчетРасхождениеКоличествоСтрок",
													"Объект.КнигаПокупок.ДатаПринятияНаУчетРасхождениеПредставление");
	#КонецОбласти
	
	#Область ВыделениеРасхождений
		ПоляПроверкиРасхождений = ПоляПроверкиРасхожденийКнигиПокупок();
		ДобавитьУсловноеОформлениеРасхождений("КнигаПокупок", ПоляПроверкиРасхождений);
	#КонецОбласти
	
КонецПроцедуры	
	
&НаСервере
Процедура УстановитьУсловноеОформлениеКнигаПокупокДл()

	#Область ВидимостьСтрокиРасхождений
		
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПокупокДлНадписьРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПокупокДлРеквизитыСчетаФактурыРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПокупокДлКодВидаОперацииРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПокупокДлПродавецИННРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПокупокДлКодВалютыРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПокупокДлДатаПринятияНаУчетРасхождениеДата");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПокупокДлСтоимостьРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПокупокДлСуммаНДСРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПокупокДлДатаПринятияНаУчетРасхождениеДата");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПокупокДлДокументОплатыРасхождениеНомер");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПокупокДлДокументОплатыРасхождениеДата");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПокупокДлНомерТаможеннойДекларацииРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПокупокДлПосредникИННРасхождение");
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.КнигаПокупокДл.РезультатПроверки", ВидСравненияКомпоновкиДанных.НеРавно, Перечисления.РезультатПроверкиСтрокиДекларации.ВыявленыРасхождения);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
		
	#КонецОбласти
	
	#Область УсловноеОформлениеПоляПродавец
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПокупокДлПродавецИНН");
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.КнигаПокупокДл.ПродавецКоличествоСтрок", ВидСравненияКомпоновкиДанных.Больше, 0);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", Новый ПолеКомпоновкиДанных("Объект.КнигаПокупокДл.ПродавецПредставление"));
		
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПокупокДлПродавецИННРасхождение");
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.КнигаПокупокДл.ПродавецРасхождениеКоличествоСтрок", ВидСравненияКомпоновкиДанных.Больше, 0);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", Новый ПолеКомпоновкиДанных("Объект.КнигаПокупокДл.ПродавецРасхождениеПредставление"));
		
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПокупокДлПродавецИННРасхождение");
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.КнигаПокупокДл.ПродавецРасхождениеКоличествоСтрок", ВидСравненияКомпоновкиДанных.Больше, 1);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	#КонецОбласти
	
	#Область УсловноеОформлениеПоляПосредник
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПокупокДлПосредникИНН");
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.КнигаПокупокДл.ПосредникИНН", ВидСравненияКомпоновкиДанных.Заполнено);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", Новый ПолеКомпоновкиДанных("Объект.КнигаПокупокДл.ПосредникИННПредставление"));
		
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПокупокДлПосредникИННРасхождение");
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.КнигаПокупокДл.ПосредникИННРасхождение", ВидСравненияКомпоновкиДанных.Заполнено);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", Новый ПолеКомпоновкиДанных("Объект.КнигаПокупокДл.ПосредникИННРасхождениеПредставление"));
	#КонецОбласти
	
	#Область УсловноеОформлениеПоляДокументОплаты
		ДобавитьУсловноеОформлениеВидимостиМногострочногоЗначения("КнигаПокупокДлДокументОплатыНомер",
													"КнигаПокупокДлДокументОплатыДата",
													"Объект.КнигаПокупокДл.ДокументОплатыКоличествоСтрок",
													"Объект.КнигаПокупокДл.ДокументОплатыПредставление");
		
		ДобавитьУсловноеОформлениеВидимостиМногострочногоЗначения("КнигаПокупокДлДокументОплатыРасхождениеНомер",
													"КнигаПокупокДлДокументОплатыРасхождениеДата",
													"Объект.КнигаПокупокДл.ДокументОплатыРасхождениеКоличествоСтрок",
													"Объект.КнигаПокупокДл.ДокументОплатыРасхождениеПредставление");
	#КонецОбласти
	
	#Область УсловноеОформлениеПоляДатаПринятияНаУчет
		ДобавитьУсловноеОформлениеВидимостиМногострочногоЗначения("КнигаПокупокДлДатаПринятияНаУчетДата",
													"",
													"Объект.КнигаПокупокДл.ДатаПринятияНаУчетКоличествоСтрок",
													"Объект.КнигаПокупокДл.ДатаПринятияНаУчетПредставление");
		
		ДобавитьУсловноеОформлениеВидимостиМногострочногоЗначения("КнигаПокупокДлДатаПринятияНаУчетРасхождениеДата",
													"",
													"Объект.КнигаПокупокДл.ДатаПринятияНаУчетРасхождениеКоличествоСтрок",
													"Объект.КнигаПокупокДл.ДатаПринятияНаУчетРасхождениеПредставление");
	#КонецОбласти
	
	#Область ВыделениеРасхождений
		ПоляПроверкиРасхождений = ПоляПроверкиРасхожденийКнигиПокупок();
		ДобавитьУсловноеОформлениеРасхождений("КнигаПокупокДл", ПоляПроверкиРасхождений);
	#КонецОбласти
	
КонецПроцедуры	
	
&НаСервере
Процедура УстановитьУсловноеОформлениеКнигаПродаж()

	#Область ВидимостьСтрокиРасхождений
		
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПродажНадписьРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПродажРеквизитыСчетаФактурыРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПродажКодВидаОперацииРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПродажПокупательРасхождениеИНН");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПродажКодВалютыРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПродажСтоимость18Расхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПродажСуммаНДС18Расхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПродажСтоимость10Расхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПродажСуммаНДС10Расхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПродажСтоимость0Расхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПродажСтоимостьОсвобождаемаяРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПродажСтоимостьВсегоРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПродажДокументОплатыРасхождениеНомер");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПродажДокументОплатыРасхождениеДата");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПродажПосредникИННРасхождение");
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.КнигаПродаж.РезультатПроверки", ВидСравненияКомпоновкиДанных.НеРавно, Перечисления.РезультатПроверкиСтрокиДекларации.ВыявленыРасхождения);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
		
	#КонецОбласти
	
	#Область УсловноеОформлениеПоляПокупатель
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПродажПокупательИНН");
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.КнигаПродаж.ПокупательКоличествоСтрок", ВидСравненияКомпоновкиДанных.Больше, 0);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", Новый ПолеКомпоновкиДанных("Объект.КнигаПродаж.ПокупательПредставление"));
		
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПродажПокупательРасхождениеИНН");
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.КнигаПродаж.ПокупательРасхождениеКоличествоСтрок", ВидСравненияКомпоновкиДанных.Больше, 0);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", Новый ПолеКомпоновкиДанных("Объект.КнигаПродаж.ПокупательРасхождениеПредставление"));
		
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПродажПокупательРасхождениеИНН");
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.КнигаПродаж.ПокупательРасхождениеКоличествоСтрок", ВидСравненияКомпоновкиДанных.Больше, 1);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	#КонецОбласти
	
	#Область УсловноеОформлениеПоляПосредник
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПродажПосредникИНН");
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.КнигаПродаж.ПосредникИНН", ВидСравненияКомпоновкиДанных.Заполнено);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", Новый ПолеКомпоновкиДанных("Объект.КнигаПродаж.ПосредникИННПредставление"));
		
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПродажПосредникИННРасхождение");
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.КнигаПродаж.ПосредникИННРасхождение", ВидСравненияКомпоновкиДанных.Заполнено);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", Новый ПолеКомпоновкиДанных("Объект.КнигаПродаж.ПосредникИННРасхождениеПредставление"));
	#КонецОбласти
	
	#Область УсловноеОформлениеПоляДокументОплаты
		ДобавитьУсловноеОформлениеВидимостиМногострочногоЗначения("КнигаПродажДокументОплатыНомер",
													"КнигаПродажДокументОплатыДата",
													"Объект.КнигаПродаж.ДокументОплатыКоличествоСтрок",
													"Объект.КнигаПродаж.ДокументОплатыПредставление");
		
		ДобавитьУсловноеОформлениеВидимостиМногострочногоЗначения("КнигаПродажДокументОплатыРасхождениеНомер",
													"КнигаПродажДокументОплатыРасхождениеДата",
													"Объект.КнигаПродаж.ДокументОплатыРасхождениеКоличествоСтрок",
													"Объект.КнигаПродаж.ДокументОплатыРасхождениеПредставление");
	#КонецОбласти
	
	#Область ВыделениеРасхождений
		ПоляПроверкиРасхождений = ПоляПроверкиРасхожденийКнигиПродаж();
		ДобавитьУсловноеОформлениеРасхождений("КнигаПродаж", ПоляПроверкиРасхождений);
	#КонецОбласти
	
КонецПроцедуры
	
&НаСервере
Процедура УстановитьУсловноеОформлениеКнигаПродажДл()

	#Область ВидимостьСтрокиРасхождений
		
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПродажДлНадписьРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПродажДлРеквизитыСчетаФактурыРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПродажДлКодВидаОперацииРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПродажДлПокупательРасхождениеИНН");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПродажДлКодВалютыРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПродажДлСтоимость18Расхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПродажДлСуммаНДС18Расхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПродажДлСтоимость10Расхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПродажДлСуммаНДС10Расхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПродажДлСтоимость0Расхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПродажДлСтоимостьОсвобождаемаяРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПродажДлСтоимостьВсегоРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПродажДлДокументОплатыРасхождениеНомер");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПродажДлДокументОплатыРасхождениеДата");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПродажДлПосредникИННРасхождение");
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.КнигаПродажДл.РезультатПроверки", ВидСравненияКомпоновкиДанных.НеРавно, Перечисления.РезультатПроверкиСтрокиДекларации.ВыявленыРасхождения);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
		
	#КонецОбласти
	
	#Область УсловноеОформлениеПоляПокупатель
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПродажДлПокупательИНН");
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.КнигаПродажДл.ПокупательКоличествоСтрок", ВидСравненияКомпоновкиДанных.Больше, 0);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", Новый ПолеКомпоновкиДанных("Объект.КнигаПродажДл.ПокупательПредставление"));
		
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПродажДлПокупательРасхождениеИНН");
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.КнигаПродажДл.ПокупательРасхождениеКоличествоСтрок", ВидСравненияКомпоновкиДанных.Больше, 0);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", Новый ПолеКомпоновкиДанных("Объект.КнигаПродажДл.ПокупательРасхождениеПредставление"));
		
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПродажДлПокупательРасхождениеИНН");
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.КнигаПродажДл.ПокупательРасхождениеКоличествоСтрок", ВидСравненияКомпоновкиДанных.Больше, 1);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	#КонецОбласти
	
	#Область УсловноеОформлениеПоляПосредник
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПродажДлПосредникИНН");
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.КнигаПродажДл.ПосредникИНН", ВидСравненияКомпоновкиДанных.Заполнено);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", Новый ПолеКомпоновкиДанных("Объект.КнигаПродажДл.ПосредникИННПредставление"));
		
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КнигаПродажДлПосредникИННРасхождение");
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.КнигаПродажДл.ПосредникИННРасхождение", ВидСравненияКомпоновкиДанных.Заполнено);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", Новый ПолеКомпоновкиДанных("Объект.КнигаПродажДл.ПосредникИННРасхождениеПредставление"));
	#КонецОбласти
	
	#Область УсловноеОформлениеПоляДокументОплаты
		ДобавитьУсловноеОформлениеВидимостиМногострочногоЗначения("КнигаПродажДлДокументОплатыНомер",
													"КнигаПродажДлДокументОплатыДата",
													"Объект.КнигаПродажДл.ДокументОплатыКоличествоСтрок",
													"Объект.КнигаПродажДл.ДокументОплатыПредставление");
		
		ДобавитьУсловноеОформлениеВидимостиМногострочногоЗначения("КнигаПродажДлДокументОплатыРасхождениеНомер",
													"КнигаПродажДлДокументОплатыРасхождениеДата",
													"Объект.КнигаПродажДл.ДокументОплатыРасхождениеКоличествоСтрок",
													"Объект.КнигаПродажДл.ДокументОплатыРасхождениеПредставление");
	#КонецОбласти
	
	#Область ВыделениеРасхождений
		ПоляПроверкиРасхождений = ПоляПроверкиРасхожденийКнигиПродаж();
		ДобавитьУсловноеОформлениеРасхождений("КнигаПродажДл", ПоляПроверкиРасхождений);
	#КонецОбласти
	
КонецПроцедуры
	
&НаСервере
Процедура УстановитьУсловноеОформлениеЖурналУчетаВыставленныхСчетовФактур()

	#Область ВидимостьСтрокиРасхождений
		
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ЖурналУчетаВыставленныхСчетовФактурНадписьПоДаннымФНС");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ЖурналУчетаВыставленныхСчетовФактурРеквизитыСчетаФактурыРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ЖурналУчетаВыставленныхСчетовФактурПокупательИННРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ЖурналУчетаВыставленныхСчетовФактурПосредническаяДеятельностьРасхождениеПредставление");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ЖурналУчетаВыставленныхСчетовФактурКодВидаОперацииРасхождение");
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.ЖурналУчетаВыставленныхСчетовФактур.РезультатПроверки", ВидСравненияКомпоновкиДанных.НеРавно, Перечисления.РезультатПроверкиСтрокиДекларации.ВыявленыРасхождения);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
		
	#КонецОбласти
	
	#Область УсловноеОформлениеПоляПокупатель
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ЖурналУчетаВыставленныхСчетовФактурПокупательИНН");
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.ЖурналУчетаВыставленныхСчетовФактур.ПокупательИНН", ВидСравненияКомпоновкиДанных.Заполнено);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", Новый ПолеКомпоновкиДанных("Объект.ЖурналУчетаВыставленныхСчетовФактур.ПокупательИННПредставление"));
		
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ЖурналУчетаВыставленныхСчетовФактурПокупательИННРасхождение");
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.ЖурналУчетаВыставленныхСчетовФактур.ПокупательИННРасхождение", ВидСравненияКомпоновкиДанных.Заполнено);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", Новый ПолеКомпоновкиДанных("Объект.ЖурналУчетаВыставленныхСчетовФактур.ПокупательИННРасхождениеПредставление"));
	#КонецОбласти
	
	#Область ВыделениеРасхождений
		ПоляПроверкиРасхождений = ПоляПроверкиРасхожденийЖурналаУчетаВыставленныхСчетовФактур();
		ДобавитьУсловноеОформлениеРасхождений("ЖурналУчетаВыставленныхСчетовФактур", ПоляПроверкиРасхождений);
	#КонецОбласти
	
	#Область ВидимостьСтрокиРасхождений
			
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ЖурналУчетаПолученныхСчетовФактурНадписьРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ЖурналУчетаПолученныхСчетовФактурРеквизитыСчетаФактурыРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ЖурналУчетаПолученныхСчетовФактурКодВидаСделкиРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ЖурналУчетаПолученныхСчетовФактурКодВалютыРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ЖурналУчетаПолученныхСчетовФактурКодВидаОперацииРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ЖурналУчетаПолученныхСчетовФактурПродавецИННРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ЖурналУчетаПолученныхСчетовФактурСубкомиссионерИННРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ЖурналУчетаПолученныхСчетовФактурСтоимостьРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ЖурналУчетаПолученныхСчетовФактурСуммаНДСРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ЖурналУчетаПолученныхСчетовФактурРазницаСтоимостиУвеличениеРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ЖурналУчетаПолученныхСчетовФактурРазницаСуммыНДСУвеличениеРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ЖурналУчетаПолученныхСчетовФактурРазницаСтоимостиУменьшениеРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ЖурналУчетаПолученныхСчетовФактурРазницаСуммыНДСУменьшениеРасхождение");
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.ЖурналУчетаПолученныхСчетовФактур.РезультатПроверки", ВидСравненияКомпоновкиДанных.НеРавно, Перечисления.РезультатПроверкиСтрокиДекларации.ВыявленыРасхождения);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
		
	#КонецОбласти
	
	#Область УсловноеОформлениеПоляПродавец
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ЖурналУчетаПолученныхСчетовФактурПродавецИНН");
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.ЖурналУчетаПолученныхСчетовФактур.ПродавецИНН", ВидСравненияКомпоновкиДанных.Заполнено);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", Новый ПолеКомпоновкиДанных("Объект.ЖурналУчетаПолученныхСчетовФактур.ПродавецИННПредставление"));
		
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ЖурналУчетаПолученныхСчетовФактурПродавецИННРасхождение");
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.ЖурналУчетаПолученныхСчетовФактур.ПродавецИННРасхождение", ВидСравненияКомпоновкиДанных.Заполнено);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", Новый ПолеКомпоновкиДанных("Объект.ЖурналУчетаПолученныхСчетовФактур.ПродавецИННРасхождениеПредставление"));
	#КонецОбласти
	
	#Область УсловноеОформлениеПоляСубкомиссионер
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ЖурналУчетаПолученныхСчетовФактурСубкомиссионерИНН");
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.ЖурналУчетаПолученныхСчетовФактур.СубкомиссионерИНН", ВидСравненияКомпоновкиДанных.Заполнено);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", Новый ПолеКомпоновкиДанных("Объект.ЖурналУчетаПолученныхСчетовФактур.СубкомиссионерИННПредставление"));
		
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ЖурналУчетаПолученныхСчетовФактурСубкомиссионерИННРасхождение");
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.ЖурналУчетаПолученныхСчетовФактур.СубкомиссионерИННРасхождение", ВидСравненияКомпоновкиДанных.Заполнено);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", Новый ПолеКомпоновкиДанных("Объект.ЖурналУчетаПолученныхСчетовФактур.СубкомиссионерИННРасхождениеПредставление"));
	#КонецОбласти
	
	#Область ВыделениеРасхождений
		ПоляПроверкиРасхождений = ПоляПроверкиРасхожденийЖурналаУчетаПолученныхСчетовФактур();
		ДобавитьУсловноеОформлениеРасхождений("ЖурналУчетаПолученныхСчетовФактур", ПоляПроверкиРасхождений);
	#КонецОбласти
	
КонецПроцедуры
	
&НаСервере
Процедура УстановитьУсловноеОформлениеВыставленныеСчетаФактуры()
	
	#Область ВидимостьСтрокиРасхождений
		
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ВыставленныеСчетаФактурыНеплательщиковНДСНадписьРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ВыставленныеСчетаФактурыНеплательщиковНДСНомерСчетаФактурыРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ВыставленныеСчетаФактурыНеплательщиковНДСДатаСчетаФактурыРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ВыставленныеСчетаФактурыНеплательщиковНДСКодВалютыРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ВыставленныеСчетаФактурыНеплательщиковНДСПокупательИННРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ВыставленныеСчетаФактурыНеплательщиковНДССтоимостьБезНДСРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ВыставленныеСчетаФактурыНеплательщиковНДССуммаНДСРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ВыставленныеСчетаФактурыНеплательщиковНДССтоимостьРасхождение");
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.ВыставленныеСчетаФактурыНеплательщиковНДС.РезультатПроверки", ВидСравненияКомпоновкиДанных.НеРавно, Перечисления.РезультатПроверкиСтрокиДекларации.ВыявленыРасхождения);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
		
	#КонецОбласти
	
	#Область УсловноеОформлениеПоляПокупатель
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ВыставленныеСчетаФактурыНеплательщиковНДСПокупательИНН");
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.ВыставленныеСчетаФактурыНеплательщиковНДС.ПокупательИНН", ВидСравненияКомпоновкиДанных.Заполнено);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", Новый ПолеКомпоновкиДанных("Объект.ВыставленныеСчетаФактурыНеплательщиковНДС.ПокупательИННПредставление"));
		
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ВыставленныеСчетаФактурыНеплательщиковНДСПокупательИННРасхождение");
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.ВыставленныеСчетаФактурыНеплательщиковНДС.ПокупательИННРасхождение", ВидСравненияКомпоновкиДанных.Заполнено);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", Новый ПолеКомпоновкиДанных("Объект.ВыставленныеСчетаФактурыНеплательщиковНДС.ПокупательИННРасхождениеПредставление"));
	#КонецОбласти
	
	#Область ВыделениеРасхождений
		ПоляПроверкиРасхождений = ПоляПроверкиРасхожденийВыставленныхСчетовФактурНеплательщиковНДС();
		ДобавитьУсловноеОформлениеРасхождений("ВыставленныеСчетаФактурыНеплательщиковНДС", ПоляПроверкиРасхождений);
	#КонецОбласти
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеНетКнигаПрод()

	// Замена заголовка "Сведения верны" на "Не подтверждается"
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НетКнигаПродРезультатПроверки");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.НетКнигаПрод.РезультатПроверки", ВидСравненияКомпоновкиДанных.Равно,Перечисления.РезультатПроверкиСтрокиДекларации.СведенияВерны);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "Не подтверждается");
	
	// Вывод в первой строке надписи "По данным ФНС:", во второй "Уточненные данные:"
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НетКнигаПродНадписьПоДаннымФНС");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.НетКнигаПрод.РезультатПроверки", ВидСравненияКомпоновкиДанных.Заполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "По данным ФНС:");
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НетКнигаПродНадписьРасхождение");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.НетКнигаПрод.РезультатПроверки", ВидСравненияКомпоновкиДанных.Заполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "Уточненные данные:");
	
	#Область ВидимостьСтрокиРасхождений
	
		// Скрываем вторую строку
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НетКнигаПродНадписьРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НетКнигаПродРазделРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НетКнигаПродНомерСчетаФактурыРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НетКнигаПродДатаСчетаФактурыРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НетКнигаПродКодВидаОперацииРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НетКнигаПродПокупательИННРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НетКнигаПродПокупательКППРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НетКнигаПродСтоимостьВсегоРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НетКнигаПродСтоимостьРубВсегоРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НетКнигаПродПосредникИННРасхождение");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НетКнигаПродПосредникКППРасхождение");
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
			ЭлементУО.Отбор,
			"Объект.НетКнигаПрод.РезультатПроверки", 
			ВидСравненияКомпоновкиДанных.НеРавно, 
			Перечисления.РезультатПроверкиСтрокиДекларации.ВыявленыРасхождения);
			
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
		
		// Скрываем лишние колонки для случая, когда расхождение не подтверждается.
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НетКнигаПродРаздел");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НетКнигаПродКодВидаОперации");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НетКнигаПродСтоимостьВсего");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НетКнигаПродСтоимостьРубВсего");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НетКнигаПродПосредникИНН");
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НетКнигаПродПосредникКПП");
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
			ЭлементУО.Отбор,
			"Объект.НетКнигаПрод.РезультатПроверки", 
			ВидСравненияКомпоновкиДанных.Равно, 
			Перечисления.РезультатПроверкиСтрокиДекларации.СведенияВерны);
			
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "<не заполняется>");
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(192, 192, 192));
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
		
	#КонецОбласти
	
	#Область ВыделениеРасхождений
		ПоляПроверкиРасхождений = ПоляПроверкиРасхожденийНетКнигаПрод();
		ДобавитьУсловноеОформлениеРасхождений("НетКнигаПрод", ПоляПроверкиРасхождений);
	#КонецОбласти
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформлениеВидимостиМногострочногоЗначения(ОформляемыеПоля, ОформляемыПоляДляОдногоЗначения, ПутьКРеквизитуУсловия, ПолеМногострочногоПредставления)
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	Массив = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ОформляемыеПоля, ",");
	Для Каждого ОформляемоеПоле Из Массив Цикл
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, ОформляемоеПоле);
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		ПутьКРеквизитуУсловия, ВидСравненияКомпоновкиДанных.Больше, 1);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", Новый ПолеКомпоновкиДанных(ПолеМногострочногоПредставления));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	МассивПолейОдногоЗначения = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ОформляемыПоляДляОдногоЗначения, ",");
	Если МассивПолейОдногоЗначения.Количество()>0 Тогда
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		Для Каждого ОформляемоеПоле Из МассивПолейОдногоЗначения Цикл
			ДобавитьОформляемоеПоле(ЭлементУО.Поля, ОформляемоеПоле);
		КонецЦикла;
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			ПутьКРеквизитуУсловия, ВидСравненияКомпоновкиДанных.Больше, 1);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформлениеРасхождений(ТабличнаяЧасть, ПоляПроверкиРасхождений)
	
	Для Каждого ПолеПроверки Из ПоляПроверкиРасхождений Цикл
		
		МассивЭлементов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПолеПроверки.Элементы, ",");
		Для К =0 По МассивЭлементов.Количество()-1 Цикл
			МассивЭлементов[К] = ТабличнаяЧасть + МассивЭлементов[К];
		КонецЦикла;
		
		Если ПолеПроверки.Свойство("Важно")
			И ПолеПроверки.Важно = Истина Тогда
			ДобавитьУсловноеОформлениеЗначениеОтличаетсяВажно(МассивЭлементов,
															"Объект."+ТабличнаяЧасть+"."+ПолеПроверки.Поле,
															"Объект."+ТабличнаяЧасть+"."+ПолеПроверки.ПолеРасхождение);
		Иначе
			ДобавитьУсловноеОформлениеЗначениеОтличается(МассивЭлементов,
															"Объект."+ТабличнаяЧасть+"."+ПолеПроверки.Поле,
															"Объект."+ТабличнаяЧасть+"."+ПолеПроверки.ПолеРасхождение);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформлениеЗначениеОтличается(ОформляемыеПоля, ПутьКРеквизитуУсловияЛево, ПутьКРеквизитуУсловияПраво)
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	Для Каждого ОформляемоеПоле Из ОформляемыеПоля Цикл
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, ОформляемоеПоле);
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		ПутьКРеквизитуУсловияЛево, ВидСравненияКомпоновкиДанных.НеРавно, Новый ПолеКомпоновкиДанных(ПутьКРеквизитуУсловияПраво));
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(Элементы[ОформляемоеПоле].Шрифт, , , Истина, , , , ));
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформлениеЗначениеОтличаетсяВажно(ОформляемыеПоля, ПутьКРеквизитуУсловияЛево, ПутьКРеквизитуУсловияПраво)
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	Для Каждого ОформляемоеПоле Из ОформляемыеПоля Цикл
		ДобавитьОформляемоеПоле(ЭлементУО.Поля, ОформляемоеПоле);
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		ПутьКРеквизитуУсловияЛево, ВидСравненияКомпоновкиДанных.НеРавно, Новый ПолеКомпоновкиДанных(ПутьКРеквизитуУсловияПраво));
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОсобогоТекста);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(Элементы[ОформляемоеПоле].Шрифт, , , Истина, , , , ));
	
КонецПроцедуры

&НаСервере
Функция ДобавитьОформляемоеПоле(КоллекцияОформляемыхПолей, ИмяПоля) Экспорт
	
	ПолеЭлемента 		= КоллекцияОформляемыхПолей.Элементы.Добавить();
	ПолеЭлемента.Поле 	= Новый ПолеКомпоновкиДанных(ИмяПоля);
	
	Возврат ПолеЭлемента;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	Объект   = Форма.Объект;
	
	НеобходимаУточненнаяДекларация = НеобходимаУточненнаяДекларация(Объект);
	
	Если НеобходимаУточненнаяДекларация Тогда
		Элементы.ГруппаПредупреждениеОбУточненнойДекларации.Видимость = Истина;
	Иначе
		Элементы.ГруппаПредупреждениеОбУточненнойДекларации.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеДекларацией(Форма)
	
	Элементы = Форма.Элементы;
	Объект  = Форма.Объект;
	Декларация = Объект.Декларация;
	
	// В базе нет декларации
	Если ЗначениеЗаполнено(Декларация) Тогда
		
		Если ТипЗнч(Декларация) = Тип("Строка") Тогда
		
			ПредставлениеДекларации = Декларация;
			
			// Мы нашли декларацию в базе
		ИначеЕсли ТипЗнч(Декларация) = Тип("ДокументСсылка.РегламентированныйОтчет") Тогда 
			
			ПредставлениеДекларации = ПредставлениеДокументаРеглОтч(Декларация);
			ПредставлениеДекларации = Новый ФорматированнаяСтрока(ПредставлениеДекларации,,,, "Декларация");
			
		ИначеЕсли ТипЗнч(Декларация) = Тип("СправочникСсылка.ЭлектронныеПредставленияРегламентированныхОтчетов") Тогда
			
			ПредставлениеДекларации = Строка(Декларация);
			ПредставлениеДекларации = Новый ФорматированнаяСтрока(ПредставлениеДекларации,,,, "Декларация");
			
		КонецЕсли;

	Иначе
		ПредставлениеДекларации = НСтр("ru = 'Декларация не найдена'");
	КонецЕсли;
	
	Подстроки = Новый Массив;
	Подстроки.Добавить(ПредставлениеДекларации);
	Подстроки.Добавить("   ");
	
	Если НЕ Форма.ПояснениеОтправлено Тогда
		
		Подстроки.Добавить(Новый ФорматированнаяСтрока("Выбрать из базы",,,, "Выбрать из базы"));
		Подстроки.Добавить("   ");
		Подстроки.Добавить(Новый ФорматированнаяСтрока("Выбрать файл",,,, "Выбрать файл"));

	КонецЕсли;
	
	Форма.ПредставлениеДекларации = Новый ФорматированнаяСтрока(Подстроки);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьТабличныхЧастей()
	
	Если ПояснениеОтправлено Тогда
		ТабличныеЧасти = Новый Структура("КнигаПокупок, КнигаПокупокДл, КнигаПродаж, КнигаПродажДл, ЖурналУчетаВыставленныхСчетовФактур, ЖурналУчетаПолученныхСчетовФактур, ВыставленныеСчетаФактурыНеплательщиковНДС, СведКС, НетКнигаПрод");
	Иначе
		ТабличныеЧасти = Новый Структура("КнигаПокупок, КнигаПокупокДл, КнигаПродаж, КнигаПродажДл, ЖурналУчетаВыставленныхСчетовФактур, ЖурналУчетаПолученныхСчетовФактур, ВыставленныеСчетаФактурыНеплательщиковНДС");
	КонецЕсли;
	
	КоличествоЗаполненныхТабличныхЧастей = 0;
	Для Каждого ТабличнаяЧасть Из ТабличныеЧасти Цикл
		КоличествоСтрок = Объект[ТабличнаяЧасть.Ключ].Количество();
		Элементы["Группа"+ТабличнаяЧасть.Ключ].Видимость = КоличествоСтрок > 0;
		Если КоличествоСтрок > 0 Тогда
			КоличествоЗаполненныхТабличныхЧастей = КоличествоЗаполненныхТабличныхЧастей + 1;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.ГруппаВсеОтправлены.Видимость = ВТребованииЕстьXMLФайл И КоличествоЗаполненныхТабличныхЧастей = 0 И НЕ ПояснениеОтправлено;
	
	КонтекстЭДОСервер = ДокументооборотСКОВызовСервера.ПолучитьОбработкуЭДО();
	ПрименяетсяФорматОтветаНаТребованиеПояснений_5_02 = КонтекстЭДОСервер.ПрименяетсяФорматОтветаНаТребованиеПояснений_5_02();
	
	Если ПрименяетсяФорматОтветаНаТребованиеПояснений_5_02 Тогда
		Если ПояснениеОтправлено Тогда
			Если ЗначениеЗаполнено(Объект.ПояснИнОсн) Тогда
				КоличествоЗаполненныхТабличныхЧастей = КоличествоЗаполненныхТабличныхЧастей + 1;
			КонецЕсли;
		Иначе
			Элементы.ГруппаНетКнигаПрод.Видимость 	= Истина;
			Элементы.ГруппаСведКС.Видимость 		= Истина;
			Элементы.ГруппаПояснИнОсн.Видимость 	= Истина;
			КоличествоЗаполненныхТабличныхЧастей = КоличествоЗаполненныхТабличныхЧастей + 3;
		КонецЕсли;
	Иначе
		Элементы.ГруппаНетКнигаПрод.Видимость 	= Ложь;
		Элементы.ГруппаСведКС.Видимость 		= Ложь;
		Элементы.ГруппаПояснИнОсн.Видимость 	= Ложь;
	КонецЕсли;
	
	Если КоличествоЗаполненныхТабличныхЧастей = 1 Тогда
		Элементы.Страницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	ИначеЕсли КоличествоЗаполненныхТабличныхЧастей > 1 Тогда
		Элементы.Страницы.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиТаблиц()
	
	СведенияОКонтрагентах = Объект.Контрагенты.Выгрузить();
	СведенияОКонтрагентах.Индексы.Добавить("ИдентификаторЗначения");
	СведенияОКонтрагентах.Колонки.Добавить("Контрагенты", Новый ОписаниеТипов("СписокЗначений"));
	СведенияОКонтрагентах.Колонки.Добавить("ПредставлениеКонтрагента", Новый ОписаниеТипов("Строка"));
	
	ТаблицаИНН = Объект.Контрагенты.Выгрузить(, "ИНН, КПП");
	
	// Дополняем таблицу с ИНН значениями, указанными в колонках табличных частей
	ДобавитьКонтрагентов(ТаблицаИНН, Объект.КнигаПокупок, "ПосредникИНН");
	ДобавитьКонтрагентов(ТаблицаИНН, Объект.КнигаПокупок, "ПосредникИННРасхождение");
	ДобавитьКонтрагентов(ТаблицаИНН, Объект.КнигаПокупокДл, "ПосредникИНН");
	ДобавитьКонтрагентов(ТаблицаИНН, Объект.КнигаПокупокДл, "ПосредникИННРасхождение");
	ДобавитьКонтрагентов(ТаблицаИНН, Объект.КнигаПродаж, "ПосредникИНН");
	ДобавитьКонтрагентов(ТаблицаИНН, Объект.КнигаПродаж, "ПосредникИННРасхождение");
	ДобавитьКонтрагентов(ТаблицаИНН, Объект.КнигаПродажДл, "ПосредникИНН");
	ДобавитьКонтрагентов(ТаблицаИНН, Объект.КнигаПродажДл, "ПосредникИННРасхождение");
	ДобавитьКонтрагентов(ТаблицаИНН, Объект.ЖурналУчетаВыставленныхСчетовФактур, "ПокупательИНН");
	ДобавитьКонтрагентов(ТаблицаИНН, Объект.ЖурналУчетаВыставленныхСчетовФактур, "ПокупательИННРасхождение");
	ДобавитьКонтрагентов(ТаблицаИНН, Объект.ЖурналУчетаПолученныхСчетовФактур, "ПродавецИНН");
	ДобавитьКонтрагентов(ТаблицаИНН, Объект.ЖурналУчетаПолученныхСчетовФактур, "ПродавецИННРасхождение");
	ДобавитьКонтрагентов(ТаблицаИНН, Объект.ЖурналУчетаПолученныхСчетовФактур, "СубкомиссионерИНН");
	ДобавитьКонтрагентов(ТаблицаИНН, Объект.ЖурналУчетаПолученныхСчетовФактур, "СубкомиссионерИННРасхождение");
	ДобавитьКонтрагентов(ТаблицаИНН, Объект.ВыставленныеСчетаФактурыНеплательщиковНДС, "ПокупательИНН");
	ДобавитьКонтрагентов(ТаблицаИНН, Объект.ВыставленныеСчетаФактурыНеплательщиковНДС, "ПокупательИННРасхождение");
	ДобавитьКонтрагентов(ТаблицаИНН, Объект.НетКнигаПрод, "ПокупательИНН", "ПокупательКПП");
	ДобавитьКонтрагентов(ТаблицаИНН, Объект.НетКнигаПрод, "ПокупательИННРасхождение", "ПокупательКППРасхождение");
	ДобавитьКонтрагентов(ТаблицаИНН, Объект.НетКнигаПрод, "ПосредникИНН", "ПосредникКПП");
	ДобавитьКонтрагентов(ТаблицаИНН, Объект.НетКнигаПрод, "ПосредникИННРасхождение", "ПосредникКППРасхождение");
	
	ТаблицаКонтрагентов = Документы.ПоясненияКДекларацииПоНДС.КонтрагентыПоСпискуИНН(ТаблицаИНН);
	Для Каждого СведениеОКонтрагенте ИЗ СведенияОКонтрагентах Цикл
		
		СведениеОКонтрагенте.Контрагенты = Новый СписокЗначений();
		
		ПредставленияКонтрагента = Новый Массив;
		Если ТаблицаКонтрагентов <> Неопределено Тогда
			
			Отбор = Новый Структура();
			Отбор.Вставить("ИНН", СведениеОКонтрагенте.ИНН);
			
			Если ЗначениеЗаполнено(СведениеОКонтрагенте.КПП) Тогда
				Отбор.Вставить("КПП", СведениеОКонтрагенте.КПП);
			КонецЕсли;
			
			СтрокиКонтрагента = ТаблицаКонтрагентов.НайтиСтроки(Отбор);
			
			Для Каждого СтрокаКонтрагента Из СтрокиКонтрагента Цикл
				СведениеОКонтрагенте.Контрагенты.Добавить(СтрокаКонтрагента.Контрагент);
				ПредставленияКонтрагента.Добавить(СтрокаКонтрагента.КонтрагентПредставление);
			КонецЦикла;
		КонецЕсли;
		
		СведениеОКонтрагенте.ПредставлениеКонтрагента = Документы.ПоясненияКДекларацииПоНДС.ПредставлениеКонтрагента(
					СведениеОКонтрагенте, СтрСоединить(ПредставленияКонтрагента, ";"));
	КонецЦикла;
	
	СведенияОДокументахОплаты = Объект.ДокументыОплаты.Выгрузить();
	СведенияОДокументахОплаты.Индексы.Добавить("ИдентификаторЗначения");
	
	СведенияОДатахПринятияНаУчет = Объект.ДатыПринятияНаУчет.Выгрузить();
	СведенияОДатахПринятияНаУчет.Индексы.Добавить("ИдентификаторЗначения");
	
	СведенияОПосредническойДеятельности = Объект.ПосредническаяДеятельность.Выгрузить();
	СведенияОПосредническойДеятельности.Индексы.Добавить("ИдентификаторЗначения");
	
	Для каждого СтрокаТаблицы Из Объект.КнигаПокупок Цикл
		ЗаполнитьДанныеРеквизитовСоСпискамиРаздела8(СтрокаТаблицы, СведенияОКонтрагентах, СведенияОДокументахОплаты, СведенияОДатахПринятияНаУчет, ТаблицаКонтрагентов);
		ЗаполнитьДобавленныеКолонкиСтрокиРаздела8(СтрокаТаблицы);
	КонецЦикла;
	
	Для каждого СтрокаТаблицы Из Объект.КнигаПокупокДл Цикл
		ЗаполнитьДанныеРеквизитовСоСпискамиРаздела8(СтрокаТаблицы, СведенияОКонтрагентах, СведенияОДокументахОплаты, СведенияОДатахПринятияНаУчет, ТаблицаКонтрагентов);
		ЗаполнитьДобавленныеКолонкиСтрокиРаздела8(СтрокаТаблицы);
	КонецЦикла;
	
	Для каждого СтрокаТаблицы Из Объект.КнигаПродаж Цикл
		ЗаполнитьДанныеРеквизитовСоСпискамиРаздела9(СтрокаТаблицы, СведенияОКонтрагентах, СведенияОДокументахОплаты, СведенияОДатахПринятияНаУчет, ТаблицаКонтрагентов);
		ЗаполнитьДобавленныеКолонкиСтрокиРаздела9(СтрокаТаблицы);
	КонецЦикла;
	
	Для каждого СтрокаТаблицы Из Объект.КнигаПродажДл Цикл
		ЗаполнитьДанныеРеквизитовСоСпискамиРаздела9(СтрокаТаблицы, СведенияОКонтрагентах, СведенияОДокументахОплаты, СведенияОДатахПринятияНаУчет, ТаблицаКонтрагентов);
		ЗаполнитьДобавленныеКолонкиСтрокиРаздела9(СтрокаТаблицы);
	КонецЦикла;
	
	Для каждого СтрокаТаблицы Из Объект.ЖурналУчетаВыставленныхСчетовФактур Цикл
		ЗаполнитьДанныеРеквизитовСоСпискамиРаздела10(СтрокаТаблицы, СведенияОПосредническойДеятельности, ТаблицаКонтрагентов);
		ЗаполнитьДобавленныеКолонкиСтрокиРаздела10(СтрокаТаблицы);
	КонецЦикла;
	
	Для каждого СтрокаТаблицы Из Объект.ЖурналУчетаПолученныхСчетовФактур Цикл
		ЗаполнитьДанныеРеквизитовСоСпискамиРаздела11(СтрокаТаблицы, ТаблицаКонтрагентов);
		ЗаполнитьДобавленныеКолонкиСтрокиРаздела11(СтрокаТаблицы);
	КонецЦикла;
	
	Для каждого СтрокаТаблицы Из Объект.ВыставленныеСчетаФактурыНеплательщиковНДС Цикл
		ЗаполнитьДанныеРеквизитовСоСпискамиРаздела12(СтрокаТаблицы, ТаблицаКонтрагентов);
		ЗаполнитьДобавленныеКолонкиСтрокиРаздела12(СтрокаТаблицы);
	КонецЦикла;
	
	Для каждого СтрокаТаблицы Из Объект.НетКнигаПрод Цикл
		ЗаполнитьДанныеРеквизитовСоСпискамиРазделаНетКнигаПрод(СтрокаТаблицы, ТаблицаКонтрагентов);
		ЗаполнитьДобавленныеКолонкиСтрокиРазделаНетКнигаПрод(СтрокаТаблицы);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеРеквизитовСоСпискамиРаздела8(СтрокаТаблицы, СведенияОКонтрагентах, СведенияОДокументахОплаты, СведенияОДатахПринятияНаУчет, ТаблицаКонтрагентов)
	
	ЗаполнитьСписокЗначенийРеквизита(СтрокаТаблицы, "Продавец", РеквизитыКонтрагентов, СведенияОКонтрагентах);
	ЗаполнитьСписокЗначенийРеквизита(СтрокаТаблицы, "ПродавецРасхождение", РеквизитыКонтрагентов, СведенияОКонтрагентах);
	
	ЗаполнитьСписокЗначенийРеквизита(СтрокаТаблицы, "ДокументОплаты", РеквизитыДокументовОплаты, СведенияОДокументахОплаты);
	ЗаполнитьСписокЗначенийРеквизита(СтрокаТаблицы, "ДокументОплатыРасхождение", РеквизитыДокументовОплаты, СведенияОДокументахОплаты);
	
	ЗаполнитьСписокЗначенийРеквизита(СтрокаТаблицы, "ДатаПринятияНаУчет", РеквизитыДатПринятияНаУчет, СведенияОДатахПринятияНаУчет);
	ЗаполнитьСписокЗначенийРеквизита(СтрокаТаблицы, "ДатаПринятияНаУчетРасхождение", РеквизитыДатПринятияНаУчет, СведенияОДатахПринятияНаУчет);
	
	УстановитьДанныеКонтрагента(СтрокаТаблицы, "ПосредникИНН", ТаблицаКонтрагентов);
	УстановитьДанныеКонтрагента(СтрокаТаблицы, "ПосредникИННРасхождение", ТаблицаКонтрагентов);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеРеквизитовСоСпискамиРаздела9(СтрокаТаблицы, СведенияОКонтрагентах, СведенияОДокументахОплаты, СведенияОДатахПринятияНаУчет, ТаблицаКонтрагентов)
	
	ЗаполнитьСписокЗначенийРеквизита(СтрокаТаблицы, "Покупатель", РеквизитыКонтрагентов, СведенияОКонтрагентах);
	ЗаполнитьСписокЗначенийРеквизита(СтрокаТаблицы, "ПокупательРасхождение", РеквизитыКонтрагентов, СведенияОКонтрагентах);
	
	ЗаполнитьСписокЗначенийРеквизита(СтрокаТаблицы, "ДокументОплаты", РеквизитыДокументовОплаты, СведенияОДокументахОплаты);
	ЗаполнитьСписокЗначенийРеквизита(СтрокаТаблицы, "ДокументОплатыРасхождение", РеквизитыДокументовОплаты, СведенияОДокументахОплаты);
	
	УстановитьДанныеКонтрагента(СтрокаТаблицы, "ПосредникИНН", ТаблицаКонтрагентов);
	УстановитьДанныеКонтрагента(СтрокаТаблицы, "ПосредникИННРасхождение", ТаблицаКонтрагентов);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеРеквизитовСоСпискамиРаздела10(СтрокаТаблицы, СведенияОПосредническойДеятельности, ТаблицаКонтрагентов)
	
	ЗаполнитьСписокЗначенийРеквизита(СтрокаТаблицы, "ПосредническаяДеятельность", РеквизитыПосредническойДеятельности, СведенияОПосредническойДеятельности);
	ЗаполнитьСписокЗначенийРеквизита(СтрокаТаблицы, "ПосредническаяДеятельностьРасхождение", РеквизитыПосредническойДеятельности, СведенияОПосредническойДеятельности);
	
	УстановитьДанныеКонтрагента(СтрокаТаблицы, "ПокупательИНН", ТаблицаКонтрагентов);
	УстановитьДанныеКонтрагента(СтрокаТаблицы, "ПокупательИННРасхождение", ТаблицаКонтрагентов);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеРеквизитовСоСпискамиРаздела11(СтрокаТаблицы, ТаблицаКонтрагентов)
	
	УстановитьДанныеКонтрагента(СтрокаТаблицы, "ПродавецИНН", ТаблицаКонтрагентов);
	УстановитьДанныеКонтрагента(СтрокаТаблицы, "ПродавецИННРасхождение", ТаблицаКонтрагентов);
	
	УстановитьДанныеКонтрагента(СтрокаТаблицы, "СубкомиссионерИНН", ТаблицаКонтрагентов);
	УстановитьДанныеКонтрагента(СтрокаТаблицы, "СубкомиссионерИННРасхождение", ТаблицаКонтрагентов);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеРеквизитовСоСпискамиРаздела12(СтрокаТаблицы, ТаблицаКонтрагентов)
	
	УстановитьДанныеКонтрагента(СтрокаТаблицы, "ПокупательИНН", ТаблицаКонтрагентов);
	УстановитьДанныеКонтрагента(СтрокаТаблицы, "ПокупательИННРасхождение", ТаблицаКонтрагентов);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеРеквизитовСоСпискамиРазделаНетКнигаПрод(СтрокаТаблицы, ТаблицаКонтрагентов)
	
	УстановитьДанныеКонтрагента(СтрокаТаблицы, "ПокупательИНН", ТаблицаКонтрагентов, "ПокупательКПП");
	УстановитьДанныеКонтрагента(СтрокаТаблицы, "ПокупательИННРасхождение", ТаблицаКонтрагентов, "ПокупательКППРасхождение");
	УстановитьДанныеКонтрагента(СтрокаТаблицы, "ПосредникИНН", ТаблицаКонтрагентов, "ПосредникКПП");
	УстановитьДанныеКонтрагента(СтрокаТаблицы, "ПосредникИННРасхождение", ТаблицаКонтрагентов, "ПосредникКППРасхождение");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиСтрокиРаздела8(СтрокаТаблицы)
	
	УстановитьНадписи(СтрокаТаблицы);
	
	СтрокаТаблицы.ОшибкаПредставление = Документы.ПоясненияКДекларацииПоНДС.ПредставлениеОшибкиРаздела8(СтрокаТаблицы.КодОшибки, СтрокаТаблицы.ГрафаОшибки);
	
	УстановитьПредставлениеСчетаФактуры(СтрокаТаблицы, "");
	УстановитьПредставлениеСчетаФактуры(СтрокаТаблицы, "Расхождение");
	
	УстановитьПредставлениеСпискаКонтрагентов(СтрокаТаблицы, "Продавец");
	УстановитьПредставлениеСпискаКонтрагентов(СтрокаТаблицы, "ПродавецРасхождение");
	
	УстановитьПредставлениеДокументовОплаты(СтрокаТаблицы, "ДокументОплаты");
	УстановитьПредставлениеДокументовОплаты(СтрокаТаблицы, "ДокументОплатыРасхождение");
	
	УстановитьПредставлениеДатыПринятияНаУчет(СтрокаТаблицы, "ДатаПринятияНаУчет");
	УстановитьПредставлениеДатыПринятияНаУчет(СтрокаТаблицы, "ДатаПринятияНаУчетРасхождение");
	
	УстановитьПредставлениеКонтрагента(СтрокаТаблицы, "ПосредникИНН");
	УстановитьПредставлениеКонтрагента(СтрокаТаблицы, "ПосредникИННРасхождение");
	
	УстановитьПредставлениеПериодаОтраженияЗаписи(СтрокаТаблицы);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиСтрокиРаздела9(СтрокаТаблицы)
	
	УстановитьНадписи(СтрокаТаблицы);
	
	СтрокаТаблицы.ОшибкаПредставление = Документы.ПоясненияКДекларацииПоНДС.ПредставлениеОшибкиРаздела9(СтрокаТаблицы.КодОшибки, СтрокаТаблицы.ГрафаОшибки);
	
	УстановитьПредставлениеСчетаФактуры(СтрокаТаблицы, "");
	УстановитьПредставлениеСчетаФактуры(СтрокаТаблицы, "Расхождение");
	
	УстановитьПредставлениеСпискаКонтрагентов(СтрокаТаблицы, "Покупатель");
	УстановитьПредставлениеСпискаКонтрагентов(СтрокаТаблицы, "ПокупательРасхождение");
	
	УстановитьПредставлениеДокументовОплаты(СтрокаТаблицы, "ДокументОплаты");
	УстановитьПредставлениеДокументовОплаты(СтрокаТаблицы, "ДокументОплатыРасхождение");
	
	УстановитьПредставлениеКонтрагента(СтрокаТаблицы, "ПосредникИНН");
	УстановитьПредставлениеКонтрагента(СтрокаТаблицы, "ПосредникИННРасхождение");
	
	УстановитьПредставлениеПериодаОтраженияЗаписи(СтрокаТаблицы);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиСтрокиРаздела10(СтрокаТаблицы)
	
	УстановитьНадписи(СтрокаТаблицы);
	
	СтрокаТаблицы.ОшибкаПредставление = Документы.ПоясненияКДекларацииПоНДС.ПредставлениеОшибкиРаздела10(СтрокаТаблицы.КодОшибки, СтрокаТаблицы.ГрафаОшибки);
	
	УстановитьПредставлениеСчетаФактуры(СтрокаТаблицы, "");
	УстановитьПредставлениеСчетаФактуры(СтрокаТаблицы, "Расхождение");
	
	УстановитьПредставлениеПосредническойДеятельности(СтрокаТаблицы, "ПосредническаяДеятельность");
	УстановитьПредставлениеПосредническойДеятельности(СтрокаТаблицы, "ПосредническаяДеятельностьРасхождение");
	
	УстановитьПредставлениеКонтрагента(СтрокаТаблицы, "ПокупательИНН");
	УстановитьПредставлениеКонтрагента(СтрокаТаблицы, "ПокупательИННРасхождение");
	
	УстановитьПредставлениеПериодаОтраженияЗаписи(СтрокаТаблицы);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиСтрокиРаздела11(СтрокаТаблицы)
	
	УстановитьНадписи(СтрокаТаблицы);
	
	СтрокаТаблицы.ОшибкаПредставление = Документы.ПоясненияКДекларацииПоНДС.ПредставлениеОшибкиРаздела11(СтрокаТаблицы.КодОшибки, СтрокаТаблицы.ГрафаОшибки);
	
	УстановитьПредставлениеСчетаФактуры(СтрокаТаблицы, "");
	УстановитьПредставлениеСчетаФактуры(СтрокаТаблицы, "Расхождение");
	
	УстановитьПредставлениеКонтрагента(СтрокаТаблицы, "ПродавецИНН");
	УстановитьПредставлениеКонтрагента(СтрокаТаблицы, "ПродавецИННРасхождение");
	
	УстановитьПредставлениеКонтрагента(СтрокаТаблицы, "СубкомиссионерИНН");
	УстановитьПредставлениеКонтрагента(СтрокаТаблицы, "СубкомиссионерИННРасхождение");
	
	УстановитьПредставлениеПериодаОтраженияЗаписи(СтрокаТаблицы);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиСтрокиРаздела12(СтрокаТаблицы)
	
	УстановитьНадписи(СтрокаТаблицы);
	
	СтрокаТаблицы.ОшибкаПредставление = Документы.ПоясненияКДекларацииПоНДС.ПредставлениеОшибкиРаздела12(СтрокаТаблицы.КодОшибки, СтрокаТаблицы.ГрафаОшибки);
	
	УстановитьПредставлениеКонтрагента(СтрокаТаблицы, "ПокупательИНН");
	УстановитьПредставлениеКонтрагента(СтрокаТаблицы, "ПокупательИННРасхождение");
	
	УстановитьПредставлениеПериодаОтраженияЗаписи(СтрокаТаблицы);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиСтрокиРазделаНетКнигаПрод(СтрокаТаблицы)
	
	УстановитьПредставлениеКонтрагента(СтрокаТаблицы, "ПокупательИНН");
	УстановитьПредставлениеКонтрагента(СтрокаТаблицы, "ПокупательИННРасхождение");
	
	УстановитьПредставлениеКонтрагента(СтрокаТаблицы, "ПосредникИНН");
	УстановитьПредставлениеКонтрагента(СтрокаТаблицы, "ПосредникИННРасхождение");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНадписи(СтрокаТаблицы)
	
	СтрокаТаблицы.НадписьРасхождение = "Уточненные данные:";
	СтрокаТаблицы.НадписьПоДаннымФНС = "По данным ФНС:";
	
КонецПроцедуры

&НаСервере
Процедура РезультатПроверкиПриИзмененииНаСервере(ИмяТабличнойЧасти, ВыбраннаяСтрока)
	
	ДанныеСтроки = Объект[ИмяТабличнойЧасти].НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	Если ДанныеСтроки.РезультатПроверки = Перечисления.РезультатПроверкиСтрокиДекларации.СведенияВерны Тогда
		Если ИмяТабличнойЧасти = "КнигаПокупок"
			ИЛИ ИмяТабличнойЧасти = "КнигаПокупокДл" Тогда
			Документы.ПоясненияКДекларацииПоНДС.ЗаполнитьРасхожденияСтрокиРаздела8(ДанныеСтроки);
			ДанныеСтроки.ПродавецРасхождениеДанные = ДанныеСтроки.ПродавецДанные.Скопировать();
			ДанныеСтроки.ДокументОплатыРасхождениеДанные = ДанныеСтроки.ДокументОплатыДанные.Скопировать();
			ДанныеСтроки.ДатаПринятияНаУчетРасхождениеДанные = ДанныеСтроки.ДатаПринятияНаУчетДанные.Скопировать();
			ДанныеСтроки.ПосредникИННРасхождениеКонтрагенты  = ДанныеСтроки.ПосредникИННКонтрагенты.Скопировать();
			ЗаполнитьДобавленныеКолонкиСтрокиРаздела8(ДанныеСтроки);
		ИначеЕсли ИмяТабличнойЧасти = "КнигаПродаж"
			ИЛИ ИмяТабличнойЧасти = "КнигаПродажДл" Тогда
			Документы.ПоясненияКДекларацииПоНДС.ЗаполнитьРасхожденияСтрокиРаздела9(ДанныеСтроки);
			ДанныеСтроки.ПокупательРасхождениеДанные = ДанныеСтроки.ПокупательДанные.Скопировать();
			ДанныеСтроки.ДокументОплатыРасхождениеДанные = ДанныеСтроки.ДокументОплатыДанные.Скопировать();
			ДанныеСтроки.ПосредникИННРасхождениеКонтрагенты = ДанныеСтроки.ПосредникИННКонтрагенты.Скопировать();
			ЗаполнитьДобавленныеКолонкиСтрокиРаздела9(ДанныеСтроки);
		ИначеЕсли ИмяТабличнойЧасти = "ЖурналУчетаВыставленныхСчетовФактур" Тогда
			Документы.ПоясненияКДекларацииПоНДС.ЗаполнитьРасхожденияСтрокиРаздела10(ДанныеСтроки);
			ДанныеСтроки.ПосредническаяДеятельностьРасхождениеДанные = ДанныеСтроки.ПосредническаяДеятельностьДанные.Скопировать();
			ДанныеСтроки.ПокупательИННРасхождениеКонтрагенты = ДанныеСтроки.ПокупательИННКонтрагенты.Скопировать();
			ЗаполнитьДобавленныеКолонкиСтрокиРаздела10(ДанныеСтроки);
		ИначеЕсли ИмяТабличнойЧасти = "ЖурналУчетаПолученныхСчетовФактур" Тогда
			Документы.ПоясненияКДекларацииПоНДС.ЗаполнитьРасхожденияСтрокиРаздела11(ДанныеСтроки);
			ДанныеСтроки.ПродавецИННРасхождениеКонтрагенты = ДанныеСтроки.ПродавецИННКонтрагенты.Скопировать();
			ДанныеСтроки.СубкомиссионерИННРасхождениеКонтрагенты = ДанныеСтроки.СубкомиссионерИННКонтрагенты.Скопировать();
			ЗаполнитьДобавленныеКолонкиСтрокиРаздела11(ДанныеСтроки);
		ИначеЕсли ИмяТабличнойЧасти = "ВыставленныеСчетаФактурыНеплательщиковНДС" Тогда
			Документы.ПоясненияКДекларацииПоНДС.ЗаполнитьРасхожденияСтрокиРаздела12(ДанныеСтроки);
			ДанныеСтроки.ПокупательИННРасхождениеКонтрагенты = ДанныеСтроки.ПокупательИННКонтрагенты.Скопировать();
			ЗаполнитьДобавленныеКолонкиСтрокиРаздела12(ДанныеСтроки);
		КонецЕсли;
		
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПредставлениеСчетаФактуры(СтрокаТаблицы, ТипРеквизитов)
	
	РеквизитыКоррСчетаФактуры = "";
	Если ЗначениеЗаполнено(СтрокаТаблицы["НомерКорректировочногоСчетаФактуры"+ТипРеквизитов]) Тогда
		Если ЗначениеЗаполнено(СтрокаТаблицы["НомерИсправленияКорректировочногоСчетаФактуры"+ТипРеквизитов]) Тогда
			РеквизитыКоррСчетаФактуры = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									НСтр("ru = 'Корр. %1 от %2 (испр.%3 от %4) по с/ф '"),
									СтрокаТаблицы["НомерКорректировочногоСчетаФактуры"+ТипРеквизитов],
									Формат(СтрокаТаблицы["ДатаКорректировочногоСчетаФактуры"+ТипРеквизитов], "ДЛФ=D"),
									СтрокаТаблицы["НомерИсправленияКорректировочногоСчетаФактуры"+ТипРеквизитов],
									Формат(СтрокаТаблицы["ДатаИсправленияКорректировочногоСчетаФактуры"+ТипРеквизитов], "ДЛФ=D"));
		Иначе
			РеквизитыКоррСчетаФактуры = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									НСтр("ru = 'Корр. %1 от %2 по с/ф '"),
									СтрокаТаблицы["НомерКорректировочногоСчетаФактуры"+ТипРеквизитов],
									Формат(СтрокаТаблицы["ДатаКорректировочногоСчетаФактуры"+ТипРеквизитов], "ДЛФ=D"));
		КонецЕсли;
	КонецЕсли;
	РеквизитыСчетаФактуры = "";
	Если ЗначениеЗаполнено(СтрокаТаблицы["НомерСчетаФактуры"+ТипРеквизитов]) Тогда
		Если ЗначениеЗаполнено(СтрокаТаблицы["НомерИсправленияСчетаФактуры"+ТипРеквизитов]) Тогда
			РеквизитыСчетаФактуры = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									НСтр("ru = '%1 от %2(испр.%3 от %4)'"),
									СтрокаТаблицы["НомерСчетаФактуры"+ТипРеквизитов],
									Формат(СтрокаТаблицы["ДатаСчетаФактуры"+ТипРеквизитов], "ДЛФ=D"),
									СтрокаТаблицы["НомерИсправленияСчетаФактуры"+ТипРеквизитов],
									Формат(СтрокаТаблицы["ДатаИсправленияСчетаФактуры"+ТипРеквизитов], "ДЛФ=D"));
		Иначе
			РеквизитыСчетаФактуры = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									НСтр("ru = '%1 от %2'"),
									СтрокаТаблицы["НомерСчетаФактуры"+ТипРеквизитов],
									Формат(СтрокаТаблицы["ДатаСчетаФактуры"+ТипРеквизитов], "ДЛФ=D"));
		КонецЕсли;
	КонецЕсли;
	
	СтрокаТаблицы["РеквизитыСчетаФактуры"+ТипРеквизитов] = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
																НСтр("ru = '%1%2'"), РеквизитыКоррСчетаФактуры, РеквизитыСчетаФактуры);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПредставлениеСпискаКонтрагентов(СтрокаТаблицы, ИмяРеквизита)
	
	СписокКонтрагентов = СтрокаТаблицы[ИмяРеквизита+"Данные"];
	
	Если СписокКонтрагентов.Количество() > 0 Тогда
		СтрокаТаблицы[ИмяРеквизита+"ИНН"] = СписокКонтрагентов[0].Значение.ИНН;
	Иначе
		СтрокаТаблицы[ИмяРеквизита+"ИНН"] = "";
	КонецЕсли;
	
	СтрокаТаблицы[ИмяРеквизита+"КоличествоСтрок"] = СписокКонтрагентов.Количество();
	
	СтрокаТаблицы[ИмяРеквизита+"Представление"]   = ПредставлениеПоСпискуСтрок(СписокКонтрагентов);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДанныеКонтрагента(СтрокаТаблицы, ПолеИНН, ТаблицаКонтрагентов, ПолеКПП = "")
	
	СведенияОКонтрагенте = Новый Структура("ИНН, КПП");
	СведенияОКонтрагенте.ИНН = СтрокаТаблицы[ПолеИНН];
	
	Если ЗначениеЗаполнено(ПолеКПП) Тогда
		
		СведенияОКонтрагенте.КПП = СтрокаТаблицы[ПолеКПП];
		
		Сведения = Документы.ПоясненияКДекларацииПоНДС.СведенияОКонтрагентеПоТаблицеКонтрагентов(
			СведенияОКонтрагенте.ИНН, 
			ТаблицаКонтрагентов, 
			СведенияОКонтрагенте.КПП);
		
		СтрокаТаблицы[ПолеИНН+"Контрагенты"] = Сведения.Контрагенты;
		
		Если СтрокаТаблицы.Свойство(ПолеКПП+"Контрагенты") Тогда
			СтрокаТаблицы[ПолеКПП+"Контрагенты"] = Сведения.Контрагенты;
		КонецЕсли;
			
	Иначе
			
		Сведения = Документы.ПоясненияКДекларацииПоНДС.СведенияОКонтрагентеПоТаблицеКонтрагентов(
			СведенияОКонтрагенте.ИНН, 
			ТаблицаКонтрагентов);
			
		СтрокаТаблицы[ПолеИНН+"Контрагенты"] = Сведения.Контрагенты;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПредставлениеПериодаОтраженияЗаписи(СтрокаТаблицы)
	
	ПредставлениеПериода = "";
	Если ЗначениеЗаполнено(СтрокаТаблицы.ПериодОтраженияЗаписи) Тогда
		ВидПериода = Число(Лев(СтрокаТаблицы.ПериодОтраженияЗаписи, 2));
		Год = Число(Сред(СтрокаТаблицы.ПериодОтраженияЗаписи, 4));
		Если Число(ВидПериода) <= 12 Тогда
			ПредставлениеПериода = Формат(Дата(Год, ВидПериода, 1), "ДФ='MMMM yyyy'");
		Иначе
			Если ВидПериода = 21 Тогда
				ПредставлениеПериода = "I квартал " + Формат(Год, "ЧГ=");
			ИначеЕсли ВидПериода = 22 Тогда
				ПредставлениеПериода = "II квартал " + Формат(Год, "ЧГ=");
			ИначеЕсли ВидПериода = 23 Тогда
				ПредставлениеПериода = "III квартал " + Формат(Год, "ЧГ=");
			ИначеЕсли ВидПериода = 24 Тогда
				ПредставлениеПериода = "IV квартал " + Формат(Год, "ЧГ=");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	СтрокаТаблицы.ПериодОтраженияЗаписиПредставление = ПредставлениеПериода;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПредставлениеКонтрагента(СтрокаТаблицы, ПолеИНН)
	
	СписокКонтрагентов = СтрокаТаблицы[ПолеИНН+"Контрагенты"];
	
	МассивПредставлений = Новый Массив;
	Для Каждого СтрокаКонтрагента Из СписокКонтрагентов Цикл
		МассивПредставлений.Добавить(СтрокаКонтрагента.Представление);
	КонецЦикла;
	ПредставлениеКонтрагента = СтрСоединить(МассивПредставлений, ";");
	
	Сведения = Новый Структура("ИНН", СтрокаТаблицы[ПолеИНН]);
	
	СтрокаТаблицы[ПолеИНН+"Представление"] = Документы.ПоясненияКДекларацииПоНДС.ПредставлениеКонтрагента(Сведения, ПредставлениеКонтрагента);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПредставлениеДокументовОплаты(СтрокаТаблицы, ИмяРеквизита)
	
	СписокДокументовОплаты = СтрокаТаблицы[ИмяРеквизита+"Данные"];
	
	Если СписокДокументовОплаты.Количество() > 0 Тогда
		СтрокаТаблицы[ИмяРеквизита+"Номер"] = СписокДокументовОплаты[0].Значение.Номер;
		СтрокаТаблицы[ИмяРеквизита+"Дата"] = СписокДокументовОплаты[0].Значение.Дата;
	Иначе
		СтрокаТаблицы[ИмяРеквизита+"Номер"] = "";
		СтрокаТаблицы[ИмяРеквизита+"Дата"] = Дата(1,1,1);
	КонецЕсли;
	
	СтрокаТаблицы[ИмяРеквизита+"КоличествоСтрок"] = СписокДокументовОплаты.Количество();
	
	СтрокаТаблицы[ИмяРеквизита+"Представление"] = ПредставлениеПоСпискуСтрок(СписокДокументовОплаты);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПредставлениеДатыПринятияНаУчет(СтрокаТаблицы, ИмяРеквизита)
	
	СписокДатПринятияНаУчет = СтрокаТаблицы[ИмяРеквизита+"Данные"];
	
	Если СписокДатПринятияНаУчет.Количество() > 0 Тогда
		СтрокаТаблицы[ИмяРеквизита+"Дата"] = СписокДатПринятияНаУчет[0].Значение.ДатаПринятияНаУчет;
	Иначе
		СтрокаТаблицы[ИмяРеквизита+"Дата"] = Дата(1,1,1);
	КонецЕсли;
	
	СтрокаТаблицы[ИмяРеквизита+"КоличествоСтрок"] = СписокДатПринятияНаУчет.Количество();
	
	СтрокаТаблицы[ИмяРеквизита+"Представление"] = ПредставлениеПоСпискуСтрок(СписокДатПринятияНаУчет);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПредставлениеПосредническойДеятельности(СтрокаТаблицы, ИмяРеквизита)
	
	СписокПосредническойДеятельности = СтрокаТаблицы[ИмяРеквизита+"Данные"];
	
	СтрокаТаблицы[ИмяРеквизита+"Представление"] = ЧислоПрописью(СписокПосредническойДеятельности.Количество(), , "операция, операции, операйи, ж, , , , ж, 0"); 
	
	СтрокаТаблицы[ИмяРеквизита+"Хэш"] = ХэшСпискаЗначенийРеквизитов(СписокПосредническойДеятельности);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ХэшСпискаЗначенийРеквизитов(СписокЗначенийРеквизитов)
	
	ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.MD5);
	Для Каждого Строка Из СписокЗначенийРеквизитов Цикл
		ТекстовоеПредставление = "";
		Для Каждого Элемент Из Строка.Значение Цикл
			ТекстовоеПредставление = ТекстовоеПредставление + Строка(Элемент.Значение);
		КонецЦикла;
		ХешированиеДанных.Добавить(ТекстовоеПредставление);
	КонецЦикла;
	
	Возврат ХешированиеДанных.ХешСумма;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокЗначенийРеквизита(СтрокаТаблицы, ИмяРеквизита, СписокПолей, ТаблицаСпискаПолей);
	СтрокаТаблицы[ИмяРеквизита+"Данные"] = Новый СписокЗначений();
	МассивЗначенийПолей = ТаблицаСпискаПолей.НайтиСтроки(Новый Структура("ИдентификаторЗначения", СтрокаТаблицы[ИмяРеквизита]));
	Для Каждого ЗначенияПоля ИЗ МассивЗначенийПолей Цикл
		СтруктураДанных = Новый Структура(СписокПолей);
		ЗаполнитьЗначенияСвойств(СтруктураДанных, ЗначенияПоля);
		Если ИмяРеквизита = "ДокументОплаты"
			ИЛИ ИмяРеквизита = "ДокументОплатыРасхождение" Тогда
			Представление = Документы.ПоясненияКДекларацииПоНДС.ПредставлениеДокументаОплаты(СтруктураДанных);
		ИначеЕсли ИмяРеквизита = "ДатаПринятияНаУчет"
			ИЛИ ИмяРеквизита = "ДатаПринятияНаУчетРасхождение" Тогда
			Представление = Документы.ПоясненияКДекларацииПоНДС.ПредставлениеДатыПринятияНаУчет(СтруктураДанных);
		ИначеЕсли ИмяРеквизита = "Продавец"
			ИЛИ ИмяРеквизита = "ПродавецРасхождение"
			ИЛИ ИмяРеквизита = "Покупатель"
			ИЛИ ИмяРеквизита = "ПокупательРасхождение" Тогда
			Представление = ЗначенияПоля.ПредставлениеКонтрагента;
			СтруктураДанных.Вставить("Контрагенты", ЗначенияПоля.Контрагенты);
		Иначе
			Представление = Неопределено;
		КонецЕсли;
		
		СтрокаТаблицы[ИмяРеквизита+"Данные"].Добавить(СтруктураДанных, Представление);
	КонецЦикла;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПредставлениеПоСпискуСтрок(СписокСтрок)
	
	Представление = "";
	Для Каждого Строка Из СписокСтрок Цикл
		Если ЗначениеЗаполнено(Представление) Тогда
			Представление = Представление + "; ";
		КонецЕсли;
		Представление = Представление + Строка.Представление;
	КонецЦикла;
	
	Возврат Представление;
	
КонецФункции

&НаСервере
Процедура ДобавитьКонтрагентов(Таблица, ТаблицаДанных, ПолеИНН, ПолеКПП = "")
	
	Для Каждого СтрокаТаблицыДанных Из ТаблицаДанных Цикл
		
		Если ЗначениеЗаполнено(СтрокаТаблицыДанных[ПолеИНН]) Тогда
			
			СтрокаИНН = Таблица.Добавить();
			СтрокаИНН.ИНН = СтрокаТаблицыДанных[ПолеИНН];
			
			Если ЗначениеЗаполнено(ПолеКПП) Тогда
				СтрокаИНН.КПП = СтрокаТаблицыДанных[ПолеКПП];
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРеквизитовСчетаФактуры(ИмяТабличнойЧасти, ДанныеСтроки, ТипРеквизитов)
	
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура();
	
	ПараметрыФормы.Вставить("НомерСтрокиДокумента", 		ДанныеСтроки.НомерСтроки);
	ПараметрыФормы.Вставить("НомерСтрокиДекларации", 		ДанныеСтроки.НомерСтрокиДекларации);
	
	ПараметрыФормы.Вставить("ДатаСчетаФактуры", 			ДанныеСтроки["ДатаСчетаФактуры"+ТипРеквизитов]);
	ПараметрыФормы.Вставить("НомерСчетаФактуры", 			ДанныеСтроки["НомерСчетаФактуры"+ТипРеквизитов]);
	ПараметрыФормы.Вставить("НомерИсправленияСчетаФактуры",	ДанныеСтроки["НомерИсправленияСчетаФактуры"+ТипРеквизитов]);
	ПараметрыФормы.Вставить("ДатаИсправленияСчетаФактуры",	ДанныеСтроки["ДатаИсправленияСчетаФактуры"+ТипРеквизитов]);
	ПараметрыФормы.Вставить("НомерКорректировочногоСчетаФактуры",		ДанныеСтроки["НомерКорректировочногоСчетаФактуры"+ТипРеквизитов]);
	ПараметрыФормы.Вставить("ДатаКорректировочногоСчетаФактуры",		ДанныеСтроки["ДатаКорректировочногоСчетаФактуры"+ТипРеквизитов]);
	ПараметрыФормы.Вставить("НомерИсправленияКорректировочногоСчетаФактуры",	ДанныеСтроки["НомерИсправленияКорректировочногоСчетаФактуры"+ТипРеквизитов]);
	ПараметрыФормы.Вставить("ДатаИсправленияКорректировочногоСчетаФактуры",		ДанныеСтроки["ДатаИсправленияКорректировочногоСчетаФактуры"+ТипРеквизитов]);
	
	ПараметрыФормы.Вставить("ТолькоПросмотр", ТолькоПросмотр ИЛИ ТипРеквизитов = "");
	
	ДополнительныеПараметры = Новый Структура("ИмяТабличнойЧасти, ИдентификаторСтроки, ТипРеквизитов", 
					ИмяТабличнойЧасти, ДанныеСтроки.ПолучитьИдентификатор(), ТипРеквизитов);
	
	ОповещениеФормы = Новый ОписаниеОповещения("ОбработчикЗакрытияФормыРеквизитовСчетаФактурыЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("Документ.ПоясненияКДекларацииПоНДС.Форма.ФормаРеквизитыСчетаФактуры", ПараметрыФормы, ЭтаФорма,,,,ОповещениеФормы,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗакрытияФормыРеквизитовСчетаФактурыЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки = Объект[ДополнительныеПараметры.ИмяТабличнойЧасти].НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);
	
	ТипРеквизитов = ДополнительныеПараметры.ТипРеквизитов;
	
	РезультатЗакрытия.Свойство("ДатаСчетаФактуры",				ДанныеСтроки["ДатаСчетаФактуры"+ТипРеквизитов]);
	РезультатЗакрытия.Свойство("НомерСчетаФактуры",				ДанныеСтроки["НомерСчетаФактуры"+ТипРеквизитов]);
	РезультатЗакрытия.Свойство("НомерИсправленияСчетаФактуры",	ДанныеСтроки["НомерИсправленияСчетаФактуры"+ТипРеквизитов]);
	РезультатЗакрытия.Свойство("ДатаИсправленияСчетаФактуры",	ДанныеСтроки["ДатаИсправленияСчетаФактуры"+ТипРеквизитов]);
	РезультатЗакрытия.Свойство("НомерКорректировочногоСчетаФактуры",	ДанныеСтроки["НомерКорректировочногоСчетаФактуры"+ТипРеквизитов]);
	РезультатЗакрытия.Свойство("ДатаКорректировочногоСчетаФактуры",		ДанныеСтроки["ДатаКорректировочногоСчетаФактуры"+ТипРеквизитов]);
	РезультатЗакрытия.Свойство("НомерИсправленияКорректировочногоСчетаФактуры",	ДанныеСтроки["НомерИсправленияКорректировочногоСчетаФактуры"+ТипРеквизитов]);
	РезультатЗакрытия.Свойство("ДатаИсправленияКорректировочногоСчетаФактуры",		ДанныеСтроки["ДатаИсправленияКорректировочногоСчетаФактуры"+ТипРеквизитов]);
	
	УстановитьПредставлениеСчетаФактуры(ДанныеСтроки, ТипРеквизитов);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСчетаФактуры(ИмяТабличнойЧасти, ДанныеСтроки, ТипРеквизитов)
	
	Если ИмяТабличнойЧасти = "КнигаПокупок"
		ИЛИ ИмяТабличнойЧасти = "КнигаПокупокДл" Тогда
		
		ЭтоСчетФактураВыданный = Ложь;
		
		ДанныеПродавца = ДанныеСтроки.ПродавецДанные;
		Если ДанныеПродавца.Количество() > 0 Тогда
			ИННКонтрагента = ДанныеПродавца[0].Значение.ИНН;
		Иначе
			ИННКонтрагента = "";
		КонецЕсли;
		
	ИначеЕсли ИмяТабличнойЧасти = "КнигаПродаж"
		ИЛИ ИмяТабличнойЧасти = "КнигаПродажДл" Тогда
		
		ДанныеПродавца = ДанныеСтроки.ПокупательДанные;
		Если ДанныеПродавца.Количество() > 0 Тогда
			ИННКонтрагента = ДанныеПродавца[0].Значение.ИНН;
		Иначе
			ИННКонтрагента = "";
		КонецЕсли;
		
		ЭтоСчетФактураВыданный = Истина;
	КонецЕсли;
	
	ПараметрыПоиска = Новый Структура();
	ПараметрыПоиска.Вставить("Организация", Объект.Организация);
	ПараметрыПоиска.Вставить("ИННКонтрагента", ИННКонтрагента);
	ПараметрыПоиска.Вставить("СчетФактураВыданный", ЭтоСчетФактураВыданный);
	ПараметрыПоиска.Вставить("НомерСчетаФактуры", ДанныеСтроки.НомерСчетаФактуры);
	ПараметрыПоиска.Вставить("ДатаСчетаФактуры", ДанныеСтроки.ДатаСчетаФактуры);
	ПараметрыПоиска.Вставить("НомерИсправленияСчетаФактуры", ДанныеСтроки.НомерИсправленияСчетаФактуры);
	ПараметрыПоиска.Вставить("ДатаИсправленияСчетаФактуры", ДанныеСтроки.ДатаИсправленияСчетаФактуры);
	ПараметрыПоиска.Вставить("НомерКорректировочногоСчетаФактуры", ДанныеСтроки.НомерКорректировочногоСчетаФактуры);
	ПараметрыПоиска.Вставить("ДатаКорректировочногоСчетаФактуры", ДанныеСтроки.ДатаКорректировочногоСчетаФактуры);
	ПараметрыПоиска.Вставить("НомерИсправленияКорректировочногоСчетаФактуры", ДанныеСтроки.НомерИсправленияКорректировочногоСчетаФактуры);
	ПараметрыПоиска.Вставить("ДатаИсправленияКорректировочногоСчетаФактуры", ДанныеСтроки.ДатаИсправленияКорректировочногоСчетаФактуры);
	
	ПоискВыполнен = Ложь;
	НайденныйСчетФактура = НайтиСчетФактуруНаСервере(ПараметрыПоиска, ПоискВыполнен);
	Если ПоискВыполнен Тогда
		Если ЗначениеЗаполнено(НайденныйСчетФактура) Тогда
			ПоказатьЗначение(, НайденныйСчетФактура);
		Иначе
			ПоказатьПредупреждение(, НСтр("ru = 'Счет-фактура не найден'"));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция КодыВидовОперацийПолученныхСчетовФактур(ЭтоЖурнал = Ложь)
	
	// В схеме перечень этих кодов указан в типе КнПокСтрТип 
	
	СписокКодов = Новый СписокЗначений();
	СписокКодов.Добавить("01", "01 - Полученные товары, работы, услуги");
	СписокКодов.Добавить("02", "02 - Авансы выданные");
	СписокКодов.Добавить("03", "03 - Возврат от покупателя"); // Устаревший код.
	СписокКодов.Добавить("04", "04 - Товары, работы, услуги комитента");// Устаревший код.
	СписокКодов.Добавить("05", "05 - Авансы за товары, работы, услуги комитента");// Устаревший код.

	// 06-09 указаны в схеме ON_OTTRNDS_1_887_00_05_01_03 для полученных СФ (КнПокСтрТип)
	// однако для полученных их нельзя использовать, но решено было оставить, раз в схеме они есть.
	СписокКодов.Добавить("06", "06 - Налоговый агент, ст. 161 НК");
	СписокКодов.Добавить("07", "07 - Списание за счет прибыли, пп.2 п.1 ст. 146 НК");
	СписокКодов.Добавить("08", "08 - Строительно-монтажные работы, пп.3 п.1 ст. 146 НК");
	СписокКодов.Добавить("09", "09 - Суммы, связанные с расчетами по оплате, ст. 162 НК");
	
	СписокКодов.Добавить("10", "10 - Полученные безвозмездно товары, работы, услуги");
	СписокКодов.Добавить("11", "11 - Полученные товары, права, п.3,4,5.1 статьи 154, пп.1-4 статьи 155 НК");// Устаревший код.
	СписокКодов.Добавить("12", "12 - Авансы выданные за товары, права, п.3,4,5.1 статьи 154, пп.1-4 статьи 155 НК");// Устаревший код.
	СписокКодов.Добавить("13", "13 - Капитальное строительство, модернизация (реконструкция) объектов недвижимости");// Устаревший код.
	СписокКодов.Добавить("15", "15 - Совместное приобретение товаров, работ, услуг для собственных нужд и для комитента");// Новый код.
	СписокКодов.Добавить("16", "16 - Возврат от покупателя-неплательщика НДС");
	СписокКодов.Добавить("17", "17 - Возврат от покупателя-физического лица");
	СписокКодов.Добавить("18", "18 - Изменение стоимости отгруженных товаров (работ, услуг) в сторону уменьшения");
	СписокКодов.Добавить("19", "19 - Ввоз товаров из Евразийского экономического союза");
	СписокКодов.Добавить("20", "20 - Ввоз импортных товаров на территорию РФ");
	
	// 21 указан в схеме ON_OTTRNDS_1_887_00_05_01_03 для полученных СФ (КнПокСтрТип)
	// однако для полученных их нельзя использовать, но решено было оставить, раз в схеме они есть.
	СписокКодов.Добавить("21", "21 - Восстановление НДС, п.8 ст. 145, п.3 ст. 170, ст. 171.1 НК, а также при операциях, облагаемых по ставке 0%");
	
	СписокКодов.Добавить("22", "22 - Возврат, зачет авансовых платежей, п.5 статьи 171, п.6 статьи 172 НК");
	СписокКодов.Добавить("23", "23 - Командировочные расходы по бланку строгой отчетности, п.7 статьи 171 НК");
	СписокКодов.Добавить("24", "24 - Подтверждение ставки 0% после истечения 180 дней");
	СписокКодов.Добавить("25", "25 - Подтверждение ставки 0%");
	
	// 26 указан в схеме ON_OTTRNDS_1_887_00_05_01_03 для полученных СФ (КнПокСтрТип)
	// однако для полученных их нельзя использовать, но решено было оставить, раз в схеме они есть.
	СписокКодов.Добавить("26", "26 - Реализация товаров, работ, услуг неплательщикам НДС, получение авансов");
	
	СписокКодов.Добавить("27", "27 - Сводный комиссионный счет-фактура, п.3.1 статьи 169 НК");
	СписокКодов.Добавить("28", "28 - Сводный комиссионный счет-фактура на аванс, п.3.1 статьи 169 НК");
	
	Если ЭтоЖурнал Тогда
		// 29, 30 указаны в схеме ON_OTTRNDS_1_887_00_05_01_03 для _журнала_учета_ полученных_СФ (ЖУчПСтрТип)
		// однако для полученных их нельзя использовать, но решено было оставить, раз в схеме они есть.
		СписокКодов.Добавить("29", "29 - Корректировка по п.6 ст. 105.3 НК");
		СписокКодов.Добавить("30", "30 - Отгрузка товаров в ОЭЗ Калининградской обл., абз.1 пп.1.1 п.1 ст. 151 НК");
	Иначе
		СписокКодов.Добавить("32", "32 - Вычет НДС в ОЭЗ Калининградской обл., п.14 ст. 171 НК");// Новый код.
		СписокКодов.Добавить("99", "99 - Вычет НДС по налоговым накладным");// Новый код в схеме, но он является устаревшим.
	КонецЕсли;
	
	Возврат СписокКодов;
	
КонецФункции

&НаКлиенте
Функция КодыВидовОперацийВыданныхСчетовФактур(ЭтоЖурнал = Ложь)
	
	// В схеме перечень этих кодов указан в типе КнПродСтрТип 
	
	СписокКодов = Новый СписокЗначений();
	СписокКодов.Добавить("01", "01 - Реализованные товары, работы, услуги");
	СписокКодов.Добавить("02", "02 - Авансы полученные");
	СписокКодов.Добавить("03", "03 - Возврат поставщику"); // Устаревший код.
	СписокКодов.Добавить("04", "04 - Товары, работы, услуги комитента"); // Устаревший код.
	СписокКодов.Добавить("05", "05 - Авансы за товары, работы, услуги комитента"); // Устаревший код.
	СписокКодов.Добавить("06", "06 - Налоговый агент, статья 161 НК");
	СписокКодов.Добавить("07", "07 - Списание за счет прибыли, пп.2 п.1 статьи 146 НК"); // Устаревший код.
	СписокКодов.Добавить("08", "08 - Строительно-монтажные работы, пп.3 п.1 статьи 146 НК"); // Устаревший код.
	СписокКодов.Добавить("09", "09 - Суммы, связанные с расчетами по оплате, статья 162 НК"); // Устаревший код.
	СписокКодов.Добавить("10", "10 - Переданные безвозмездно товары, работы, услуги");
	СписокКодов.Добавить("11", "11 - Реализованные товары, права, п.3,4,5.1 статьи 154, пп.1-4 статьи 155 НК"); // Устаревший код.
	СписокКодов.Добавить("12", "12 - Авансы полученные за товары, права, п.3,4,5.1 статьи 154, пп.1-4 статьи 155 НК"); // Устаревший код.
	СписокКодов.Добавить("13", "13 - Капитальное строительство, модернизация (реконструкция) объектов недвижимости");
	Если НЕ ЭтоЖурнал Тогда
		СписокКодов.Добавить("14", "14 - Реализация прав, пп.1-4 ст. 155 НК");// Новый код.
	КонецЕсли;
	СписокКодов.Добавить("15", "15 - Совместная реализация собственных и комиссионных товаров, работ, услуг");// Новый код.
	СписокКодов.Добавить("16", "16 - Возврат от покупателя-неплательщика НДС");
	
	// 17 указан в схеме ON_OTTRNDS_1_887_00_05_01_03 для выданных СФ (КнПродСтрТип)
	// однако для выданных их нельзя использовать, но решено было оставить, раз в схеме они есть.
	СписокКодов.Добавить("17", "17 - Возврат от покупателя-физического лица");
	
	СписокКодов.Добавить("18", "18 - Изменение стоимости полученных товаров (работ, услуг) в сторону уменьшения");
	
	// 19, 20 указаны в схеме ON_OTTRNDS_1_887_00_05_01_03 для выданных СФ (КнПродСтрТип)
	// однако для выданных их нельзя использовать, но решено было оставить, раз в схеме они есть.
	СписокКодов.Добавить("19", "19 - Ввоз товаров из Евразийского экономического союза");
	СписокКодов.Добавить("20", "20 - Ввоз импортных товаров на территорию РФ");
	
	СписокКодов.Добавить("21", "21 - Восстановление НДС, п.8 статьи 145, п.3 статьи 170, статья 171.1 НК, а также при операциях, облагаемых по ставке 0%");
	
	// 22-25 указаны в схеме ON_OTTRNDS_1_887_00_05_01_03 для выданных СФ (КнПродСтрТип)
	// однако для выданных их нельзя использовать, но решено было оставить, раз в схеме они есть.
	СписокКодов.Добавить("22", "22 - Возврат, зачет авансовых платежей, п.5 статьи 171, п.6 статьи 172 НК");
	СписокКодов.Добавить("23", "23 - Командировочные расходы по бланку строгой отчетности, п.7 статьи 171 НК");
	СписокКодов.Добавить("24", "24 - Подтверждение ставки 0% после истечения 180 дней");
	СписокКодов.Добавить("25", "25 - Подтверждение ставки 0%");
	
	СписокКодов.Добавить("26", "26 - Счета-фактуры не составляются по письменному согласию сторон");
	СписокКодов.Добавить("27", "27 - Сводный комиссионный счет-фактура, п.3.1 статьи 169 НК");
	СписокКодов.Добавить("28", "28 - Сводный комиссионный счет-фактура на аванс, п.3.1 статьи 169 НК");
	СписокКодов.Добавить("29", "29 - Корректировка по п.6 ст. 105.3 НК");// Новый код.
	СписокКодов.Добавить("30", "30 - Отгрузка товаров в ОЭЗ Калининградской обл., абз.1 пп.1.1 п.1 ст. 151 НК");// Новый код.
	Если НЕ ЭтоЖурнал Тогда
		СписокКодов.Добавить("31", "31 - Уплата НДС в ОЭЗ Калининградской обл., абз.2 пп.1.1 п.1 ст. 151 НК");// Новый код.
	КонецЕсли;
	
	Возврат СписокКодов;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуСпискаКонтрагентов(ИмяТабличнойЧасти, ДанныеСтроки, ИмяРеквизита, Заголовок)
	
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СписокКонтрагентов = ДанныеСтроки[ИмяРеквизита+"Данные"];
	
	ПараметрыФормы = Новый Структура();
	
	ПараметрыФормы.Вставить("Контрагенты",    СписокКонтрагентов);
	ПараметрыФормы.Вставить("ЗаголовокФормы", Заголовок);
	ПараметрыФормы.Вставить("ТолькоПросмотр", ТолькоПросмотр ИЛИ Найти(ИмяРеквизита, "Расхождение")=0);
	
	ДополнительныеПараметры = Новый Структура("ИмяТабличнойЧасти, ИдентификаторСтроки, ИмяРеквизита", 
					ИмяТабличнойЧасти, ДанныеСтроки.ПолучитьИдентификатор(), ИмяРеквизита);
	
	ОповещениеФормы = Новый ОписаниеОповещения("ОбработчикЗакрытияФормыСпискаКонтрагентовЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("Документ.ПоясненияКДекларацииПоНДС.Форма.ФормаСпискаКонтрагентов", ПараметрыФормы, ЭтаФорма,,,,ОповещениеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗакрытияФормыСпискаКонтрагентовЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки = Объект[ДополнительныеПараметры.ИмяТабличнойЧасти].НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ДанныеСтроки[ДополнительныеПараметры.ИмяРеквизита+"Данные"] = РезультатЗакрытия;
	
	УстановитьПредставлениеСпискаКонтрагентов(ДанныеСтроки, ДополнительныеПараметры.ИмяРеквизита);
	
	Элементы[ДополнительныеПараметры.ИмяТабличнойЧасти].ЗакончитьРедактированиеСтроки(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораВалюты(ИмяТабличнойЧасти, ДанныеСтроки, ИмяРеквизита)
	
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТолькоПросмотр
		ИЛИ ДанныеСтроки.РезультатПроверки = ПредопределенноеЗначение("Перечисление.РезультатПроверкиСтрокиДекларации.СведенияВерны") Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ТекущаяСтрока", ПолучитьВалютуПоКоду(ДанныеСтроки[ИмяРеквизита]));
	
	ДополнительныеПараметры = Новый Структура("ИмяТабличнойЧасти, ИдентификаторСтроки, ИмяРеквизита", 
					ИмяТабличнойЧасти, ДанныеСтроки.ПолучитьИдентификатор(), ИмяРеквизита);
	
	ОповещениеФормы = Новый ОписаниеОповещения("ОбработчикЗакрытияФормыВыбораВалютыЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("Справочник.Валюты.ФормаВыбора", ПараметрыФормы, ЭтаФорма, , , , ОповещениеФормы, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗакрытияФормыВыбораВалютыЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки = Объект[ДополнительныеПараметры.ИмяТабличнойЧасти].НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ДанныеСтроки[ДополнительныеПараметры.ИмяРеквизита] = КодВалюты(РезультатЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПосредническойДеятельности(ИмяТабличнойЧасти, ДанныеСтроки, ИмяРеквизита)
	
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СписокПосредническойДеятельности = ДанныеСтроки[ИмяРеквизита+"Данные"];
	
	ПараметрыФормы = Новый Структура();
	
	ПараметрыФормы.Вставить("ПосредническаяДеятельность", СписокПосредническойДеятельности);
	ПараметрыФормы.Вставить("ЗаголовокФормы", Заголовок);
	ПараметрыФормы.Вставить("ТолькоПросмотр", ТолькоПросмотр ИЛИ Найти(ИмяРеквизита, "Расхождение")=0);
	
	ДополнительныеПараметры = Новый Структура("ИмяТабличнойЧасти, ИдентификаторСтроки, ИмяРеквизита", 
					ИмяТабличнойЧасти, ДанныеСтроки.ПолучитьИдентификатор(), ИмяРеквизита);
	
	ОповещениеФормы = Новый ОписаниеОповещения("ОбработчикЗакрытияФормыПосредническойДеятельностиЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("Документ.ПоясненияКДекларацииПоНДС.Форма.ФормаСпискаПосредническойДеятельности", ПараметрыФормы, ЭтаФорма,,,,ОповещениеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗакрытияФормыПосредническойДеятельностиЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки = Объект[ДополнительныеПараметры.ИмяТабличнойЧасти].НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ДанныеСтроки[ДополнительныеПараметры.ИмяРеквизита+"Данные"] = РезультатЗакрытия;
	
	УстановитьПредставлениеПосредническойДеятельности(ДанныеСтроки, ДополнительныеПараметры.ИмяРеквизита);
	
	Элементы[ДополнительныеПараметры.ИмяТабличнойЧасти].ЗакончитьРедактированиеСтроки(Ложь);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВалютуПоКоду(КодВалюты)
	
	Запрос = Новый Запрос();
	Запрос.Параметры.Вставить("КодВалюты", СокрЛП(КодВалюты));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Валюты.Ссылка
	|ИЗ
	|	Справочник.Валюты КАК Валюты
	|ГДЕ
	|	Валюты.Код = &КодВалюты";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.Валюты.ПустаяСсылка();
	
КонецФункции

&НаСервереБезКонтекста
Функция КодВалюты(Валюта)
	
	Если ЗначениеЗаполнено(Валюта) Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Валюта, "Код");
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуДокументовОплаты(ИмяТабличнойЧасти, ДанныеСтроки, ИмяРеквизита)
	
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СписокДокументовОплаты = ДанныеСтроки[ИмяРеквизита+"Данные"];
	
	ПараметрыФормы = Новый Структура();
	
	ПараметрыФормы.Вставить("ДокументыОплаты", СписокДокументовОплаты);
	ПараметрыФормы.Вставить("ТолькоПросмотр",  ТолькоПросмотр ИЛИ Найти(ИмяРеквизита, "Расхождение")=0);
	
	ДополнительныеПараметры = Новый Структура("ИмяТабличнойЧасти, ИдентификаторСтроки, ИмяРеквизита", 
					ИмяТабличнойЧасти, ДанныеСтроки.ПолучитьИдентификатор(), ИмяРеквизита);
	
	ОповещениеФормы = Новый ОписаниеОповещения("ОбработчикЗакрытияФормыДокументовОплатыЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("Документ.ПоясненияКДекларацииПоНДС.Форма.ФормаСпискаДокументовОплаты", ПараметрыФормы, ЭтаФорма,,,,ОповещениеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗакрытияФормыДокументовОплатыЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки = Объект[ДополнительныеПараметры.ИмяТабличнойЧасти].НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ДанныеСтроки[ДополнительныеПараметры.ИмяРеквизита+"Данные"] = РезультатЗакрытия;
	
	УстановитьПредставлениеДокументовОплаты(ДанныеСтроки, ДополнительныеПараметры.ИмяРеквизита);
	
	Элементы[ДополнительныеПараметры.ИмяТабличнойЧасти].ЗакончитьРедактированиеСтроки(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуТаможеннойДекларации(ИмяТабличнойЧасти, ДанныеСтроки, ИмяРеквизита)
	
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивТаможенныхДеклараций = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ДанныеСтроки[ИмяРеквизита], ";");
	
	ПараметрыФормы = Новый Структура();
	
	ПараметрыФормы.Вставить("ТаможенныеДекларации", МассивТаможенныхДеклараций);
	ПараметрыФормы.Вставить("ТолькоПросмотр",       ТолькоПросмотр ИЛИ Найти(ИмяРеквизита, "Расхождение")=0);
	
	ДополнительныеПараметры = Новый Структура("ИмяТабличнойЧасти, ИдентификаторСтроки, ИмяРеквизита", 
					ИмяТабличнойЧасти, ДанныеСтроки.ПолучитьИдентификатор(), ИмяРеквизита);
	
	ОповещениеФормы = Новый ОписаниеОповещения("ОбработчикЗакрытияФормыТаможеннойДекларацииЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("Документ.ПоясненияКДекларацииПоНДС.Форма.ФормаСпискаТаможенныхДеклараций", ПараметрыФормы, ЭтаФорма,,,,ОповещениеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗакрытияФормыТаможеннойДекларацииЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки = Объект[ДополнительныеПараметры.ИмяТабличнойЧасти].НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ДанныеСтроки[ДополнительныеПараметры.ИмяРеквизита] = СтрСоединить(РезультатЗакрытия, ";");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуДатыПринятияНаУчет(ИмяТабличнойЧасти, ДанныеСтроки, ИмяРеквизита)
	
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СписокДатПринятияКУчету = ДанныеСтроки[ИмяРеквизита+"Данные"];
	
	ПараметрыФормы = Новый Структура();
	
	ПараметрыФормы.Вставить("ДатыПринятияНаУчет", СписокДатПринятияКУчету);
	ПараметрыФормы.Вставить("ТолькоПросмотр",  ТолькоПросмотр ИЛИ Найти(ИмяРеквизита, "Расхождение")=0);
	
	ДополнительныеПараметры = Новый Структура("ИмяТабличнойЧасти, ИдентификаторСтроки, ИмяРеквизита", 
					ИмяТабличнойЧасти, ДанныеСтроки.ПолучитьИдентификатор(), ИмяРеквизита);
	
	ОповещениеФормы = Новый ОписаниеОповещения("ОбработчикЗакрытияФормыДатыПринятияНаУчетЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("Документ.ПоясненияКДекларацииПоНДС.Форма.ФормаСпискаДатПринятияНаУчет", ПараметрыФормы, ЭтаФорма,,,,ОповещениеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗакрытияФормыДатыПринятияНаУчетЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки = Объект[ДополнительныеПараметры.ИмяТабличнойЧасти].НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ДанныеСтроки[ДополнительныеПараметры.ИмяРеквизита+"Данные"] = РезультатЗакрытия;
	
	УстановитьПредставлениеДатыПринятияНаУчет(ДанныеСтроки, ДополнительныеПараметры.ИмяРеквизита);
	
	Элементы[ДополнительныеПараметры.ИмяТабличнойЧасти].ЗакончитьРедактированиеСтроки(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииДокументаОплатыНаСервере(ИмяТабличнойЧасти, Строка)
	
	ДанныеСтроки = Объект[ИмяТабличнойЧасти].НайтиПоИдентификатору(Строка);
	Если ДанныеСтроки.ДокументОплатыРасхождениеДанные.Количество() = 0 Тогда
		СтруктураДанных = Новый Структура(РеквизитыДокументовОплаты);
		ДанныеСтроки.ДокументОплатыРасхождениеДанные.Добавить(СтруктураДанных);
	КонецЕсли;
	
	ДанныеСтроки.ДокументОплатыРасхождениеДанные[0].Значение.Номер = ДанныеСтроки.ДокументОплатыРасхождениеНомер;
	ДанныеСтроки.ДокументОплатыРасхождениеДанные[0].Значение.Дата = ДанныеСтроки.ДокументОплатыРасхождениеДата;
	ДанныеСтроки.ДокументОплатыРасхождениеДанные[0].Представление = Документы.ПоясненияКДекларацииПоНДС.ПредставлениеДокументаОплаты(ДанныеСтроки.ДокументОплатыРасхождениеДанные[0].Значение);
	УстановитьПредставлениеДокументовОплаты(ДанныеСтроки, "ДокументОплатыРасхождение");
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииИННКонтрагентаСпискаРеквизитов(ИмяТабличнойЧасти, Строка, ИмяРеквизита)
	
	ДанныеСтроки = Объект[ИмяТабличнойЧасти].НайтиПоИдентификатору(Строка);
	
	Сведения = СведенияОКонтрагентеПоИНН(ДанныеСтроки[ИмяРеквизита+"ИНН"]);
	
	УстановитьСведенияОКонтрагентеСписка(ДанныеСтроки, ИмяРеквизита, Сведения, РеквизитыКонтрагентов);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСведенияОКонтрагентеСписка(ДанныеСтроки, ИмяРеквизита, Сведения, РеквизитыКонтрагентов)
	
	Если СокрЛП(Сведения.ИНН) <> "" Тогда
		Если ДанныеСтроки[ИмяРеквизита+"Данные"].Количество() = 0 Тогда
			СтруктураДанных = Новый Структура(РеквизитыКонтрагентов);
			СтруктураДанных.Вставить("Контрагенты");
			ДанныеСтроки[ИмяРеквизита+"Данные"].Добавить(СтруктураДанных);
		КонецЕсли;
		
		ДанныеСтроки[ИмяРеквизита+"Данные"][0].Значение.ИНН = Сведения.ИНН;
		ДанныеСтроки[ИмяРеквизита+"Данные"][0].Значение.Контрагенты = Сведения.Контрагенты;
		ДанныеСтроки[ИмяРеквизита+"Данные"][0].Представление = Сведения.Представление;
	Иначе
		ДанныеСтроки[ИмяРеквизита+"Данные"].Очистить();
	КонецЕсли;
	
	УстановитьПредставлениеСпискаКонтрагентов(ДанныеСтроки, ИмяРеквизита);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСведенияОКонтрагентеРеквизита(ДанныеСтроки, ИмяРеквизита, Сведения, КлючЗначения = "ИНН")
	
	ДанныеСтроки[ИмяРеквизита]                 = Сведения[КлючЗначения];
	ДанныеСтроки[ИмяРеквизита+"Представление"] = Сведения.Представление;
	ДанныеСтроки[ИмяРеквизита+"Контрагенты"]   = Сведения.Контрагенты;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКонтрагента(ИмяТабличнойЧасти, ДанныеСтроки, ИмяРеквизита, ЭтоСписокКонтрагентов)
	
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	
	Если ЭтоСписокКонтрагентов Тогда
		СписокКонтрагенты = ДанныеСтроки[ИмяРеквизита+"Данные"];
		Если СписокКонтрагенты.Количество()>0 Тогда
			Контрагенты = СписокКонтрагенты[0].Значение.Контрагенты;
			Если Контрагенты.Количество()>0 Тогда
				ПараметрыФормы.Вставить("ТекущаяСтрока", Контрагенты[0].Значение);
			КонецЕсли;
		КонецЕсли;
	Иначе
		Контрагенты = ДанныеСтроки[ИмяРеквизита+"Контрагенты"];
		Если Контрагенты.Количество()>0 Тогда
			ПараметрыФормы.Вставить("ТекущаяСтрока", Контрагенты[0].Значение);
		КонецЕсли;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ИмяТабличнойЧасти",      ИмяТабличнойЧасти);
	ДополнительныеПараметры.Вставить("ИдентификаторСтроки",    ДанныеСтроки.ПолучитьИдентификатор());
	ДополнительныеПараметры.Вставить("ИмяРеквизита",           ИмяРеквизита);
	ДополнительныеПараметры.Вставить("ЭтоСписокКонтрагентов",  ЭтоСписокКонтрагентов);
	
	ОповещениеФормы = Новый ОписаниеОповещения("ВыбратьКонтрагентаЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора", ПараметрыФормы, ЭтотОбъект, , , , ОповещениеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКонтрагентаЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		
		ДанныеСтроки = Объект[ДополнительныеПараметры.ИмяТабличнойЧасти].НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);
		Если ДанныеСтроки = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Модифицированность = Истина;
		
		Сведения = СведенияОКонтрагентеПоСсылке(РезультатЗакрытия);
		
		Если ДополнительныеПараметры.ЭтоСписокКонтрагентов Тогда
			УстановитьСведенияОКонтрагентеСписка(ДанныеСтроки, ДополнительныеПараметры.ИмяРеквизита, Сведения, РеквизитыКонтрагентов);
		Иначе
			
			Если ДополнительныеПараметры.ИмяТабличнойЧасти = "НетКнигаПрод" Тогда
				
				ОтработатьВыборКонтрагентаВНетКнигаПрод(ДанныеСтроки, Сведения, ДополнительныеПараметры.ИмяРеквизита);
				
			Иначе
				
				УстановитьСведенияОКонтрагентеРеквизита(ДанныеСтроки, ДополнительныеПараметры.ИмяРеквизита, Сведения);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтработатьВыборКонтрагентаВНетКнигаПрод(ДанныеСтроки, Сведения, ИмяРеквизита) Экспорт
	
	ИмяРеквизитаИНН = ИменаРеквизитов(ИмяРеквизита).ИмяРеквизитаИНН;
	ИмяРеквизитаКПП = ИменаРеквизитов(ИмяРеквизита).ИмяРеквизитаКПП;
	
	УстановитьСведенияОКонтрагентеРеквизита(ДанныеСтроки, ИмяРеквизитаИНН, Сведения, "ИНН");
	УстановитьСведенияОКонтрагентеРеквизита(ДанныеСтроки, ИмяРеквизитаКПП, Сведения, "КПП");
	
	НетКнигаПродУстановитьЗначениеРасхождения(ИмяРеквизитаИНН);
	НетКнигаПродУстановитьЗначениеРасхождения(ИмяРеквизитаКПП);
	
КонецПроцедуры

Функция ИменаРеквизитов(ИмяРеквизита)
	
	ИмяРеквизитаИНН = "";
	ИмяРеквизитаКПП = "";
	
	Если СтрНайти(ИмяРеквизита, "ИНН") > 0 Тогда
		ИмяРеквизитаИНН = ИмяРеквизита;
		ИмяРеквизитаКПП = СтрЗаменить(ИмяРеквизита, "ИНН", "КПП");
	Иначе
		ИмяРеквизитаИНН = СтрЗаменить(ИмяРеквизита, "КПП", "ИНН");
		ИмяРеквизитаКПП = ИмяРеквизита;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ИмяРеквизитаИНН", ИмяРеквизитаИНН);
	ДополнительныеПараметры.Вставить("ИмяРеквизитаКПП", ИмяРеквизитаКПП);
	
	Возврат ДополнительныеПараметры;
	
КонецФункции

&НаСервере
Процедура ЗаписатьСведенияВТаблицу(ДанныеСтроки, ИмяРеквизита, ТаблицаХранения)
	
	Документы.ПоясненияКДекларацииПоНДС.ЗаписатьМассивРеквизитовВТаблицуХранения(
			ДанныеСтроки[ИмяРеквизита+"Данные"].ВыгрузитьЗначения(), ТаблицаХранения, ДанныеСтроки[ИмяРеквизита]);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СведенияОКонтрагентеПоСсылке(Контрагент)
	
	Возврат Документы.ПоясненияКДекларацииПоНДС.СведенияОКонтрагентеПоСсылке(Контрагент);
	
КонецФункции

&НаСервереБезКонтекста
Функция СведенияОКонтрагентеПоИНН(ИНН, КПП = "")
	
	Возврат Документы.ПоясненияКДекларацииПоНДС.СведенияОКонтрагентеПоИНН(ИНН, КПП);
	
КонецФункции

&НаСервереБезКонтекста
Функция НайтиСчетФактуруНаСервере(ПараметрыПоиска, ПоискВыполнен)
	
	НайденныйСчетФактура = Неопределено;
	
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиПереопределяемый.НайтиСчетФактуруПоРеквизитам(ПараметрыПоиска, ПоискВыполнен, НайденныйСчетФактура);
	
	Возврат НайденныйСчетФактура;
	
КонецФункции

&НаСервере
Процедура УстановитьВозможностьВыбораКонтрагентов()
	
	КонтрагентыДоступны = ЭлектронныйДокументооборотСКонтролирующимиОрганами.СправочникКонтрагентовДоступен();
	
	Если НЕ КонтрагентыДоступны Тогда
		Элементы.КнигаПокупокПродавецИННРасхождение.КнопкаВыбора = Ложь;
		Элементы.КнигаПокупокПосредникИННРасхождение.КнопкаВыбора = Ложь;
		Элементы.КнигаПокупокДлПродавецИННРасхождение.КнопкаВыбора = Ложь;
		Элементы.КнигаПокупокДлПосредникИННРасхождение.КнопкаВыбора = Ложь;
		Элементы.КнигаПродажПокупательРасхождениеИНН.КнопкаВыбора = Ложь;
		Элементы.КнигаПродажПосредникИННРасхождение.КнопкаВыбора = Ложь;
		Элементы.КнигаПродажДлПокупательРасхождениеИНН.КнопкаВыбора = Ложь;
		Элементы.КнигаПродажДлПосредникИННРасхождение.КнопкаВыбора = Ложь;
		Элементы.ЖурналУчетаВыставленныхСчетовФактурПокупательИННРасхождение.КнопкаВыбора = Ложь;
		Элементы.ЖурналУчетаПолученныхСчетовФактурПродавецИННРасхождение.КнопкаВыбора = Ложь;
		Элементы.ЖурналУчетаПолученныхСчетовФактурСубкомиссионерИННРасхождение.КнопкаВыбора = Ложь;
		Элементы.ВыставленныеСчетаФактурыНеплательщиковНДСПокупательИННРасхождение.КнопкаВыбора = Ложь;
		Элементы.НетКнигаПродПокупательИНН.КнопкаВыбора = Ложь;
		Элементы.НетКнигаПродПокупательИННРасхождение.КнопкаВыбора = Ложь;
		Элементы.НетКнигаПродПосредникИНН.КнопкаВыбора = Ложь;
		Элементы.НетКнигаПродПосредникИННРасхождение.КнопкаВыбора = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция НеобходимаУточненнаяДекларация(Объект)
	Возврат Объект.КнигаПокупок.Итог("СуммаНДСРасхождение") <> Объект.КнигаПокупок.Итог("СуммаНДС")
		ИЛИ Объект.КнигаПокупокДл.Итог("СуммаНДСРасхождение") <> Объект.КнигаПокупокДл.Итог("СуммаНДС")
		ИЛИ Объект.КнигаПродаж.Итог("СуммаНДС18Расхождение") <> Объект.КнигаПродаж.Итог("СуммаНДС18")
		ИЛИ Объект.КнигаПродаж.Итог("СуммаНДС10Расхождение") <> Объект.КнигаПродаж.Итог("СуммаНДС10")
		ИЛИ Объект.КнигаПродажДл.Итог("СуммаНДС18Расхождение") <> Объект.КнигаПродажДл.Итог("СуммаНДС18")
		ИЛИ Объект.КнигаПродажДл.Итог("СуммаНДС10Расхождение") <> Объект.КнигаПродажДл.Итог("СуммаНДС10")
		ИЛИ Объект.ВыставленныеСчетаФактурыНеплательщиковНДС.Итог("СуммаНДСРасхождение") <> Объект.ВыставленныеСчетаФактурыНеплательщиковНДС.Итог("СуммаНДС");
КонецФункции

Функция ПерезаполнитьПоТребованиюНаСервере()
	
	ПояснениеОбъект = РеквизитФормыВЗначение("Объект");
	Для Каждого ТабличнаяЧасть ИЗ Метаданные.Документы.ПоясненияКДекларацииПоНДС.ТабличныеЧасти Цикл
		ПояснениеОбъект[ТабличнаяЧасть.Имя].Очистить();
	КонецЦикла;
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ОснованиеСсылка", ПояснениеОбъект.Требование);
	ДанныеЗаполнения.Вставить("ЗаполнитьБезУчетаОтправленныхСтрок", Истина);
	
	ПояснениеОбъект.Заполнить(ДанныеЗаполнения);
	
	ЗначениеВРеквизитФормы(ПояснениеОбъект, "Объект");
	
	ПодготовитьФормуНаСервере();
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПоляПроверкиРасхожденийВыставленныхСчетовФактурНеплательщиковНДС()
	
	ПоляПроверкиРасхождений = Новый Массив();
	
	СвойстваПолей = Новый Структура();
	СвойстваПолей.Вставить("Поле",            "НомерСчетаФактуры");
	СвойстваПолей.Вставить("ПолеРасхождение", "НомерСчетаФактурыРасхождение");
	СвойстваПолей.Вставить("Элементы",        "НомерСчетаФактурыРасхождение");
	
	ПоляПроверкиРасхождений.Добавить(СвойстваПолей);
	
	СвойстваПолей = Новый Структура();
	СвойстваПолей.Вставить("Поле",            "ДатаСчетаФактуры");
	СвойстваПолей.Вставить("ПолеРасхождение", "ДатаСчетаФактурыРасхождение");
	СвойстваПолей.Вставить("Элементы",        "ДатаСчетаФактурыРасхождение");
	
	ПоляПроверкиРасхождений.Добавить(СвойстваПолей);
	
	СвойстваПолей = Новый Структура();
	СвойстваПолей.Вставить("Поле",            "КодВалюты");
	СвойстваПолей.Вставить("ПолеРасхождение", "КодВалютыРасхождение");
	СвойстваПолей.Вставить("Элементы",        "КодВалютыРасхождение");
	
	ПоляПроверкиРасхождений.Добавить(СвойстваПолей);
	
	СвойстваПолей = Новый Структура();
	СвойстваПолей.Вставить("Поле",            "ПокупательИНН");
	СвойстваПолей.Вставить("ПолеРасхождение", "ПокупательИННРасхождение");
	СвойстваПолей.Вставить("Элементы",        "ПокупательИННРасхождение");
		
	ПоляПроверкиРасхождений.Добавить(СвойстваПолей);
	
	СвойстваПолей = Новый Структура();
	СвойстваПолей.Вставить("Поле",            "СтоимостьБезНДС");
	СвойстваПолей.Вставить("ПолеРасхождение", "СтоимостьБезНДСРасхождение");
	СвойстваПолей.Вставить("Элементы",        "СтоимостьБезНДСРасхождение");
		
	ПоляПроверкиРасхождений.Добавить(СвойстваПолей);
	
	СвойстваПолей = Новый Структура();
	СвойстваПолей.Вставить("Поле",            "СуммаНДС");
	СвойстваПолей.Вставить("ПолеРасхождение", "СуммаНДСРасхождение");
	СвойстваПолей.Вставить("Элементы",        "СуммаНДСРасхождение");
	СвойстваПолей.Вставить("Важно",           Истина);
		
	ПоляПроверкиРасхождений.Добавить(СвойстваПолей);
	
	СвойстваПолей = Новый Структура();
	СвойстваПолей.Вставить("Поле",            "Стоимость");
	СвойстваПолей.Вставить("ПолеРасхождение", "СтоимостьРасхождение");
	СвойстваПолей.Вставить("Элементы",        "СтоимостьРасхождение");
	
	ПоляПроверкиРасхождений.Добавить(СвойстваПолей);
	
	Возврат ПоляПроверкиРасхождений;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПоляПроверкиРасхожденийЖурналаУчетаВыставленныхСчетовФактур()
	
	ПоляПроверкиРасхождений = Новый Массив();
	ПоляПроверкиРасхождений.Добавить(
		Новый Структура("Поле, ПолеРасхождение, Элементы", "РеквизитыСчетаФактуры", "РеквизитыСчетаФактурыРасхождение", "РеквизитыСчетаФактурыРасхождение"));
	ПоляПроверкиРасхождений.Добавить(
		Новый Структура("Поле, ПолеРасхождение, Элементы", "ПокупательИННПредставление", "ПокупательИННРасхождениеПредставление", "ПокупательИННРасхождение"));
	ПоляПроверкиРасхождений.Добавить(
		Новый Структура("Поле, ПолеРасхождение, Элементы", "ПосредническаяДеятельностьХэш", "ПосредническаяДеятельностьРасхождениеХэш", "ПосредническаяДеятельностьРасхождениеПредставление"));
	ПоляПроверкиРасхождений.Добавить(
		Новый Структура("Поле, ПолеРасхождение, Элементы", "КодВидаОперации", "КодВидаОперацииРасхождение", "КодВидаОперацииРасхождение"));
	Возврат ПоляПроверкиРасхождений;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПоляПроверкиРасхожденийЖурналаУчетаПолученныхСчетовФактур()
	
	ПоляПроверкиРасхождений = Новый Массив();
	ПоляПроверкиРасхождений.Добавить(
		Новый Структура("Поле, ПолеРасхождение, Элементы", "РеквизитыСчетаФактуры", "РеквизитыСчетаФактурыРасхождение", "РеквизитыСчетаФактурыРасхождение"));
	ПоляПроверкиРасхождений.Добавить(
		Новый Структура("Поле, ПолеРасхождение, Элементы", "КодВидаСделки", "КодВидаСделкиРасхождение", "КодВидаСделкиРасхождение"));
	ПоляПроверкиРасхождений.Добавить(
		Новый Структура("Поле, ПолеРасхождение, Элементы", "КодВалюты", "КодВалютыРасхождение", "КодВалютыРасхождение"));
	ПоляПроверкиРасхождений.Добавить(
		Новый Структура("Поле, ПолеРасхождение, Элементы", "ПродавецИННПредставление", "ПродавецИННРасхождениеПредставление", "ПродавецИННРасхождение"));
	ПоляПроверкиРасхождений.Добавить(
		Новый Структура("Поле, ПолеРасхождение, Элементы", "СубкомиссионерИННПредставление", "СубкомиссионерИННРасхождениеПредставление", "СубкомиссионерИННРасхождение"));
	ПоляПроверкиРасхождений.Добавить(
		Новый Структура("Поле, ПолеРасхождение, Элементы", "Стоимость", "СтоимостьРасхождение", "СтоимостьРасхождение"));
	ПоляПроверкиРасхождений.Добавить(
		Новый Структура("Поле, ПолеРасхождение, Элементы", "СуммаНДС", "СуммаНДСРасхождение", "СуммаНДСРасхождение"));
	ПоляПроверкиРасхождений.Добавить(
		Новый Структура("Поле, ПолеРасхождение, Элементы", "РазницаСтоимостиУвеличение", "РазницаСтоимостиУвеличениеРасхождение", "РазницаСтоимостиУвеличениеРасхождение"));
	ПоляПроверкиРасхождений.Добавить(
		Новый Структура("Поле, ПолеРасхождение, Элементы", "РазницаСуммыНДСУвеличение", "РазницаСуммыНДСУвеличениеРасхождение", "РазницаСуммыНДСУвеличениеРасхождение"));
	ПоляПроверкиРасхождений.Добавить(
		Новый Структура("Поле, ПолеРасхождение, Элементы", "РазницаСтоимостиУменьшение", "РазницаСтоимостиУменьшениеРасхождение", "РазницаСтоимостиУменьшениеРасхождение"));
	ПоляПроверкиРасхождений.Добавить(
		Новый Структура("Поле, ПолеРасхождение, Элементы", "РазницаСуммыНДСУменьшение", "РазницаСуммыНДСУменьшениеРасхождение", "РазницаСуммыНДСУменьшениеРасхождение"));
	ПоляПроверкиРасхождений.Добавить(
		Новый Структура("Поле, ПолеРасхождение, Элементы", "КодВидаОперации", "КодВидаОперацииРасхождение", "КодВидаОперацииРасхождение"));
		
	Возврат ПоляПроверкиРасхождений;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПоляПроверкиРасхожденийКнигиПокупок()
	
	ПоляПроверкиРасхождений = Новый Массив();
	
	ПоляПроверки = Новый Структура();
	ПоляПроверки.Вставить("Поле",            "РеквизитыСчетаФактуры");
	ПоляПроверки.Вставить("ПолеРасхождение", "РеквизитыСчетаФактурыРасхождение");
	ПоляПроверки.Вставить("Элементы",        "РеквизитыСчетаФактурыРасхождение");
	
	ПоляПроверкиРасхождений.Добавить(ПоляПроверки);
	
	ПоляПроверки = Новый Структура();
	ПоляПроверки.Вставить("Поле",            "КодВидаОперации");
	ПоляПроверки.Вставить("ПолеРасхождение", "КодВидаОперацииРасхождение");
	ПоляПроверки.Вставить("Элементы",        "КодВидаОперацииРасхождение");
	
	ПоляПроверкиРасхождений.Добавить(ПоляПроверки);
	
	ПоляПроверки = Новый Структура();
	ПоляПроверки.Вставить("Поле",            "ПродавецПредставление");
	ПоляПроверки.Вставить("ПолеРасхождение", "ПродавецРасхождениеПредставление");
	ПоляПроверки.Вставить("Элементы",        "ПродавецИННРасхождение");

	ПоляПроверкиРасхождений.Добавить(ПоляПроверки);
	
	ПоляПроверки = Новый Структура();
	ПоляПроверки.Вставить("Поле",            "КодВалюты");
	ПоляПроверки.Вставить("ПолеРасхождение", "КодВалютыРасхождение");
	ПоляПроверки.Вставить("Элементы",        "КодВалютыРасхождение");
	
	ПоляПроверкиРасхождений.Добавить(ПоляПроверки);
	
	ПоляПроверки = Новый Структура();
	ПоляПроверки.Вставить("Поле",            "Стоимость");
	ПоляПроверки.Вставить("ПолеРасхождение", "СтоимостьРасхождение");
	ПоляПроверки.Вставить("Элементы",        "СтоимостьРасхождение");
	
	ПоляПроверкиРасхождений.Добавить(ПоляПроверки);
	
	ПоляПроверки = Новый Структура();
	ПоляПроверки.Вставить("Поле",            "СуммаНДС");
	ПоляПроверки.Вставить("ПолеРасхождение", "СуммаНДСРасхождение");
	ПоляПроверки.Вставить("Элементы",        "СуммаНДСРасхождение");
	ПоляПроверки.Вставить("Важно",           Истина);
	
	ПоляПроверкиРасхождений.Добавить(ПоляПроверки);
	
	ПоляПроверки = Новый Структура();
	ПоляПроверки.Вставить("Поле",            "ДатаПринятияНаУчетПредставление");
	ПоляПроверки.Вставить("ПолеРасхождение", "ДатаПринятияНаУчетРасхождениеПредставление");
	ПоляПроверки.Вставить("Элементы",        "ДатаПринятияНаУчетРасхождениеДата");
	
	ПоляПроверкиРасхождений.Добавить(ПоляПроверки);
	
	ПоляПроверки = Новый Структура();
	ПоляПроверки.Вставить("Поле",            "ДокументОплатыПредставление");
	ПоляПроверки.Вставить("ПолеРасхождение", "ДокументОплатыРасхождениеПредставление");
	ПоляПроверки.Вставить("Элементы",        "ДокументОплатыРасхождениеНомер");
	
	ПоляПроверкиРасхождений.Добавить(ПоляПроверки);
	
	ПоляПроверки = Новый Структура();
	ПоляПроверки.Вставить("Поле",            "НомерТаможеннойДекларации");
	ПоляПроверки.Вставить("ПолеРасхождение", "НомерТаможеннойДекларацииРасхождение");
	ПоляПроверки.Вставить("Элементы",        "НомерТаможеннойДекларацииРасхождение");
	
	ПоляПроверкиРасхождений.Добавить(ПоляПроверки);
	
	ПоляПроверки = Новый Структура();
	ПоляПроверки.Вставить("Поле",            "ПосредникИНН");
	ПоляПроверки.Вставить("ПолеРасхождение", "ПосредникИННРасхождение");
	ПоляПроверки.Вставить("Элементы",        "ПосредникИННРасхождение");
	
	ПоляПроверкиРасхождений.Добавить(ПоляПроверки);
	
	Возврат ПоляПроверкиРасхождений;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПоляПроверкиРасхожденийКнигиПродаж()
	
	ПоляПроверкиРасхождений = Новый Массив();
	
	ПоляПроверки = Новый Структура();
	ПоляПроверки.Вставить("Поле",            "РеквизитыСчетаФактуры");
	ПоляПроверки.Вставить("ПолеРасхождение", "РеквизитыСчетаФактурыРасхождение");
	ПоляПроверки.Вставить("Элементы",        "РеквизитыСчетаФактурыРасхождение");
	
	ПоляПроверкиРасхождений.Добавить(ПоляПроверки);
	
	ПоляПроверки = Новый Структура();
	ПоляПроверки.Вставить("Поле",            "КодВидаОперации");
	ПоляПроверки.Вставить("ПолеРасхождение", "КодВидаОперацииРасхождение");
	ПоляПроверки.Вставить("Элементы",        "КодВидаОперацииРасхождение");
	
	ПоляПроверкиРасхождений.Добавить(ПоляПроверки);
	
	ПоляПроверки = Новый Структура();
	ПоляПроверки.Вставить("Поле",            "ПокупательПредставление");
	ПоляПроверки.Вставить("ПолеРасхождение", "ПокупательРасхождениеПредставление");
	ПоляПроверки.Вставить("Элементы",        "ПокупательРасхождениеИНН");
	
	ПоляПроверкиРасхождений.Добавить(ПоляПроверки);
	
	ПоляПроверки = Новый Структура();
	ПоляПроверки.Вставить("Поле",            "КодВалюты");
	ПоляПроверки.Вставить("ПолеРасхождение", "КодВалютыРасхождение");
	ПоляПроверки.Вставить("Элементы",        "КодВалютыРасхождение");
	
	ПоляПроверкиРасхождений.Добавить(ПоляПроверки);
	
	ПоляПроверки = Новый Структура();
	ПоляПроверки.Вставить("Поле",            "Стоимость18");
	ПоляПроверки.Вставить("ПолеРасхождение", "Стоимость18Расхождение");
	ПоляПроверки.Вставить("Элементы",        "Стоимость18Расхождение");
	
	ПоляПроверкиРасхождений.Добавить(ПоляПроверки);
	
	ПоляПроверки = Новый Структура();
	ПоляПроверки.Вставить("Поле",            "Стоимость10");
	ПоляПроверки.Вставить("ПолеРасхождение", "Стоимость10Расхождение");
	ПоляПроверки.Вставить("Элементы",        "Стоимость10Расхождение");
	
	ПоляПроверкиРасхождений.Добавить(ПоляПроверки);
	
	ПоляПроверки = Новый Структура();
	ПоляПроверки.Вставить("Поле",            "Стоимость0");
	ПоляПроверки.Вставить("ПолеРасхождение", "Стоимость0Расхождение");
	ПоляПроверки.Вставить("Элементы",        "Стоимость0Расхождение");
	
	ПоляПроверкиРасхождений.Добавить(ПоляПроверки);
	
	ПоляПроверки = Новый Структура();
	ПоляПроверки.Вставить("Поле",            "СтоимостьОсвобождаемая");
	ПоляПроверки.Вставить("ПолеРасхождение", "СтоимостьОсвобождаемаяРасхождение");
	ПоляПроверки.Вставить("Элементы",        "СтоимостьОсвобождаемаяРасхождение");
	 
	ПоляПроверкиРасхождений.Добавить(ПоляПроверки);
	
	ПоляПроверки = Новый Структура();
	ПоляПроверки.Вставить("Поле",            "СтоимостьВсего");
	ПоляПроверки.Вставить("ПолеРасхождение", "СтоимостьВсегоРасхождение");
	ПоляПроверки.Вставить("Элементы",        "СтоимостьВсегоРасхождение");
	
	ПоляПроверкиРасхождений.Добавить(ПоляПроверки);
	
	ПоляПроверки = Новый Структура();
	ПоляПроверки.Вставить("Поле",            "СуммаНДС18");
	ПоляПроверки.Вставить("ПолеРасхождение", "СуммаНДС18Расхождение");
	ПоляПроверки.Вставить("Элементы",        "СуммаНДС18Расхождение");
	ПоляПроверки.Вставить("Важно",           Истина);
	
	ПоляПроверкиРасхождений.Добавить(ПоляПроверки);
	
	ПоляПроверки = Новый Структура();
	ПоляПроверки.Вставить("Поле",            "СуммаНДС10");
	ПоляПроверки.Вставить("ПолеРасхождение", "СуммаНДС10Расхождение");
	ПоляПроверки.Вставить("Элементы",        "СуммаНДС10Расхождение");
	ПоляПроверки.Вставить("Важно",           Истина);
	 
	ПоляПроверкиРасхождений.Добавить(ПоляПроверки);
	
	ПоляПроверки = Новый Структура();
	ПоляПроверки.Вставить("Поле",            "ДокументОплатыПредставление");
	ПоляПроверки.Вставить("ПолеРасхождение", "ДокументОплатыРасхождениеПредставление");
	ПоляПроверки.Вставить("Элементы",        "ДокументОплатыРасхождениеНомер");
	 
	ПоляПроверкиРасхождений.Добавить(ПоляПроверки);
	
	ПоляПроверки = Новый Структура();
	ПоляПроверки.Вставить("Поле",            "ПосредникИНН");
	ПоляПроверки.Вставить("ПолеРасхождение", "ПосредникИННРасхождение");
	ПоляПроверки.Вставить("Элементы",        "ПосредникИННРасхождение");
	 
	ПоляПроверкиРасхождений.Добавить(ПоляПроверки);
	
	Возврат ПоляПроверкиРасхождений;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПоляПроверкиРасхожденийНетКнигаПрод()
	
	ПоляПроверкиРасхождений = Новый Массив();
	
	ПоляПроверки = Новый Структура();
	ПоляПроверки.Вставить("Поле",            "ДатаСчетаФактуры");
	ПоляПроверки.Вставить("ПолеРасхождение", "ДатаСчетаФактурыРасхождение");
	ПоляПроверки.Вставить("Элементы",        "ДатаСчетаФактурыРасхождение");
	
	ПоляПроверкиРасхождений.Добавить(ПоляПроверки);
	
	ПоляПроверки = Новый Структура();
	ПоляПроверки.Вставить("Поле",            "НомерСчетаФактуры");
	ПоляПроверки.Вставить("ПолеРасхождение", "НомерСчетаФактурыРасхождение");
	ПоляПроверки.Вставить("Элементы",        "НомерСчетаФактурыРасхождение");
	
	ПоляПроверкиРасхождений.Добавить(ПоляПроверки);
	
	ПоляПроверки = Новый Структура();
	ПоляПроверки.Вставить("Поле",            "Раздел");
	ПоляПроверки.Вставить("ПолеРасхождение", "РазделРасхождение");
	ПоляПроверки.Вставить("Элементы",        "РазделРасхождение");
	
	ПоляПроверкиРасхождений.Добавить(ПоляПроверки);	
	
	ПоляПроверки = Новый Структура();
	ПоляПроверки.Вставить("Поле",            "КодВидаОперации");
	ПоляПроверки.Вставить("ПолеРасхождение", "КодВидаОперацииРасхождение");
	ПоляПроверки.Вставить("Элементы",        "КодВидаОперацииРасхождение");
	
	ПоляПроверкиРасхождений.Добавить(ПоляПроверки);
	
	ПоляПроверки = Новый Структура();
	ПоляПроверки.Вставить("Поле",            "ПокупательИННПредставление");
	ПоляПроверки.Вставить("ПолеРасхождение", "ПокупательИННРасхождениеПредставление");
	ПоляПроверки.Вставить("Элементы",        "ПокупательИННРасхождение");
	
	ПоляПроверкиРасхождений.Добавить(ПоляПроверки);
	
	ПоляПроверки = Новый Структура();
	ПоляПроверки.Вставить("Поле",            "ПокупательКПП");
	ПоляПроверки.Вставить("ПолеРасхождение", "ПокупательКППРасхождение");
	ПоляПроверки.Вставить("Элементы",        "ПокупательКППРасхождение");
	
	ПоляПроверкиРасхождений.Добавить(ПоляПроверки);	
	
	ПоляПроверки = Новый Структура();
	ПоляПроверки.Вставить("Поле",            "СтоимостьВсего");
	ПоляПроверки.Вставить("ПолеРасхождение", "СтоимостьВсегоРасхождение");
	ПоляПроверки.Вставить("Элементы",        "СтоимостьВсегоРасхождение");
	
	ПоляПроверкиРасхождений.Добавить(ПоляПроверки);
	
	ПоляПроверки = Новый Структура();
	ПоляПроверки.Вставить("Поле",            "СтоимостьРубВсего");
	ПоляПроверки.Вставить("ПолеРасхождение", "СтоимостьРубВсегоРасхождение");
	ПоляПроверки.Вставить("Элементы",        "СтоимостьРубВсегоРасхождение");
	
	ПоляПроверкиРасхождений.Добавить(ПоляПроверки);
	
	ПоляПроверки = Новый Структура();
	ПоляПроверки.Вставить("Поле",            "ПосредникИННПредставление");
	ПоляПроверки.Вставить("ПолеРасхождение", "ПосредникИННРасхождениеПредставление");
	ПоляПроверки.Вставить("Элементы",        "ПосредникИННРасхождение");
	 
	ПоляПроверкиРасхождений.Добавить(ПоляПроверки);
	
	ПоляПроверки = Новый Структура();
	ПоляПроверки.Вставить("Поле",            "ПосредникКПП");
	ПоляПроверки.Вставить("ПолеРасхождение", "ПосредникКППРасхождение");
	ПоляПроверки.Вставить("Элементы",        "ПосредникКППРасхождение");
	 
	ПоляПроверкиРасхождений.Добавить(ПоляПроверки);
	
	Возврат ПоляПроверкиРасхождений;
КонецФункции

&НаСервере
Процедура ПроверитьЗаполнениеТабличныхЧастейПередОтправкой(Отказ)
	
	Если Объект.КнигаПокупок.Количество() = 0
		И Объект.КнигаПокупокДл.Количество() = 0
		И Объект.КнигаПродаж.Количество() = 0
		И Объект.КнигаПродажДл.Количество() = 0
		И Объект.ЖурналУчетаВыставленныхСчетовФактур.Количество() = 0
		И Объект.ЖурналУчетаПолученныхСчетовФактур.Количество() = 0
		И Объект.СведКС.Количество() = 0
		И Объект.НетКнигаПрод.Количество() = 0
		И НЕ ЗначениеЗаполнено(Объект.ПояснИнОсн) Тогда
		
		ТекстСообщения = НСтр("ru = 'Пояснение не заполнено. Отправка невозможна.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , , "Объект", Отказ);
		
	КонецЕсли;
	
	ПоляДляПроверкиРасхождений = ПоляПроверкиРасхожденийКнигиПокупок();
	ПроверитьСтрокиТабличнойЧасти("КнигаПокупок", "Раздела 8", ПоляДляПроверкиРасхождений, Отказ);
	ПроверитьСтрокиТабличнойЧасти("КнигаПокупокДл", "Раздела 8.1", ПоляДляПроверкиРасхождений, Отказ);
	
	ПоляДляПроверкиРасхождений = ПоляПроверкиРасхожденийКнигиПродаж();
	ПроверитьСтрокиТабличнойЧасти("КнигаПродаж", "Раздела 9", ПоляДляПроверкиРасхождений, Отказ);
	ПроверитьСтрокиТабличнойЧасти("КнигаПродажДл", "Раздела 9.1", ПоляДляПроверкиРасхождений, Отказ);
	
	ПоляДляПроверкиРасхождений = ПоляПроверкиРасхожденийЖурналаУчетаВыставленныхСчетовФактур();
	ПроверитьСтрокиТабличнойЧасти("ЖурналУчетаВыставленныхСчетовФактур", "Раздела 10", ПоляДляПроверкиРасхождений, Отказ);
	
	ПоляДляПроверкиРасхождений = ПоляПроверкиРасхожденийЖурналаУчетаПолученныхСчетовФактур();
	ПроверитьСтрокиТабличнойЧасти("ЖурналУчетаПолученныхСчетовФактур", "Раздела 11", ПоляДляПроверкиРасхождений, Отказ);
	
	ПоляДляПроверкиРасхождений = ПоляПроверкиРасхожденийВыставленныхСчетовФактурНеплательщиковНДС();
	ПроверитьСтрокиТабличнойЧасти("ВыставленныеСчетаФактурыНеплательщиковНДС", "Раздела 12", ПоляДляПроверкиРасхождений, Отказ);
	
	ПоляДляПроверкиРасхождений = ПоляПроверкиРасхожденийНетКнигаПрод();
	ПроверитьСтрокиТабличнойЧасти("НетКнигаПрод", "раздела ""Нет в книге продаж""", ПоляДляПроверкиРасхождений, Отказ);
	
	Если Объект.НетКнигаПрод.Количество() > 0 Тогда
		 ПроверитьНетКнигаПрод(Отказ);
	КонецЕсли;
	
	Если Объект.СведКС.Количество() > 0 Тогда
		ПроверитьКонтрольныеСоотношения(Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНетКнигаПрод(Отказ)
	
	Для Каждого СтрокаТабличнойЧасти Из Объект.НетКнигаПрод Цикл
		
		ПроверитьИНН(СтрокаТабличнойЧасти, "ПокупательИНН", НСтр("ru = 'ИНН покупателя (по данным ФНС)'"), Отказ);
		ПроверитьКПП(СтрокаТабличнойЧасти, "ПокупательКПП", НСтр("ru = 'КПП покупателя (по данным ФНС)'"), Отказ);
		
		Если СтрокаТабличнойЧасти.РезультатПроверки = Перечисления.РезультатПроверкиСтрокиДекларации.ВыявленыРасхождения Тогда
			
			ПроверитьИНН(СтрокаТабличнойЧасти, "ПокупательИННРасхождение", НСтр("ru = 'ИНН покупателя (уточненные данные)'"), Отказ);
			ПроверитьКПП(СтрокаТабличнойЧасти, "ПокупательКППРасхождение", НСтр("ru = 'КПП покупателя (уточненные данные)'"), Отказ);
			
			ПроверитьИНН(СтрокаТабличнойЧасти, "ПосредникИНН", НСтр("ru = 'ИНН посредника (по данным ФНС)'"), Отказ);
			ПроверитьКПП(СтрокаТабличнойЧасти, "ПосредникКПП", НСтр("ru = 'КПП посредника (по данным ФНС)'"), Отказ);
			
			ПроверитьИНН(СтрокаТабличнойЧасти, "ПосредникИННРасхождение", НСтр("ru = 'ИНН посредника (уточненные данные)'"), Отказ);
			ПроверитьКПП(СтрокаТабличнойЧасти, "ПосредникКППРасхождение", НСтр("ru = 'КПП посредника (уточненные данные)'"), Отказ);
		
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьИНН(СтрокаТабличнойЧасти, ИмяПоля, НаименованиеПоля, Отказ)
	
	ИНН = СтрокаТабличнойЧасти[ИмяПоля];
	Если ЗначениеЗаполнено(ИНН) Тогда
		
		ЭтоЮридическоеЛицо = СтрДлина(ИНН) <> 12;
		
		ТекстОшибки = "";
		ЕстьОшибка = НЕ РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(ИНН, ЭтоЮридическоеЛицо, ТекстОшибки);
		
		Если ЕстьОшибка Тогда
			
			ТекстСообщения = НСтр("ru = 'В строке %1 раздела ""Нет в книге продаж"" %2 заполнен некорректно:'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаТабличнойЧасти.НомерСтроки, НаименованиеПоля);
			ТекстСообщения = ТекстСообщения + Символы.ПС + ТекстОшибки;
		
			КлючДанных = "НетКнигаПрод[%1]." + ИмяПоля;
			КлючДанных = СтрШаблон(КлючДанных, Формат(СтрокаТабличнойЧасти.НомерСтроки - 1, "ЧГ=0"));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , КлючДанных, "Объект", Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьКПП(СтрокаТабличнойЧасти, ИмяПоляКПП, НаименованиеПоляКПП, Отказ)
	
	ИмяПоляИНН = ИменаРеквизитов(ИмяПоляКПП).ИмяРеквизитаИНН;
	
	ИНН = СтрокаТабличнойЧасти[ИмяПоляИНН];
	КПП = СтрокаТабличнойЧасти[ИмяПоляКПП];
	
	Если ЗначениеЗаполнено(ИНН) Тогда
		
		ЭтоЮридическоеЛицо = СтрДлина(ИНН) <> 12;
		
		Если НЕ ЭтоЮридическоеЛицо И ЗначениеЗаполнено(КПП) Тогда
			
			ТекстСообщения = НСтр("ru = 'В строке %1 раздела ""Нет в книге продаж"" обнаружена ошибка: у ИП не может быть заполнен КПП'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаТабличнойЧасти.НомерСтроки);
			
			КлючДанных = "НетКнигаПрод[%1]." + ИмяПоляКПП;
			КлючДанных = СтрШаблон(КлючДанных, Формат(СтрокаТабличнойЧасти.НомерСтроки - 1, "ЧГ=0"));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , КлючДанных, "Объект", Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КПП) Тогда
		
		ТекстОшибки = "";
		ЕстьОшибка = НЕ РегламентированныеДанныеКлиентСервер.КППСоответствуетТребованиям(КПП, ТекстОшибки);
		
		Если ЕстьОшибка Тогда
			
			ТекстСообщения = НСтр("ru = 'В строке %1 раздела ""Нет в книге продаж"" %2 заполнено некорректно:'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаТабличнойЧасти.НомерСтроки, НаименованиеПоляКПП);
			ТекстСообщения = ТекстСообщения + Символы.ПС + ТекстОшибки;
		
			КлючДанных = "НетКнигаПрод[%1]." + ИмяПоляКПП;
			КлючДанных = СтрШаблон(КлючДанных, Формат(СтрокаТабличнойЧасти.НомерСтроки - 1, "ЧГ=0"));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , КлючДанных, "Объект", Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьСтрокиТабличнойЧасти(ИмяТабличнойЧасти, ПредставлениеТабличнойЧасти, ПоляДляПроверкиРасхождений, Отказ)
	
	Для Каждого СтрокаТабличнойЧасти Из Объект[ИмяТабличнойЧасти] Цикл
		Если СтрокаТабличнойЧасти.РезультатПроверки = Перечисления.РезультатПроверкиСтрокиДекларации.ВыявленыРасхождения Тогда
			
			РасхожденийНеНайдено = Истина;
			Для Каждого Поле Из ПоляДляПроверкиРасхождений Цикл
				Если СтрокаТабличнойЧасти[Поле.Поле] <> СтрокаТабличнойЧасти[Поле.ПолеРасхождение] Тогда
					РасхожденийНеНайдено = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если РасхожденийНеНайдено Тогда
				ТекстСообщения = НСтр("ru = 'В строке %1 %2 указан ответ ""Найдены расхождения"", но уточненные сведения соответствуют данным ФНС'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, СтрокаТабличнойЧасти.НомерСтроки, ПредставлениеТабличнойЧасти);
				
				КлючДанных = ИмяТабличнойЧасти + "[%1].РезультатПроверки";
				КлючДанных = СтрШаблон(КлючДанных, Формат(СтрокаТабличнойЧасти.НомерСтроки - 1, "ЧГ=0"));
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , КлючДанных, "Объект", Отказ);
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьКонтрольныеСоотношения(Отказ)
	
	ЗаменяемыеСимволы 	= "0123456789";
	СимволыЗамены 		= "XXXXXXXXXX";
	
	Для Каждого СтрокаТабличнойЧасти Из Объект.СведКС Цикл 
		
		НомерКС 	= СтрокаТабличнойЧасти.НомКС;
		ПоясненКС 	= СтрокаТабличнойЧасти.ПоясненКС;
		
		НомерКСПослеЗамены = СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими(
			ЗаменяемыеСимволы, 
			НомерКС, 
			СимволыЗамены);
			
		ЕстьОшибка = Ложь;
		
		Если НЕ ЗначениеЗаполнено(НомерКС) Тогда
			
			ЕстьОшибка = Истина;
			
			ТекстСообщения = НСтр("ru = 'В строке %1 раздела ""Контрольные соотношения"" не заполнен номер контрольного соотношения'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаТабличнойЧасти.НомерСтроки);
			
			КлючДанных = "СведКС[%1].НомКС";
			
		ИначеЕсли НЕ ЗначениеЗаполнено(ПоясненКС) Тогда
			
			ЕстьОшибка = Истина;
			
			ТекстСообщения = НСтр("ru = 'В строке %1 раздела ""Контрольные соотношения"" не заполнено пояснение расхождений'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаТабличнойЧасти.НомерСтроки);
			
			КлючДанных = "СведКС[%1].ПоясненКС";
			
		ИначеЕсли НомерКСПослеЗамены <> "X.X" 
			И НомерКСПослеЗамены <> "X.XX"
			И НомерКСПослеЗамены <> "X.X.X"
			И НомерКСПослеЗамены <> "X.XX.X" Тогда
			
			ЕстьОшибка = Истина;
			
			ТекстСообщения = НСтр("ru = 'В строке %1 раздела ""Контрольные соотношения"" номер контрольного соотношения
				|не соответствует ни одному из шаблонов X.X, X.XX, X.X.X, X.XX.X'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаТабличнойЧасти.НомерСтроки);
			
			КлючДанных = "СведКС[%1].НомКС";
			
		КонецЕсли;
		
		Если ЕстьОшибка Тогда
			
			КлючДанных = СтрШаблон(КлючДанных, Формат(СтрокаТабличнойЧасти.НомерСтроки - 1, "ЧГ=0"));
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , КлючДанных, "Объект", Отказ);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
&НаСервере
Функция ИдДекларации(АдресДанных, ВыбранноеИмяФайла)
	
	ТекстСообщения = "";
	КонтекстЭДОСервер = ДокументооборотСКОВызовСервера.ПолучитьОбработкуЭДО(ТекстСообщения);
	Если КонтекстЭДОСервер = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Неопределено;
	КонецЕсли;
	
	СвойстваФайла 	= ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ВыбранноеИмяФайла);

	Если КонтекстЭДОСервер.ЭтоФайлВыгрузкиДекларацияНДС(СвойстваФайла.Имя) Тогда
		
		Если НРег(СвойстваФайла.Расширение) = НРег(".xml") Тогда
			
			Если НЕ ЭтоАдресВременногоХранилища(АдресДанных) Тогда 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось открыть файл");
				Возврат Неопределено;
			КонецЕсли;
			
			ПолноеИмяФайла = КаталогВременныхФайлов() + СвойстваФайла.Имя;
			ПолучитьИзВременногоХранилища(АдресДанных).Записать(ПолноеИмяФайла);
			
			// считываем показатели файла
			ОбъектЧтениеXML = Новый ЧтениеXML;
			Попытка
				ОбъектЧтениеXML.ОткрытьФайл(ПолноеИмяФайла);
				ОбъектЧтениеXML.ИгнорироватьПробелы = Ложь;
				ПоказателиВыгрузки = Новый Соответствие;
				Пока ОбъектЧтениеXML.Прочитать() Цикл
					Если ОбъектЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ОбъектЧтениеXML.Имя <> "СодПерСвед" Тогда
						Пока ОбъектЧтениеXML.ПрочитатьАтрибут() Цикл
							Если ПоказателиВыгрузки[ОбъектЧтениеXML.Имя] = Неопределено Тогда
								ПоказателиВыгрузки.Вставить(ОбъектЧтениеXML.Имя, ОбъектЧтениеXML.Значение);
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
				ОбъектЧтениеXML.Закрыть();
			Исключение
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Файл ""%1"" не является файлом выгрузки декларации по НДС в формате XML.'"), СвойстваФайла.Имя);
						 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Возврат Неопределено;
			КонецПопытки;
			
			// определение вида отчета
			КНД = ПоказателиВыгрузки["КНД"];
			Если КНД = Неопределено ИЛИ КНД = "" ИЛИ КНД <> "1151001" Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Выбранный файл не является файлом декларации по НДС'"));
				Возврат Неопределено;
			КонецЕсли;
			
			Если НЕ ДокументооборотСКОВызовСервера.ИспользуетсяРежимТестирования() Тогда
				
				// определение организации
				Если ПоказателиВыгрузки["ИННФЛ"] <> Неопределено Тогда
					ИНН = ПоказателиВыгрузки["ИННФЛ"];
					КПП = "";
				Иначе
					ИНН = ?(ПоказателиВыгрузки["ИННЮЛ"] = Неопределено, "", ПоказателиВыгрузки["ИННЮЛ"]);
					КПП = ?(ПоказателиВыгрузки["КПП"] = Неопределено, "", ПоказателиВыгрузки["КПП"]);
				КонецЕсли;
				
				ОрганизацияВФайле = КонтекстЭДОСервер.ОпределитьОрганизациюПоИННиКПП(ИНН, КПП);
				Если ОрганизацияВФайле <> Объект.Организация Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Организация в выбранном файле декларации по НДС не совпадает с организацией, указанной в требовании'"));
					Возврат Неопределено;
				КонецЕсли;
				
				// Если в требовании нет XML-файла, то мы не можем определить и проверить НомКорр, Период и ОтчетГод.
				Если ВТребованииЕстьXMLФайл Тогда
					СвойстваДекларации = КонтекстЭДОСервер.СвойстваДекларацииИзФайлаТребованияОПредставленииПоясненийКДекларацииНДС(Объект.Требование);
					
					НомКорр = ПоказателиВыгрузки["НомКорр"];
					Если НомКорр <> СвойстваДекларации.ТребованиеНомКорр Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Номер корректировки в выбранном файле декларации по НДС не совпадает с номером корректировки, указанном в требовании'"));
						Возврат Неопределено;
					КонецЕсли;
					
					Период = ПоказателиВыгрузки["Период"];
					Если Период <> СвойстваДекларации.ТребованиеПериод Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Период в выбранном файле декларации по НДС не совпадает с периодом, указанном в требовании'"));
						Возврат Неопределено;
					КонецЕсли;
					
					ОтчетГод = ПоказателиВыгрузки["ОтчетГод"];
					Если ОтчетГод <> СвойстваДекларации.ТребованиеОтчетГод Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Год в выбранном файле декларации по НДС не совпадает с годом, указанном в требовании'"));
						Возврат Неопределено;
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
			
			Возврат ПоказателиВыгрузки["ИдФайл"]; 
			
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Файл декларации по НДС должен иметь расширение xml'"));
			Возврат Неопределено;
		КонецЕсли;
		
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Выбранный файл не является файлом декларации по НДС'"));
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииОтправки

 &НаСервереБезКонтекста
Функция ПредставлениеДокументаРеглОтч(Декларация)
	Возврат РегламентированнаяОтчетностьКлиентСервер.ПредставлениеДокументаРеглОтч(Декларация); 
КонецФункции

&НаКлиенте
Процедура ПослеВыбораДекларацииИзБазы(ВыбраннаяДекларация, ВходящийКонтекст) Экспорт
	
	Если ЗначениеЗаполнено(ВыбраннаяДекларация) Тогда
		Объект.Декларация 	= ВыбраннаяДекларация;
		Модифицированность 	= Истина;
		УправлениеДекларацией(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьДекларациюИзБазы()

	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Организация", Объект.Организация);
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ПослеВыбораДекларацииИзБазы", 
		ЭтотОбъект); 
	
	ОткрытьФорму(КонтекстЭДОКлиент.ПутьКОбъекту + ".Форма.ФормаВыбораДекларацииПоНДС",
		ДополнительныеПараметры,
		ЭтотОбъект,,,,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры
	
&НаКлиенте
Процедура ПриОткрытииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	КонтекстЭДОКлиент = Результат.КонтекстЭДО;
	Если КонтекстЭДОКлиент = Неопределено Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПрорисоватьСтатус(Форма)
	
	ПараметрыПрорисовкиПанелиОтправки = ДокументооборотСКОВызовСервера.ПараметрыПрорисовкиПанелиОтправки(Форма.Объект.Ссылка);
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ПрименитьПараметрыПрорисовкиПанелиОтправки(Форма, ПараметрыПрорисовкиПанелиОтправки);
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтправкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ПрорисоватьСтатус(ЭтотОбъект);
	
	Прочитать();
	
КонецПроцедуры

&НаСервере
Процедура ПослеИзмененияТребования()
	
	Заголовок = Документы.ПоясненияКДекларацииПоНДС.НаименованиеОтветаПоТребованию(Объект.Требование);
	
КонецПроцедуры

&НаСервере
Процедура СкрытьНезаполненныеКолонкиПериодОтраженияЗаписи()
	
	ИменаТаблиц = Новый Массив;
	ИменаТаблиц.Добавить("КнигаПокупок");
	ИменаТаблиц.Добавить("КнигаПокупокДл");
	ИменаТаблиц.Добавить("КнигаПродаж");
	ИменаТаблиц.Добавить("КнигаПродажДл");
	ИменаТаблиц.Добавить("ЖурналУчетаВыставленныхСчетовФактур");
	ИменаТаблиц.Добавить("ЖурналУчетаПолученныхСчетовФактур");
	ИменаТаблиц.Добавить("ВыставленныеСчетаФактурыНеплательщиковНДС");
	
	Для Каждого ИмяТаблицы Из ИменаТаблиц Цикл
		КолонкаЗаполнена = Ложь;
		Для Каждого СтрокаТаблицы Из Объект[ИмяТаблицы] Цикл
			Если ЗначениеЗаполнено(СтрокаТаблицы.ПериодОтраженияЗаписиПредставление) Тогда
				КолонкаЗаполнена = Истина;
			КонецЕсли;
		КонецЦикла;
		Элементы[ИмяТаблицы + "ПериодОтраженияЗаписиПредставление"].Видимость = КолонкаЗаполнена;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПанельОтправкиВКонтролирующиеОрганы

&НаКлиенте
Процедура ОбновитьОтправку(Команда)
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОбновитьОтправкуИзПанелиОтправки(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаПротоколНажатие(Элемент)
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьПротоколИзПанелиОтправки(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНеотправленноеИзвещение(Команда)
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОтправитьНеотправленноеИзвещениеИзПанелиОтправки(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыОтправкиНажатие(Элемент)
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьСостояниеОтправкиИзПанелиОтправки(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура КритическиеОшибкиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылка, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьКритическиеОшибкиИзПанелиОтправки(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура НетКнигаПродПокупательПриИзмененииКонтрагента(Элемент)
	
	ИмяЭлемента 	= Элемент.Имя; 
	ИмяРеквизита  	= СтрЗаменить(ИмяЭлемента, "НетКнигаПрод", "");
	
	ИмяРеквизитаИНН = ИменаРеквизитов(ИмяРеквизита).ИмяРеквизитаИНН;
	ИмяРеквизитаКПП = ИменаРеквизитов(ИмяРеквизита).ИмяРеквизитаКПП;
	
	ДанныеСтроки = Элементы.НетКнигаПрод.ТекущиеДанные;
	
	Сведения = СведенияОКонтрагентеПоИНН(ДанныеСтроки[ИмяРеквизитаИНН], ДанныеСтроки[ИмяРеквизитаКПП]);
	
	ОтработатьВыборКонтрагентаВНетКнигаПрод(ДанныеСтроки, Сведения, ИмяРеквизита);
	
КонецПроцедуры

&НаКлиенте
Процедура НетКнигаПродПокупательНачалоВыбораКонтрагента(СтандартнаяОбработка, Элемент)
	
	ИмяЭлемента 	= Элемент.Имя; 
	ИмяРеквизита  	= СтрЗаменить(ИмяЭлемента, "НетКнигаПрод", "");
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.НетКнигаПрод.ТекущиеДанные;
	
	ВыбратьКонтрагента("НетКнигаПрод", ДанныеСтроки, ИмяРеквизита, Ложь);
	
КонецПроцедуры

#КонецОбласти