
&НаКлиенте
Процедура ЗаполнитьРеквизитыДоговра(Команда)
	ЗаполнитьРеквизитыДоговора()
КонецПроцедуры



&НаСервере
Процедура ЗаполнитьРеквизитыДоговора()
Перем ДолжностьРодПадеж, РуководительРодПадеж;	
	
Запрос = Новый Запрос;
Запрос.Текст =  "ВЫБРАТЬ
                |	бизУченическийДоговор.Ссылка КАК УченическийДоговор,
                |	ОрганизацииКонтактнаяИнформацияПолноеНаименование.Представление КАК ОрганизацияПолное,
                |	ОтветственныеЛицаСрезПоследних.Должность КАК ОрганизацияДолжность,
                |	ОтветственныеЛицаСрезПоследних.Сотрудник КАК ОрганизацияРуководитель,
                |	ВЫБОР
                |		КОГДА бизУченическийДоговор.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
                |			ТОГДА ""Устава""
                |		ИНАЧЕ """"
                |	КОНЕЦ КАК ДействующегоНаОрганизация,
                |	ОрганизацииКонтактнаяИнформацияЮрАдресГород.Город КАК ОрганизацияГород
                |ИЗ
                |	Документ.бизУченическийДоговор КАК бизУченическийДоговор
                |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформацияПолноеНаименование
                |		ПО бизУченическийДоговор.Организация = ОрганизацииКонтактнаяИнформацияПолноеНаименование.Ссылка
                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛица.СрезПоследних КАК ОтветственныеЛицаСрезПоследних
                |		ПО бизУченическийДоговор.Организация = ОтветственныеЛицаСрезПоследних.Организация,
                |	Справочник.КонтактныеЛица.РолиКонтактногоЛица КАК КонтактныеЛицаРолиКонтактногоЛица,
                |	Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформацияЮрАдресГород
                |ГДЕ
                |	бизУченическийДоговор.Ссылка = &Ссылка
                |	И ОрганизацииКонтактнаяИнформацияПолноеНаименование.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Другое)
                |	И ОтветственныеЛицаСрезПоследних.ТипОтветственногоЛица = ЗНАЧЕНИЕ(Перечисление.ТипыОтветственныхЛиц.Руководитель)
                |	И ОрганизацииКонтактнаяИнформацияЮрАдресГород.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
                |	И ОрганизацииКонтактнаяИнформацияЮрАдресГород.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации)";

Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);

Выборка = Запрос.Выполнить().Выбрать();

Если Выборка.Следующий() Тогда
	
	МассивСлов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(СокрЛП(Выборка.ОрганизацияГород)," ");
	Объект.МестоРегистрацииДоговора ="г. " + МассивСлов[0];
	Объект.ОрганизацияПолное = Выборка.ОрганизацияПолное;
	Объект.ДействующегоНаОрганизация = Выборка.ДействующегоНаОрганизация;
	Объект.ОрганизацияВлице = бизЗаполнениеДокументов.ПросклонятьФразуПоСловам("" + Выборка.ОрганизацияДолжность+" "+Выборка.ОрганизацияРуководитель, 2);
	
	Если НЕ ЗначениеЗаполнено(Объект.СрокДействияДоговора) Тогда
		Объект.СрокДействияДоговора = 10;
		Объект.ДатаОкончанияДоговора = ДобавитьМесяц(Объект.Дата,Объект.СрокДействияДоговора);	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ОбязательствоОтработать) Тогда
	    Объект.ОбязательствоОтработать = 36;
	КонецЕсли;
	
КонецЕсли; 


КонецПроцедуры // ЗаполнитьРеквизитыДоговораИТС()

&НаКлиенте
Процедура СрокДействияПриИзменении(Элемент)
	Объект.ДатаОкончанияДоговора = ДобавитьМесяц(Объект.Дата,Объект.СрокДействияДоговора);
КонецПроцедуры

&НаКлиенте
Процедура КвалификационныеИспытанияВидИспытанияПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.КвалификационныеИспытания.ТекущиеДанные;
	ТекущаяСтрока.КоличествоЧасов = КвалификационныеИспытанияВидИспытанияПриИзмененииНаСервере(Элемент.ТекстРедактирования);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КвалификационныеИспытанияВидИспытанияПриИзмененииНаСервере(НаименованиеВладельца)
	Владелец = Справочники.бизКвалификационныеИспытания.НайтиПоНаименованию(НаименованиеВладельца);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	бизТиповыеУчебныеПрограммы.Ссылка КАК Ссылка,
	               |	бизТиповыеУчебныеПрограммы.ЧасовНаПодготовку КАК ЧасовНаПодготовку
	               |ИЗ
	               |	Справочник.бизТиповыеУчебныеПрограммы КАК бизТиповыеУчебныеПрограммы
	               |ГДЕ
	               |	бизТиповыеУчебныеПрограммы.Владелец = &Владелец
	               |	И бизТиповыеУчебныеПрограммы.ЭтоРодитель = ЛОЖЬ
	               |ИТОГИ
	               |	СУММА(ЧасовНаПодготовку)
	               |ПО
	               |	ОБЩИЕ,
	               |	Ссылка ТОЛЬКО ИЕРАРХИЯ";
	Запрос.УстановитьПараметр("Владелец",Владелец);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий() Цикл
		   ИтогоЧасовНаПодготовку = Выборка.ЧасовНаПодготовку;
	КонецЦикла;	
	Возврат ИтогоЧасовНаПодготовку;
КонецФункции


			
			