
//Рассчитывает сумму и процент ручной скидки (без учета автоматической скидки) для документа
//Процент скидки может быть разным для разных строк, тогда общий процент ручной скидки рассчитывается от суммы документа
Процедура РассчитатьСуммуИПроцентСкидки(Форма, ИмяТабличнойЧасти = "Запасы") Экспорт
	
	ОбщаяСуммаРучнойСкидки	= 0;
	ОбщаяСуммаБезСкидок		= 0;
	Для каждого стр Из Форма.Объект[ИмяТабличнойЧасти] Цикл
		
		ОбщаяСуммаБезСкидок = ОбщаяСуммаБезСкидок + стр.Цена * стр.Количество;
		Если стр.ПроцентСкидкиНаценки = 0 Тогда
			Продолжить;
		ИначеЕсли стр.Свойство("СуммаАвтоматическойСкидки") Тогда
			ОбщаяСуммаРучнойСкидки = ОбщаяСуммаРучнойСкидки + стр.Цена * стр.Количество - стр.Сумма - стр.СуммаАвтоматическойСкидки;
		Иначе
			ОбщаяСуммаРучнойСкидки = ОбщаяСуммаРучнойСкидки + стр.Цена * стр.Количество - стр.Сумма;
		КонецЕсли; 
		
	КонецЦикла;
	
	Форма.СкидкаСумма = ОбщаяСуммаРучнойСкидки;
	Форма.СкидкаПроцент = ?(ОбщаяСуммаБезСкидок=0, 0, Форма.СкидкаСумма / ОбщаяСуммаБезСкидок * 100);
	
КонецПроцедуры
