#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ВидыУведомленийДляИП() Экспорт 
	Результат = Новый Массив;
	
	Результат.Добавить(Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.УведомлениеОбИзмененииОбъектаНалогообложенияПоУСН);
	Результат.Добавить(Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.УведомлениеОбОтказеОтУСН);
	Результат.Добавить(Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.УведомлениеОбУтратеПраваНаУСН);
	Результат.Добавить(Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.УведомлениеОПереходеНаУСН);
	Результат.Добавить(Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.УведомлениеОПрекращенииДеятельностиПоУСН);
	
	Результат.Добавить(Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ЗаявлениеНаПолучениеПатента);
	Результат.Добавить(Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ЗаявлениеНаПолучениеПатентаРекомендованнаяФорма);
	Результат.Добавить(Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ЗаявлениеОбУтратеПраваНаПатент);
	Результат.Добавить(Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ЗаявлениеОПрекращенииДеятельностиПоПатентнойСистеме);
	
	Результат.Добавить(Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаЕНВД2);
	Результат.Добавить(Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаЕНВД4);
	
	Результат.Добавить(Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаС09_1);
	Результат.Добавить(Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаС09_2);
	Результат.Добавить(Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаС09_6);
	
	Результат.Добавить(Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаУ_ИО);
	Результат.Добавить(Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаТС1);
	Результат.Добавить(Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаТС2);
	Результат.Добавить(Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ЗаявлениеИсключенииПроверки);
	Результат.Добавить(Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ЗаявлениеПостановкаОбъектаНВОС);
	
	Результат.Добавить(Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаР21001);
	Результат.Добавить(Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаР24001);
	Возврат Результат;
КонецФункции

Функция ВидыУведомленийДляОрганизации() Экспорт 
	Результат = Новый Массив;
	
	Результат.Добавить(Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.УведомлениеОбИзмененииОбъектаНалогообложенияПоУСН);
	Результат.Добавить(Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.УведомлениеОбОтказеОтУСН);
	Результат.Добавить(Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.УведомлениеОбУтратеПраваНаУСН);
	Результат.Добавить(Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.УведомлениеОПереходеНаУСН);
	Результат.Добавить(Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.УведомлениеОПрекращенииДеятельностиПоУСН);
	
	Результат.Добавить(Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаЕНВД1);
	Результат.Добавить(Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаЕНВД3);
	
	Результат.Добавить(Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.Форма_1_6_Учет);
	Результат.Добавить(Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаС09_1);
	Результат.Добавить(Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаС09_2);
	Результат.Добавить(Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаС09_3_1);
	Результат.Добавить(Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаС09_3_2);
	Результат.Добавить(Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаС09_4);
	Результат.Добавить(Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаС09_6);
	
	Результат.Добавить(Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаУ_ИО);
	Результат.Добавить(Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаТС1);
	Результат.Добавить(Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаТС2);
	Результат.Добавить(Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ЗаявлениеИсключенииПроверки);
	Результат.Добавить(Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ЗаявлениеПостановкаОбъектаНВОС);
	
	Результат.Добавить(Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаР11001);
	Возврат Результат;
КонецФункции

Функция ПолучитьИмяОтчетаПоВидуУведомления(Вид) Экспорт 
	Если Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ЗаявлениеНаПолучениеПатентаРекомендованнаяФорма Тогда 
		Возврат "РегламентированноеУведомлениеПолучениеПатента";
	ИначеЕсли Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаТС2 Тогда 
		Возврат "РегламентированноеУведомлениеТС2";
	ИначеЕсли Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаТС1 Тогда 
		Возврат "РегламентированноеУведомлениеТС1";
	ИначеЕсли Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаУ_ИО Тогда 
		Возврат "РегламентированноеУведомлениеУ_ИО";
	ИначеЕсли Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ЗаявлениеОбУтратеПраваНаПатент Тогда 
		Возврат "РегламентированноеУведомлениеУтратаПраваПатент";
	ИначеЕсли Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ЗаявлениеОПрекращенииДеятельностиПоПатентнойСистеме Тогда 
		Возврат "РегламентированноеУведомлениеПрекращениеПатент";
	ИначеЕсли Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаС09_3_1 Тогда 
		Возврат "РегламентированноеУведомлениеСозданиеОбособленныхПодразделений";
	ИначеЕсли Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаС09_3_2 Тогда 
		Возврат "РегламентированноеУведомлениеЗакрытиеОбособленныхПодразделений";
	ИначеЕсли Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.Форма_1_6_Учет Тогда 
		Возврат "РегламентированноеУведомлениеВыборНалоговогоОргана";
	ИначеЕсли Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаС09_4 Тогда 
		Возврат "РегламентированноеУведомлениеРеорганизацияЛиквидация";
	ИначеЕсли Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаС09_2 Тогда 
		Возврат "РегламентированноеУведомлениеСообщениеОбУчастии";
	ИначеЕсли Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаЕНВД1 Тогда 
		Возврат "РегламентированноеУведомлениеЕНВД1";
	ИначеЕсли Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаЕНВД2 Тогда 
		Возврат "РегламентированноеУведомлениеЕНВД2";
	ИначеЕсли Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаЕНВД3 Тогда 
		Возврат "РегламентированноеУведомлениеЕНВД3";
	ИначеЕсли Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаЕНВД4 Тогда 
		Возврат "РегламентированноеУведомлениеЕНВД4";
	ИначеЕсли Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.УведомлениеОбИзмененииОбъектаНалогообложенияПоУСН Тогда 
		Возврат "РегламентированноеУведомлениеИзменениеПараметраУСН";
	ИначеЕсли Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.УведомлениеОбОтказеОтУСН Тогда 
		Возврат "РегламентированноеУведомлениеОтказОтУСН";
	ИначеЕсли Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.УведомлениеОПрекращенииДеятельностиПоУСН Тогда 
		Возврат "РегламентированноеУведомлениеПрекращениеУСН";
	ИначеЕсли Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.УведомлениеОПереходеНаУСН Тогда 
		Возврат "РегламентированноеУведомлениеПереходНаУСН";
	ИначеЕсли Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.УведомлениеОбУтратеПраваНаУСН Тогда 
		Возврат "РегламентированноеУведомлениеУтратаПраваУСН";
	ИначеЕсли Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаС09_6 Тогда 
		Возврат "РегламентированноеУведомлениеУчастиеВРоссийскихОрганизациях";
	ИначеЕсли Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ЗаявлениеИсключенииПроверки Тогда 
		Возврат "РегламентированноеУведомлениеИсключениеПроверки";
	ИначеЕсли Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ЗаявлениеПостановкаОбъектаНВОС Тогда 
		Возврат "РегламентированноеУведомлениеПостановкаОбъектаНВОС";
	ИначеЕсли Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаР21001 Тогда 
		Возврат "РегламентированноеУведомлениеФормаР21001";
	ИначеЕсли Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаР24001 Тогда 
		Возврат "РегламентированноеУведомлениеФормаР24001";
	ИначеЕсли Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаР11001 Тогда 
		Возврат "РегламентированноеУведомлениеФормаР11001";
	КонецЕсли;
	
	Возврат "";
КонецФункции

Функция ЭтоУведомлениеВФНС(Вид) Экспорт
	Если Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ЗаявлениеНаПолучениеПатентаРекомендованнаяФорма
		Или Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ЗаявлениеОбУтратеПраваНаПатент
		Или Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ЗаявлениеНаПолучениеПатента
		Или Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ЗаявлениеОПрекращенииДеятельностиПоПатентнойСистеме
		Или Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаТС2
		Или Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаТС1
		Или Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаУ_ИО
		Или Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаС09_1
		Или Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаС09_2
		Или Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаС09_3_1
		Или Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаС09_3_2
		Или Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаС09_4
		Или Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаС09_6
		Или Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.Форма_1_6_Учет
		Или Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаЕНВД1
		Или Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаЕНВД2
		Или Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаЕНВД3
		Или Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаЕНВД4
		Или Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.УведомлениеОбИзмененииОбъектаНалогообложенияПоУСН
		Или Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.УведомлениеОбОтказеОтУСН
		Или Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.УведомлениеОПрекращенииДеятельностиПоУСН
		Или Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.УведомлениеОПереходеНаУСН
		Или Вид = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.УведомлениеОбУтратеПраваНаУСН Тогда 
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции
#КонецЕсли
