
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ВидыРесурсовПредприятия" Тогда
		
		ОбновитьСписокРесурсов();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокВидовРесурсовПриАктивизацииСтроки(Элемент)
	
	ОбновитьСписокРесурсов();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьСписокРесурсов()
	
	ТекСтрока = Элементы.СписокВидовРесурсов.ТекущиеДанные;
	
	Если ТекСтрока <> Неопределено Тогда
		СписокРесурсов.Параметры.УстановитьЗначениеПараметра("ТекущийВидРесурса", ТекСтрока.Ссылка);
	Иначе
		СписокРесурсов.Параметры.УстановитьЗначениеПараметра("ТекущийВидРесурса", ПредопределенноеЗначение("Справочник.ВидыРесурсовПредприятия.ВсеРесурсы"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

