
#Область ОбработчикиСобытийФормы

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("Владелец") Тогда
		Если ЗначениеЗаполнено(Параметры.Отбор.Владелец) Тогда // Колонка "Вид дисконтной карты" выводить не нужно.
			ТекВидКарты = Параметры.Отбор.Владелец;
			
			Элементы.Владелец.Видимость = Ложь;
			Элементы.КодКартыМагнитный.Видимость = ТекВидКарты.ТипКарты = Перечисления.ТипыКарт.Магнитная
							Или ТекВидКарты.ТипКарты = Перечисления.ТипыКарт.Смешанная;
			Элементы.КодКартыШтрихкод.Видимость = ТекВидКарты.ТипКарты = Перечисления.ТипыКарт.Штриховая
							Или ТекВидКарты.ТипКарты = Перечисления.ТипыКарт.Смешанная;
			
		Иначе // Выводим все колонки.
			Элементы.Владелец.Видимость = Истина;
		КонецЕсли;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
КонецПроцедуры

#КонецОбласти

#Область ЗамерыПроизводительности

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, "СозданиеФормы" + РаботаСФормойДокументаКлиентСервер.ПолучитьИмяФормыСтрокой(ЭтотОбъект.ИмяФормы));
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, "ОткрытиеФормы" + РаботаСФормойДокументаКлиентСервер.ПолучитьИмяФормыСтрокой(ЭтотОбъект.ИмяФормы));
	
КонецПроцедуры

#КонецОбласти
