#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ТекстПредупреждения.Заголовок 	= Параметры.ТекстПредупреждения;
	ЭтаФорма.Заголовок 						= Параметры.ЗаголовокФормы;
	Если Параметры.ОднаКнопка Тогда
		Элементы.КнопкаДа.Заголовок 		= "ОК";
		Элементы.Отменить.Видимость 		= Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура КнопкаДа(Команда)
	
	Результат = Новый Структура("КнопкаДа, БольшеНеПоказывать", Истина, БольшеНеПоказывать);
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаНет(Команда)
	
	Результат = Новый Структура("КнопкаДа, БольшеНеПоказывать", Ложь, БольшеНеПоказывать);
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти
