////////////////////////////////////////////////////////////////////////////////
// Подсистема "Печать".
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Переопределяет таблицу возможных форматов для сохранения табличного документа.
// Вызывается из ОбщегоНазначения.НастройкиФорматовСохраненияТабличногоДокумента()
//
// Параметры:
//  ТаблицаФорматов - ТаблицаЗначений:
//                   *  ТипФайлаТабличногоДокумента - ТипФайлаТабличногоДокумента                 - значение в
//                                                                                                  платформе,
//                                                                                                  соответствующее
//                                                                                                  формату;
//                   *  Ссылка                      - ПеречислениеСсылка.ФорматыСохраненияОтчетов - ссылка на
//                                                                                                  метаданные, где
//                                                                                                  хранится
//                                                                                                  представление;
//                   *  Представление               - Строка -                                    - представление типа
//                                                             файла (заполняется из перечисления);
//                   *  Расширение                  - Строка -                                    - тип файла для
//                                                             операционной системы;
//                   *  Картинка                    - Картинка                                    - значок формата.
//
Процедура ПриЗаполненииНастроекФорматовСохраненияТабличногоДокумента(ТаблицаФорматов) Экспорт
	
КонецПроцедуры

// Переопределяет список команд печати, получаемый функцией УправлениеПечатью.КомандыПечатиФормы.
Процедура ПередДобавлениемКомандПечати(ИмяФормы, КомандыПечати, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Дополнительные настройки списка команд печати.
//
// Параметры:
//  НастройкиСписка - Структура - модификаторы списка команд печати.
//   * МенеджерКомандПечати     - МенеджерОбъекта - менеджер объекта, в котором формируется список команд печати;
//   * АвтоматическоеЗаполнение - Булево - заполнять команды печати из объектов, входящих в состав журнала.
//                                         Значение по умолчанию: Истина.
//
Процедура ПриПолученииНастроекСпискаКомандПечати(НастройкиСписка) Экспорт
	
КонецПроцедуры

// Определяет объекты, в которых есть процедура ДобавитьКомандыПечати().
//
// Параметры:
//  СписокОбъектов - Массив - список менеджеров объектов.
//
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
	//:::Справочники
	СписокОбъектов.Добавить(Справочники.Банки);
	СписокОбъектов.Добавить(Справочники.БанковскиеСчета);
	СписокОбъектов.Добавить(Справочники.ВидыНалогов);
	СписокОбъектов.Добавить(Справочники.ВидыСкидокНаценок);
	СписокОбъектов.Добавить(Справочники.ВидыЦен);
	СписокОбъектов.Добавить(Справочники.ВидыЦенКонтрагентов);
	СписокОбъектов.Добавить(Справочники.ВнеоборотныеАктивы);
	СписокОбъектов.Добавить(Справочники.ДоговорыКонтрагентов);
	СписокОбъектов.Добавить(Справочники.Кассы);
	СписокОбъектов.Добавить(Справочники.КассыККМ);
	СписокОбъектов.Добавить(Справочники.КлючевыеРесурсы);
	СписокОбъектов.Добавить(Справочники.КонтактныеЛица);
	СписокОбъектов.Добавить(Справочники.Контрагенты);
	СписокОбъектов.Добавить(Справочники.НаправленияДеятельности);
	СписокОбъектов.Добавить(Справочники.Номенклатура);
	СписокОбъектов.Добавить(Справочники.КатегорииНоменклатуры);
	СписокОбъектов.Добавить(Справочники.НомераГТД);
	СписокОбъектов.Добавить(Справочники.Организации);
	СписокОбъектов.Добавить(Справочники.ПартииНоменклатуры);
	СписокОбъектов.Добавить(Справочники.СценарииПланирования);
	СписокОбъектов.Добавить(Справочники.ПравилаОбменаСПодключаемымОборудованиемOffline);
	СписокОбъектов.Добавить(Справочники.Проекты);
	СписокОбъектов.Добавить(Справочники.Сотрудники);
	СписокОбъектов.Добавить(Справочники.Спецификации);
	СписокОбъектов.Добавить(Справочники.СтатьиДвиженияДенежныхСредств);
	СписокОбъектов.Добавить(Справочники.СтруктурныеЕдиницы);
	СписокОбъектов.Добавить(Справочники.ФизическиеЛица);
	СписокОбъектов.Добавить(Справочники.ХарактеристикиНоменклатуры);
	СписокОбъектов.Добавить(Справочники.Ячейки);
	
	//:::Документы
	СписокОбъектов.Добавить(Документы.АвансовыйОтчет);
	СписокОбъектов.Добавить(Документы.АктВыполненныхРабот);
	СписокОбъектов.Добавить(Документы.АмортизацияВА);
	СписокОбъектов.Добавить(Документы.Бюджет);
	СписокОбъектов.Добавить(Документы.ВводНачальныхОстатков);
	СписокОбъектов.Добавить(Документы.Взаимозачет);
	СписокОбъектов.Добавить(Документы.ВыработкаВА);
	СписокОбъектов.Добавить(Документы.Доверенность);
	СписокОбъектов.Добавить(Документы.ДополнительныеРасходы);
	СписокОбъектов.Добавить(Документы.ЗаданиеНаРаботу);
	СписокОбъектов.Добавить(Документы.ЗаказНаПроизводство);
	СписокОбъектов.Добавить(Документы.ЗаказПокупателя);
	СписокОбъектов.Добавить(Документы.ЗаказПоставщику);
	СписокОбъектов.Добавить(Документы.ЗакрытиеМесяца);
	СписокОбъектов.Добавить(Документы.ИзменениеПараметровВА);
	СписокОбъектов.Добавить(Документы.ИнвентаризацияЗапасов);
	СписокОбъектов.Добавить(Документы.КадровоеПеремещение);
	СписокОбъектов.Добавить(Документы.КорректировкаРегистров);
	СписокОбъектов.Добавить(Документы.НачислениеЗарплаты);
	СписокОбъектов.Добавить(Документы.НачислениеНалогов);
	СписокОбъектов.Добавить(Документы.НачисленияПоКредитамИЗаймам);
	СписокОбъектов.Добавить(Документы.Операция);
	СписокОбъектов.Добавить(Документы.ОперацияПоПлатежнымКартам);
	СписокОбъектов.Добавить(Документы.ОприходованиеЗапасов);
	СписокОбъектов.Добавить(Документы.ОтчетКомиссионера);
	СписокОбъектов.Добавить(Документы.ОтчетКомитенту);
	СписокОбъектов.Добавить(Документы.ОтчетОПереработке);
	СписокОбъектов.Добавить(Документы.ОтчетОРозничныхПродажах);
	СписокОбъектов.Добавить(Документы.ОтчетПереработчика);
	СписокОбъектов.Добавить(Документы.ПередачаВА);
	СписокОбъектов.Добавить(Документы.ПеремещениеДС);
	СписокОбъектов.Добавить(Документы.ПеремещениеДСПлан);
	СписокОбъектов.Добавить(Документы.ПеремещениеЗапасов);
	СписокОбъектов.Добавить(Документы.ПеремещениеПоЯчейкам);
	СписокОбъектов.Добавить(Документы.ПереоценкаВРозницеСуммовойУчет);
	СписокОбъектов.Добавить(Документы.ПланПродаж);
	СписокОбъектов.Добавить(Документы.ПлатежнаяВедомость);
	СписокОбъектов.Добавить(Документы.ПлатежноеПоручение);
	СписокОбъектов.Добавить(Документы.ПоступлениеВКассу);
	СписокОбъектов.Добавить(Документы.ПоступлениеДСПлан);
	СписокОбъектов.Добавить(Документы.ПоступлениеНаСчет);
	СписокОбъектов.Добавить(Документы.ПриемНаРаботу);
	СписокОбъектов.Добавить(Документы.ПринятиеКУчетуВА);
	СписокОбъектов.Добавить(Документы.ПриходнаяНакладная);
	СписокОбъектов.Добавить(Документы.ПриходныйОрдер);
	СписокОбъектов.Добавить(Документы.ПрочиеРасходы);
	СписокОбъектов.Добавить(Документы.РаспределениеЗатрат);
	СписокОбъектов.Добавить(Документы.РасходДСПлан);
	СписокОбъектов.Добавить(Документы.РасходИзКассы);
	СписокОбъектов.Добавить(Документы.РасходнаяНакладная);
	СписокОбъектов.Добавить(Документы.РасходныйОрдер);
	СписокОбъектов.Добавить(Документы.РасходСоСчета);
	СписокОбъектов.Добавить(Документы.РезервированиеЗапасов);
	СписокОбъектов.Добавить(Документы.СборкаЗапасов);
	СписокОбъектов.Добавить(Документы.СведенияОЗастрахованныхЛицахСЗВ_М);
	СписокОбъектов.Добавить(Документы.СверкаВзаиморасчетов);
	СписокОбъектов.Добавить(Документы.СдельныйНаряд);
	СписокОбъектов.Добавить(Документы.Событие);
	СписокОбъектов.Добавить(Документы.СписаниеВА);
	СписокОбъектов.Добавить(Документы.СписаниеЗапасов);
	СписокОбъектов.Добавить(Документы.СчетНаОплату);
	СписокОбъектов.Добавить(Документы.СчетНаОплатуПоставщика);
	СписокОбъектов.Добавить(Документы.СчетФактура);
	СписокОбъектов.Добавить(Документы.СчетФактураПолученный);
	СписокОбъектов.Добавить(Документы.Табель);
	СписокОбъектов.Добавить(Документы.Увольнение);
	СписокОбъектов.Добавить(Документы.УчетВремени);
	СписокОбъектов.Добавить(Документы.ЧекККМ);
	СписокОбъектов.Добавить(Документы.ЧекККМВозврат);
	
КонецПроцедуры

// Переопределяет параметры отправки печатных форм при подготовке письма.
// 
// Параметры:
//
//  ПараметрыОтправки
//    * Получатель - Массив
//    * Тема - Строка
//    * Текст - Строка
//    * Вложения - Структура:
//      ** АдресВоВременномХранилище - Строка.
//      ** Представление - Строка - имя файла.
//  ОбъектыПечати - Массив - параметр МассивСсылок в вызове процедуры Печать.
//  ПараметрыВывода - Структура - параметр ПараметрыВывода в вызове процедуры Печать.
//  ПечатныеФормы - ТаблицаЗначений - коллекция табличных документов:
//    * Название - Строка - название печатной формы;
//    * ТабличныйДокумент - ТабличныйДокумент - печатая форма.
Процедура ПередОтправкойПоПочте(ПараметрыОтправки, ПараметрыВывода, ОбъектыПечати, ПечатныеФормы) Экспорт
	
	ПараметрыОтправки.Вставить("ДокументыОснования", ОбъектыПечати);
	
КонецПроцедуры

// Вызывается после завершения вызова процедуры Печать менеджера печати объекта, имеет те же параметры.
// 
// Параметры:
//  МассивОбъектов - Массив - список объектов, для которых была выполнена процедура Печать;
//  ПараметрыПечати - Структура - произвольные параметры, переданные при вызове команды печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - содержит табличные документы и дополнительную информацию;
//  ОбъектыПечати - СписокЗначений - соответствие между объектами и именами областей в табличных документах, где
//                                   значение - Объект, представление - имя области с объектом в табличных документах;
//  ПараметрыВывода - Структура - параметры, связанные с выводом табличных документов:
//   * ПараметрыОтправки - Структура - информация для заполнения письма при отправке печатной формы по электронной почте.
//                                     Содержит следующие поля (описание см. в общем модуле конфигурации
//                                     РаботаСПочтовымиСообщениямиКлиент в процедуре СоздатьНовоеПисьмо):
//    ** Получатель;
//    ** Тема,
//    ** Текст.
Процедура ПриПечати(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти
