
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

	
	НомерДоговора = Параметры.НомерДоговора;
	ДатаДоговора = Параметры.ДатаДоговора;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НажатиеОК(Команда)
	
	СтруктураРезультат = Новый Структура("Номер, Дата", НомерДоговора, ДатаДоговора);
	
	Закрыть(СтруктураРезультат);
	
КонецПроцедуры

#КонецОбласти

