&НаСервере
Функция ОпределитьФормуПеремещенияДС(ДокументСсылка)
	
	Если ДокументСсылка.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные Тогда
		Если ДокументСсылка.ТипДенежныхСредствПолучатель = Перечисления.ТипыДенежныхСредств.Наличные Тогда
			Возврат "Документ.ПеремещениеДС.ФормаОбъекта";
		Иначе
			Возврат "Документ.РасходИзКассы.ФормаОбъекта";
		КонецЕсли;
	Иначе
		Если ДокументСсылка.ТипДенежныхСредствПолучатель = Перечисления.ТипыДенежныхСредств.Наличные Тогда
			Возврат "Документ.ПоступлениеВКассу.ФормаОбъекта";
		Иначе
			Возврат "Документ.РасходСоСчета.ФормаОбъекта";
		КонецЕсли;
	КонецЕсли;
	
КонецФункции


&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Параметры = Новый Структура("Основание", ПараметрКоманды);
	ОткрытьФорму(ОпределитьФормуПеремещенияДС(ПараметрКоманды), Параметры);
	
КонецПроцедуры
