
&НаКлиенте
Процедура ВыполнитьВыгрузку(Команда)
	
	Если Элементы.Список.ТекущиеДанные <> Неопределено тогда
		
		лУзелОбмена = Элементы.Список.ТекущиеДанные.Ссылка;
		
		ВыполнитьВыгрузкуСервер(лУзелОбмена);
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ВыполнитьВыгрузкуСервер(УзелОбмена)
	
	УзелОбменаЭтаИБ = УзелОбмена = ПланыОбмена.Б_Битрикс24_1С.УзелОбменаЭтойИБСервер();

	
	Если УзелОбменаЭтаИБ Тогда
		Сообщить(НСтр("ru = 'Узел соответствует этой информационной базе и не может использоваться в обмене с сайтом. Используйте другой узел обмена или создайте новый.'"));
	Иначе
		
		Б_Битрикс24_1С_Сервер.ВыполнитьВыгрузку(УзелОбмена);
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПосмотретьИзменения(Команда)
	
	
	Если Элементы.Список.ТекущиеДанные <> Неопределено тогда
		
		лУзелОбмена = Элементы.Список.ТекущиеДанные.Ссылка;
		
	    Если НЕ УзелПредопределенный(лУзелОбмена) тогда
			ПараметрыФормы = Новый Структура("УзелОбмена", лУзелОбмена);
			ОткрытьФорму("ПланОбмена.Б_Битрикс24_1С.Форма.ИнформацияОЗарегистрированныхИзменениях", ПараметрыФормы);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция УзелПредопределенный(УзелОбмена)
	
	УзелОбменаЭтаИБ = УзелОбмена = ПланыОбмена.Б_Битрикс24_1С.УзелОбменаЭтойИБСервер();
	
	Если УзелОбменаЭтаИБ Тогда
		Сообщить(НСтр("ru = 'Узел соответствует этой информационной базе и не может использоваться в обмене с сайтом. Используйте другой узел обмена или создайте новый.'"));
		Возврат Истина
	КонецЕсли;
	
	Возврат Ложь
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Выборка = ПланыОбмена.Б_Битрикс24_1С.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ЭтотУзел тогда
			
			лТекУзел = Выборка.ПолучитьОбъект();
			лТекУзел.Наименование = "Это предопределенный узел. Не используется.";
			лТекУзел.Записать();
			
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры
