
#Область ОбработчикиСобытийФормы

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДанныеHTML = РеквизитФормыВЗначение("Объект").ПолучитьМакет("ПодробноеОписаниеHTML");
	ТекстПодробноеОписание = ДанныеHTML.ПолучитьТекст();
	
	СсылкаДляПерехода = "link_" + Параметры.СсылкаДляПерехода;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

//Процедура-обработчик события завершения формирования HTML-документа поля ТекстПодробноеОписание
//
&НаКлиенте
Процедура ТекстПодробноеОписаниеДокументСформирован(Элемент)
	
	Если СсылкаДляПерехода = "" Тогда
		Возврат;
	КонецЕсли;
	
	#Если Не ВебКлиент Тогда
	Для каждого LinkItem Из Элементы.ТекстПодробноеОписание.Документ.Links Цикл
		Если LinkItem.name = СсылкаДляПерехода Тогда
			LinkItem.Click();
		КонецЕсли;
	КонецЦикла;
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти
