
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтруктураДокумента = Параметры.СтруктураДокумента;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриОткрытииЗавершение", ЭтотОбъект);
	
	ДокументооборотСКОКлиент.ПолучитьКонтекстЭДО(ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОсновныеДействияФормыОК(Команда)

	Результат = СформироватьРезультат();
	ВыбранХотяБыОдинТипДокумента = Ложь;

	Для Каждого Эл из Результат Цикл
		Если Эл.Значение Тогда
			ВыбранХотяБыОдинТипДокумента = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Если НЕ ВыбранХотяБыОдинТипДокумента Тогда
		ПоказатьПредупреждение(, "Выберите документы для печати.");
	Иначе
		Закрыть(Результат);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОсновныеДействияФормыОтмена(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция СформироватьРезультат()
	
	Возврат Новый Структура("ПечататьЗаявление, ПечататьСоглашение, ПечататьЛицензия, ПечататьСертификат",
	ПечатьЗаявление, ПечатьСоглашение, ПечатьЛицензия, ПечатьСертификат);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСертификатДляШифрования(УчетнаяЗапись)
	Возврат УчетнаяЗапись.СертификатДляШифрования;
КонецФункции

&НаКлиенте
Процедура ПриОткрытииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	КонтекстЭДОКлиент = Результат.КонтекстЭДО;
	
	ПечатьСертификата = Ложь;
	
	Если СтруктураДокумента.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявленияАбонентаСпецоператораСвязи.Одобрено") Тогда
		Если ПустаяСтрока(ПолучитьСертификатДляШифрования(СтруктураДокумента.УчетнаяЗапись)) Тогда
			
		Иначе
			ПечатьСертификата = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ФлажокСертификат.доступность = ПечатьСертификата;
	ПечатьСертификат = ПечатьСертификата;
	
	ПечатьЗаявление = Истина;
	ПечатьЛицензия = Истина;
	ПечатьСоглашение = Истина;
	
КонецПроцедуры
	
#КонецОбласти



