
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Если ПараметрыВыполненияКоманды.Источник=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыВыполненияКоманды.Источник.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаСписка" 
		ИЛИ ПараметрыВыполненияКоманды.Источник.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаКорзина" Тогда
		РаботаСНоменклатуройКлиент.ОформитьДокументСТоварамиИзКорзины(ПараметрыВыполненияКоманды, "АктВыполненныхРабот");
	ИначеЕсли Лев(ПараметрыВыполненияКоманды.Источник.ИмяФормы,17) = "ЖурналДокументов." Тогда
		СтруктураПараметров = Новый Структура();
		РаботаСФормойДокументаКлиент.ДобавитьПоследнееЗначениеОтбораПоля(ПараметрыВыполненияКоманды.Источник.ДанныеМеток, СтруктураПараметров, "Контрагент");
		РаботаСФормойДокументаКлиент.ДобавитьПоследнееЗначениеОтбораПоля(ПараметрыВыполненияКоманды.Источник.ДанныеМеток, СтруктураПараметров, "ВидОперации");
		РаботаСФормойДокументаКлиент.ДобавитьПоследнееЗначениеОтбораПоля(ПараметрыВыполненияКоманды.Источник.ДанныеМеток, СтруктураПараметров, "Организация");
			
		ОткрытьФорму("Документ.АктВыполненныхРабот.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения",СтруктураПараметров));
	КонецЕсли;
	
КонецПроцедуры
