
#Область ОбработчикиСлужебныхСобытий

Процедура ОбработкаНажатияГиперссылки(знач Идентификатор, знач РежимРаботы, СтандартнаяОбработка, Форма) Экспорт
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура;
	
	Если Идентификатор = "МоиУчетныеЗаписи" Тогда
		
		ОткрытьФорму("РегистрСведений.УчетныеЗаписиПользователя.Форма.НастройкаУчетныхЗаписейПользователя",, ЭтотОбъект);
		
	ИначеЕсли Идентификатор = "РабочийКаталогПечати" Тогда
		
		ОткрытьФорму("ОбщаяФорма.НастройкаОсновногоРабочегоКаталога");
		
	ИначеЕсли Идентификатор = "НастройкаСканирования" Тогда
		
		ФайловыеФункцииКлиент.ОткрытьФормуНастройкиСканирования();
		
	ИначеЕсли Идентификатор = "НастройкаРабочегоКаталогаФайлов" Тогда
		
		ОткрытьФорму("ОбщаяФорма.НастройкаОсновногоРабочегоКаталога");
		
	ИначеЕсли Идентификатор = "УстановкаРасширенияРаботыСФайлами" Тогда
		
		НачатьУстановкуРасширенияРаботыСФайлами(Неопределено);
		
	ИначеЕсли Идентификатор = "НастройкаЭлектроннойПодписиИШифрования" Тогда
		
		ЭлектроннаяПодписьКлиент.ОткрытьНастройкиЭлектроннойПодписиИШифрования();
		
	ИначеЕсли Идентификатор = "УстановитьРасширениеРаботыСКриптографией" Тогда
		
		НачатьУстановкуРасширенияРаботыСКриптографией(Неопределено);
		
	ИначеЕсли Идентификатор = "СведенияОПользователе" Тогда
		
		ПоказатьЗначение(Неопределено, ПользователиКлиентСервер.АвторизованныйПользователь());
		
	ИначеЕсли Идентификатор = "НастройкаДоступаКПрокси" Тогда
		
		ПараметрыФормы.Вставить("НастройкаПроксиНаКлиенте", Истина);
		ОткрытьФорму("ОбщаяФорма.ПараметрыПроксиСервера", ПараметрыФормы);
		
	ИначеЕсли Идентификатор = "НастройкаСинхронизацииДанных" Тогда
		
		Если РежимРаботы.МодельСервиса Тогда
			ИмяОткрываемойФормы = "ОбщаяФорма.СинхронизацияДанныхВМоделиСервиса";
		Иначе
			ИмяОткрываемойФормы = "ОбщаяФорма.СинхронизацияДанных";
		КонецЕсли;
		
		ОткрытьФорму(ИмяОткрываемойФормы);
		
	ИначеЕсли Идентификатор = "НастройкиЭлектроннойПодписиИШифрования" Тогда
		
		ОткрытьФорму("ОбщаяФорма.НастройкиЭлектроннойПодписиИШифрования");
		
	ИначеЕсли Идентификатор = "ПодключениеКСервису1С_ЭДО" Тогда
		
		МодульОбработки = ОбщегоНазначенияКлиент.ОбщийМодуль("ОбменСКонтрагентамиКлиент");
		МодульОбработки.ПомощникПодключенияКСервису1СЭДО();
		
	ИначеЕсли Идентификатор = "ПомощникПодключенияКСервису1СТакском" Тогда
		
		МодульОбработки = ОбщегоНазначенияКлиент.ОбщийМодуль("ОбменСКонтрагентамиКлиент");
		МодульОбработки.ПомощникПодключенияКСервису1СТакском();
		
	ИначеЕсли Идентификатор = "СервисныеКомандыБизнесСеть" Тогда
		
		ОткрытьФорму("Обработка.БизнесСеть.Форма.НастройкаПодключения");
		
	ИначеЕсли Идентификатор = "ВремяТекущегоСеанса" Тогда
		
		ТекстПредупреждения = СтрШаблон(
			НСтр("ru = 'Время сеанса: %1
				|На сервере: %2
				|На клиенте: %3
				|
				|Время сеанса - это время сервера,
				|приведенное к часовому поясу клиента.'"),
			Формат(ОбщегоНазначенияКлиент.ДатаСеанса(), "ДЛФ=T"),
			Формат(УправлениеНебольшойФирмойВызовСервера.ДатаСервера(), "ДЛФ=T"),
			Формат(ТекущаяДата(), "ДЛФ=T"));
			
		ПоказатьПредупреждение(,ТекстПредупреждения);
		
	ИначеЕсли Идентификатор = "ПараметрыПроксиСервера" Тогда
		
		ОткрытьФорму("ОбщаяФорма.ПараметрыПроксиСервера");
		
	ИначеЕсли Идентификатор = "НастройкиИспользованияПрофилейБезопасности" Тогда
		
		РаботаВБезопасномРежимеКлиент.ОткрытьДиалогНастройкиИспользованияПрофилейБезопасности();
		
	ИначеЕсли Идентификатор = "ОбновитьПараметрыСистемы" Тогда
		
		ОбновитьИнтерфейс();
		
	ИначеЕсли Идентификатор = "Настройка1СБухфон" Тогда
		
		ОткрытьФорму("ОбщаяФорма.Настройка1СБухфон");
		
	ИначеЕсли Идентификатор = "ОбновлениеПрограммы" Тогда
		
		ПолучениеОбновленийПрограммыКлиент.ОбновитьПрограмму();
		
	ИначеЕсли Идентификатор = "ПодключитьИПП" Тогда
		
		ИнтернетПоддержкаПользователейКлиент.ПодключитьИнтернетПоддержкуПользователей(,Форма);
		
	ИначеЕсли Идентификатор = "МониторИнтернетПоддержки" Тогда
		
		МониторИнтернетПоддержкиКлиент.ОткрытьМониторИнтернетПоддержки();
		
	ИначеЕсли Идентификатор = "НастройкиСоединенияССерверомИнтернетПоддержки" Тогда
		
		ОткрытьФорму("ОбщаяФорма.НастройкиСоединенияССерверомИнтернетПоддержки");
		
	ИначеЕсли Идентификатор = "РезультатыОбновленияИДополнительнаяОбработкаДанных" Тогда
		
		ПараметрыФормы.Вставить("ОткрытиеИзПанелиАдминистрирования", Истина);
		ОткрытьФорму("Обработка.РезультатыОбновленияПрограммы.Форма.ИндикацияХодаОтложенногоОбновленияИБ", ПараметрыФормы);
		
	ИначеЕсли Идентификатор = "КаталогДистрибутиваПлатформы" Тогда
		
		#Если Не ВебКлиент Тогда
		ЗапуститьПриложение(Форма.КаталогДистрибутиваПлатформы);
		#КонецЕсли
		
	ИначеЕсли Идентификатор = "ВыгрузитьДанныеДляПереходаВСервис" Тогда
		
		ОткрытьФорму("ОбщаяФорма.ВыгрузкаДанных");
		
	ИначеЕсли Идентификатор = "ЗагрузитьДанныеИзСервиса" Тогда
		
		ОткрытьФорму("ОбщаяФорма.ЗагрузкаДанныхИзСервиса");
		
	ИначеЕсли Идентификатор = "ВыгрузитьДанныеВЛокальнуюВерсию" Тогда
		
		ОткрытьФорму("ОбщаяФорма.ВыгрузкаДанных");
		
	ИначеЕсли Идентификатор = "ДополнительныеРеквизиты" Тогда
		
		ПараметрыФормы.Вставить("ПоказатьДополнительныеРеквизиты");
		ОткрытьФорму("Справочник.НаборыДополнительныхРеквизитовИСведений.ФормаСписка", ПараметрыФормы, , "ДополнительныеРеквизиты");
		
	ИначеЕсли Идентификатор = "ДополнительныеСведения" Тогда
		
		ПараметрыФормы.Вставить("ПоказатьДополнительныеСведения");
		ОткрытьФорму("Справочник.НаборыДополнительныхРеквизитовИСведений.ФормаСписка", ПараметрыФормы, , "ДополнительныеСведения");
		
	ИначеЕсли Идентификатор = "НастройкаВходаПользователей" Тогда
		
		ОткрытьФорму("ОбщаяФорма.НастройкиВходаПользователей");
		
	ИначеЕсли Идентификатор = "ПроверитьДоступКСервисуПроверкиКонтрагентов" Тогда
		
		ПроверкаКонтрагентовКлиент.ПроверитьДоступКСервису();
		
	ИначеЕсли Идентификатор = "ПодменюПечать" Тогда
		
		ОткрытьФорму("ОбщаяФорма.НастройкаКомандПечати");
		
	ИначеЕсли Идентификатор = "ДополнительныеОбработкиПоАдминистрированию" Тогда
		
		ПараметрыФормы.Вставить("ИмяРаздела", "Администрирование");
		ПараметрыФормы.Вставить("ОбъектыНазначения", Новый СписокЗначений);
		ПараметрыФормы.Вставить("Вид", ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка());
		ПараметрыФормы.Вставить("РежимОткрытияОкна", РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		ПараметрыФормы.Вставить("Заголовок", НСтр("ru = 'Дополнительные обработки по администрированию'"));
		ОткрытьФорму("ОбщаяФорма.ДополнительныеОтчетыИОбработки", ПараметрыФормы);
		
	ИначеЕсли Идентификатор = "РасширенияПрограммы" Тогда
		
		ОткрытьФорму("ОбщаяФорма.Расширения");
		
	ИначеЕсли Идентификатор = "АвтоматическиЗагружатьЭлектроннуюПочтуРасписание" Тогда
		
		ОбменСGoogleКлиент.ОткрытьДиалогНастройкиРасписания(ПредопределенноеЗначение("Перечисление.ОбластиДоступаGoogle.Почта"));
		
	ИначеЕсли Идентификатор = "НастройкаОтправкиSMS" Тогда
		
		ОткрытьФорму("ОбщаяФорма.НастройкаОтправкиSMS");
		
	ИначеЕсли Идентификатор = "НастройкиКриптографии" Тогда
		
		ОткрытьФорму("ОбщаяФорма.НастройкиЭлектроннойПодписиИШифрования");
		
	ИначеЕсли Идентификатор = "НастройкиРегистрацииСобытийДоступаКПерсональнымДанным" Тогда
		
		ОткрытьФорму("ОбщаяФорма.НастройкиРегистрацииСобытийДоступаКПерсональнымДанным");
		
	ИначеЕсли Идентификатор = "УправлениеПолнотекстовымПоискомИИзвлечениемТекстов" Тогда
		
		ОткрытьФорму("Обработка.НастройкаПрограммы.Форма.УправлениеПолнотекстовымПоискомИИзвлечениемТекстов");
		
	Иначе
		
		СтандартнаяОбработка = Истина;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
