&НаКлиенте
Перем ОбработкаКС Экспорт;

&НаСервере
Перем мОбъектОтчета;

&НаСервере
Перем СписокРасшифровкиПоказателей;

&НаСервере
Перем СписокРасшифровкиформулы;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Обход ошибки платформы Параметр сеанса отсутствует или удален
	ТабличныйДокумент.Очистить();
		
	СформироватьСтруктуруРеквизитовФормы();
	
	СтруктураРеквизитовФормы.СписокПечатаемыхЛистов = Новый СписокЗначений;
	СтруктураРеквизитовФормы.мСоставПоказателей = "СоставПоказателей2012Кв1";
	
	СоответствиеЕдиницыИзмеренияДелителю = Новый Структура;
	СоответствиеЕдиницыИзмеренияДелителю.Вставить("Окр1", 1);
	СоответствиеЕдиницыИзмеренияДелителю.Вставить("Окр1000", 1000);
	СоответствиеЕдиницыИзмеренияДелителю.Вставить("Окр1000000", 1000000);
	
	СтруктураРеквизитовФормы.мОписаниеТиповЧислоЕ = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(14, 2));
				
	СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_1 = "П0000200032";
	СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_2 = "П0000200035";
	
	КолИсхСтрокМСЧ_Раздел2_1 = 1;
	КолИсхСтрокМСЧ_Раздел2_2 = 1;
	
	КолКолонокИдМСЧ_Раздел2_1 = 1;
	КолКолонокИдМСЧ_Раздел2_2 = 1;
	
	СтруктураДанныхТитульный = Новый Структура;
	СтруктураДанныхРаздел3   = Новый Структура;
		
	ИнициализацияМногостраничныхРазделов();
	
	мСтруктураМногострочныхРазделов = Новый Структура;
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_1, СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_1);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_2, СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_2);
	
	мСтруктураМногостраничныхРазделов = Новый Структура;
	мСтруктураМногостраничныхРазделов.Вставить("Раздел1", "ТаблицаСтраницыРаздела1");
	мСтруктураМногостраничныхРазделов.Вставить("Раздел2", "ТаблицаСтраницыРаздела2");
	
	мСтруктураИсхКолвоСтрокРазделов = Новый Структура;
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_1, КолИсхСтрокМСЧ_Раздел2_1);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_2, КолИсхСтрокМСЧ_Раздел2_2);
	
	мСтруктураКолвоКолонокРазделов = Новый Структура;
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_1, КолКолонокИдМСЧ_Раздел2_1);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_2, КолКолонокИдМСЧ_Раздел2_2);
	
	ЦветЗаполняетсяТолькоВручную     = Новый Цвет(255, 255, 225);
	ЦветЗаполняетсяАвтоКорректир     = Новый Цвет(255, 240, 200);
	ЦветЗаполняетсяАвтоБезКорректир  = Новый Цвет(230, 240, 220);
	СтруктураРеквизитовФормы.ЦветЗаполняетсяАвтоАрифметика    = Новый Цвет(192, 220, 192); // ЗЕЛЕНЫЙ
	ЦветЗаполняетсяОднозначноВручную = Новый Цвет(255, 255, 192); // ЖЕЛТЫЙ
	ЦветЗаполняетсяАвтоматически     = Новый Цвет(255, 255, 255); // Белый, Ввод запрещен
	
	// структура цветов раскраски автозаполняемых ячеек
	мСтруктураЦветовРаскраски = Новый Структура;
	мСтруктураЦветовРаскраски.Вставить("_1", ЦветЗаполняетсяТолькоВручную);
	мСтруктураЦветовРаскраски.Вставить("_2", ЦветЗаполняетсяАвтоКорректир);
	мСтруктураЦветовРаскраски.Вставить("_3", ЦветЗаполняетсяАвтоБезКорректир);
	мСтруктураЦветовРаскраски.Вставить("_4", СтруктураРеквизитовФормы.ЦветЗаполняетсяАвтоАрифметика);
	мСтруктураЦветовРаскраски.Вставить("_0", ЦветЗаполняетсяОднозначноВручную);
	мСтруктураЦветовРаскраски.Вставить("_5", ЦветЗаполняетсяАвтоматически);
         	
	мСтруктураВариантыЗаполнения       = Новый Структура;
	мСтруктураВариантыЗаполненияЭталон = Новый Структура;
		
	// Версия формы
	СтруктураРеквизитовФормы.мВерсияФормы = "01/05/2013";
	
	// Код отчета, равен КНД
	СтруктураРеквизитовФормы.мКодОтчета = "1152016";
    		
	СтруктураРеквизитовФормы.мПечатныеформы     = Новый СписокЗначений;
	СтруктураРеквизитовФормы.мПечатаемыеРазделы = Новый СписокЗначений;
    		
	ИмяРаздела = "Титульный";
	
	ЭтаФормаИмя = ЭтаФорма.ИмяФормы;
	ИмяМакета = Сред(ЭтаФормаИмя, СтрНайти(ЭтаФормаИмя, "ФормаОтчета")) + "_" + ИмяРаздела;
	Попытка
		ТабличныйДокумент.Вывести(ОбъектОтчета(ЭтаФормаИмя).ПолучитьМакет(ИмяМакета));
	Исключение
	КонецПопытки;
	
	СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяРаздела;
	
	СтруктураРеквизитовФормы.мВыбраннаяФорма          = Параметры.мВыбраннаяФорма;
	СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета  = Параметры.мДатаКонцаПериодаОтчета;
	СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета = Параметры.мДатаНачалаПериодаОтчета;
	СтруктураРеквизитовФормы.мПериодичность           = Параметры.мПериодичность;
	СтруктураРеквизитовФормы.мСкопированаФорма        = Параметры.мСкопированаФорма;
	СтруктураРеквизитовФормы.мСохраненныйДок          = Параметры.мСохраненныйДок;
	СтруктураРеквизитовФормы.Организация        	  = Параметры.Организация;
	Если НЕ ЗначениеЗаполнено(СтруктураРеквизитовФормы.Организация) Тогда
		СтруктураРеквизитовФормы.Организация = СтруктураРеквизитовФормы.мСохраненныйДок.Организация;
	КонецЕсли;
	СтруктураРеквизитовФормы.ДоступенМеханизмПечатиРеглОтчетностиСДвухмернымШтрихкодомPDF417 = Параметры.ДоступенМеханизмПечатиРеглОтчетностиСДвухмернымШтрихкодомPDF417;
	СтруктураРеквизитовФормы.СформироватьФормуОтчетаАвтоматически = Параметры.СформироватьФормуОтчетаАвтоматически;
	
	ДатаПодписи	= ТекущаяДатаСеанса();
	
	ПорядкиОкругленияОтчетности = Новый Структура;
	ПорядкиОкругленияОтчетности.Вставить("ПеречислениеПорядкиОкругленияОтчетностиОкр1",       Перечисления.ПорядкиОкругленияОтчетности.Окр1);
	ПорядкиОкругленияОтчетности.Вставить("ПеречислениеПорядкиОкругленияОтчетностиОкр1000",    Перечисления.ПорядкиОкругленияОтчетности.Окр1000);
	ПорядкиОкругленияОтчетности.Вставить("ПеречислениеПорядкиОкругленияОтчетностиОкр1000000", Перечисления.ПорядкиОкругленияОтчетности.Окр1000000);
	
	СтруктураРеквизитовФормы.СправочникиВидыКонтактнойИнформацииФактАдресОрганизации = Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации;
	
	Инициализация(Параметры.БезОткрытияФормы);
		
КонецПроцедуры

&НаСервере
Процедура СформироватьСтруктуруРеквизитовФормы()
	
	СтруктураРеквизитовФормы = Новый Структура;
	СтруктураРеквизитовФормы.Вставить("ВыводитьСтраницуВТаблДокНаСервере");
	СтруктураРеквизитовФормы.Вставить("НаимТекущегоРаздела");
	СтруктураРеквизитовФормы.Вставить("НомерТекущейСтраницы");
	СтруктураРеквизитовФормы.Вставить("ИП");
	СтруктураРеквизитовФормы.Вставить("КНД");
	СтруктураРеквизитовФормы.Вставить("мАвтоВыборКодов");
	СтруктураРеквизитовФормы.Вставить("мБезОткрытияФормы");
	СтруктураРеквизитовФормы.Вставить("мВерсияФормы");
	СтруктураРеквизитовФормы.Вставить("мВПрограммеИзмененаОрганизация");
	СтруктураРеквизитовФормы.Вставить("мДелитель");
	СтруктураРеквизитовФормы.Вставить("мЗаписываетсяНовыйДокумент");
	СтруктураРеквизитовФормы.Вставить("мЗаписьЗапрещена");
	СтруктураРеквизитовФормы.Вставить("мКодОтчета");
	СтруктураРеквизитовФормы.Вставить("мРежимПечати");
	СтруктураРеквизитовФормы.Вставить("мСоставПоказателей");
	СтруктураРеквизитовФормы.Вставить("мСтрокаФормата");
	СтруктураРеквизитовФормы.Вставить("мСчетчикСтраниц");
	СтруктураРеквизитовФормы.Вставить("НаименованиеОтчетаДляВыгрузки");
	СтруктураРеквизитовФормы.Вставить("ТочностьЕдиницыИзмерения");
	СтруктураРеквизитовФормы.Вставить("ФлажокОтклАвтоРасчет", Ложь);
	СтруктураРеквизитовФормы.Вставить("ВидДокумента");
	СтруктураРеквизитовФормы.Вставить("ЕдиницаИзмерения");
	СтруктураРеквизитовФормы.Вставить("мВариант");
	СтруктураРеквизитовФормы.Вставить("мВыбраннаяФорма");
	СтруктураРеквизитовФормы.Вставить("мДатаКонцаПериодаОтчета");
	СтруктураРеквизитовФормы.Вставить("мДатаНачалаПериодаОтчета");
	СтруктураРеквизитовФормы.Вставить("МногострочныеИсключения");
	СтруктураРеквизитовФормы.Вставить("мОписаниеТиповЧислоЕ");
	СтруктураРеквизитовФормы.Вставить("мПериодичность");
	СтруктураРеквизитовФормы.Вставить("мПечатаемыеРазделы");
	СтруктураРеквизитовФормы.Вставить("мПечатныеФормы");
	СтруктураРеквизитовФормы.Вставить("мСкопированаФорма");
	СтруктураРеквизитовФормы.Вставить("мСохраненныйДок");
	СтруктураРеквизитовФормы.Вставить("ОбязРазделов");
	СтруктураРеквизитовФормы.Вставить("Организация");
	СтруктураРеквизитовФормы.Вставить("ПеречисленияЮрФизЛицо");
	СтруктураРеквизитовФормы.Вставить("СписокПечатаемыхЛистов");
	СтруктураРеквизитовФормы.Вставить("СправочникиВидыКонтактнойИнформацииФактАдресОрганизации");
	СтруктураРеквизитовФормы.Вставить("НаимОрганизации");
	СтруктураРеквизитовФормы.Вставить("СтрПериодОтчета");
	СтруктураРеквизитовФормы.Вставить("мВерсияОтчета");
	СтруктураРеквизитовФормы.Вставить("мДанныеОтчета");
	СтруктураРеквизитовФормы.Вставить("мДокументПредставителя");
	СтруктураРеквизитовФормы.Вставить("мИмяПредставителя");
	СтруктураРеквизитовФормы.Вставить("мНазваниеПредставителя");
	СтруктураРеквизитовФормы.Вставить("мОтчествоПредставителя");
	СтруктураРеквизитовФормы.Вставить("мПредставительФизЛицо");
	СтруктураРеквизитовФормы.Вставить("мФамилияПредставителя");
	СтруктураРеквизитовФормы.Вставить("мЕстьВыбранные");
	СтруктураРеквизитовФормы.Вставить("мИнтервалАвтосохранения");
	СтруктураРеквизитовФормы.Вставить("мПечатьБезШтрихкодаРазрешена");
	СтруктураРеквизитовФормы.Вставить("мПолноеИмяФайлаВнешнейОбработки");
	СтруктураРеквизитовФормы.Вставить("мПроверятьСоотношенияПриПечатиИВыгрузки");
	СтруктураРеквизитовФормы.Вставить("ЦветЗаполняетсяАвтоАрифметика");
	СтруктураРеквизитовФормы.Вставить("ТекущаяСтрокаРазделовОтчета");
	СтруктураРеквизитовФормы.Вставить("ДоступенМеханизмПечатиРеглОтчетностиСДвухмернымШтрихкодомPDF417");
	СтруктураРеквизитовФормы.Вставить("ТекстДляЗаголовочнойЧасти");
	СтруктураРеквизитовФормы.Вставить("ОпределятьТрудНаемныхРабочих");
	СтруктураРеквизитовФормы.Вставить("ИПИспользуетТрудНаемныхРаботников");
	СтруктураРеквизитовФормы.Вставить("ИдМСЧ_Раздел2_1");
	СтруктураРеквизитовФормы.Вставить("ИдМСЧ_Раздел2_2");
	СтруктураРеквизитовФормы.Вставить("РасчетныйКалендарь");
	СтруктураРеквизитовФормы.Вставить("СформироватьФормуОтчетаАвтоматически");
	СтруктураРеквизитовФормы.Вставить("ОтображатьКнопкуЗаполнить", Ложь);
	СтруктураРеквизитовФормы.Вставить("ОКВЭД",  "");
	СтруктураРеквизитовФормы.Вставить("ОКВЭД2", "");	
	
КонецПроцедуры

&НаСервере
Процедура ИнициализацияМногостраничныхРазделов()
	
	СтрПерваяСтраница = ТаблицаСтраницыРаздела1.Добавить();
	СтрПерваяСтраница.Представление               = "Новая страница";
	СтрПерваяСтраница.АктивнаяСтраница            = Истина;
	СтрПерваяСтраница.АвтоматическоеПредставление = Истина;
	
	СтрПерваяСтраница = ТаблицаСтраницыРаздела2.Добавить();
	СтрПерваяСтраница.Представление               = "Новая страница";
	СтрПерваяСтраница.АктивнаяСтраница            = Истина;
	СтрПерваяСтраница.АвтоматическоеПредставление = Истина;
	
КонецПроцедуры

&НаСервере
Процедура Инициализация(БезОткрытияФормы = Ложь) Экспорт
	
	СтруктураРеквизитовФормы.мБезОткрытияФормы = БезОткрытияФормы;
		
	ЗаполнитьНачальныеНастройки();
	
	ЗаполнитьСтруктуруЗависимыхЯчеекДляАвторасчета();

	ФормироватьСтруктуруСтраницОтчета();

	ФормироватьСтруктуруСвойствСтраниц();

	СформироватьДеревоРазделовОтчетаНаСервере();
	
	УстановитьМаскиВПоляхВвода(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
 		
	СтруктураРеквизитовФормы.ВидДокумента = 0;
	НомерКорректировки = 1;
	
	СтруктураРеквизитовФормы.мАвтоВыборКодов = Ложь;
	СтруктураРеквизитовФормы.мРежимПечати = Ложь;
	СтруктураРеквизитовФормы.мВПрограммеИзмененаОрганизация = Ложь;
                          
	Если НЕ БезОткрытияФормы Тогда
		
		СформироватьСпискиВыбора();
		
	КонецЕсли;
	
	СтруктураРеквизитовФормы.ОпределятьТрудНаемныхРабочих = НЕ РегламентированнаяОтчетностьПереопределяемый.ЭтоЮридическоеЛицо(СтруктураРеквизитовФормы.Организация);
	СтруктураРеквизитовФормы.ИПИспользуетТрудНаемныхРаботников = РегламентированнаяОтчетность.ИПИспользуетТрудНаемныхРаботников(СтруктураРеквизитовФормы.Организация);
    	
	Если СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено Тогда
		
		НачальныеОперацииСМногострочнымиБлоками();
		
		Если СтруктураРеквизитовФормы.мСкопированаФорма <> Неопределено Тогда // документ скопирован
			ВосстановитьСохраненныеДанные();
		Иначе
			Если НЕ СтруктураРеквизитовФормы.мБезОткрытияФормы Тогда
				СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки = Ложь;
			КонецЕсли;
			СтруктураРеквизитовФормы.ЕдиницаИзмерения         = Перечисления.ПорядкиОкругленияОтчетности.Окр1;
			СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 0;
			ОтобразитьНомерКорректировки(ЭтаФорма);
			КопироватьДанныеФормы(мДеревоСтраницОтчета, мДеревоВыбранныхСтраниц);
						
		КонецЕсли;
		ЗаполнитьДатуПодписи(ЭтаФорма);
		
		Модифицированность = Истина;
		
	Иначе
		
		ВосстановитьСохраненныеДанные();
		                   		
		Если ЗначениеЗаполнено(СтруктураРеквизитовФормы.мСкопированаФорма) Тогда
			СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено;
		КонецЕсли;
		
		Если НЕ БезОткрытияФормы
           И НЕ СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено Тогда
				   
        	ЗаблокироватьДанныеДляРедактирования(СтруктураРеквизитовФормы.мСохраненныйДок, , ЭтаФорма.УникальныйИдентификатор);

        КонецЕсли;
		
	КонецЕсли;

	// Подготовка расчетного календаря.
	//
	СтруктураРеквизитовФормы.РасчетныйКалендарь = Новый Массив;
						
	ПервыйМесяцКвартала = Месяц(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета);
	ДеньПериода = НачалоДня(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета);
	КонечнаяДата = КонецДня(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
	
	Пока ДеньПериода <= КонечнаяДата Цикл
		
		ДанныеРасчетногоКалендаря = Новый Структура;
		
		ДанныеРасчетногоКалендаря.Вставить("Дата", ДеньПериода);
		ДанныеРасчетногоКалендаря.Вставить("МесяцКвартала", Месяц(ДеньПериода) - ПервыйМесяцКвартала + 1);
		ДанныеРасчетногоКалендаря.Вставить("Деятельность", 0);
				
		СтруктураРеквизитовФормы.РасчетныйКалендарь.Добавить(ДанныеРасчетногоКалендаря);
				
		ДеньПериода = ДеньПериода + 86400; // следующий день
		
	КонецЦикла;
	
	Если НЕ СтруктураРеквизитовФормы.ОтображатьКнопкуЗаполнить Тогда
		Элементы.Заполнить.Видимость = Ложь;
	КонецЕсли;
	
	ПоказатьПериод();
			
	СтруктураРеквизитовФормы.НаимОрганизации = СтруктураРеквизитовФормы.Организация.Наименование;

	СтруктураРеквизитовФормы.ИП = НЕ РегламентированнаяОтчетностьВызовСервера.ЭтоЮридическоеЛицо(СтруктураРеквизитовФормы.Организация);
	
	Если СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено
	 ИЛИ ЗначениеЗаполнено(СтруктураРеквизитовФормы.мСкопированаФорма)
	 ИЛИ СтруктураРеквизитовФормы.СформироватьФормуОтчетаАвтоматически Тогда	
	 
		ЗаполнитьСведенияОбОрганизацииНаСервере();
		
	Иначе
		
		РегламентированнаяОтчетность.ПолучитьЗначениеОКВЭД(ДатаПодписи, СтруктураРеквизитовФормы);
		
	КонецЕсли;
	 
	// формируем список элементов подменю, связанное с кнопкой <Печать>
	Если НЕ БезОткрытияФормы Тогда
		РегламентированнаяОтчетностьКлиентСервер.ПоказатьКнопкиПечати(ЭтаФорма);
	КонецЕсли;
	
	НомерКорректировки = СтруктураРеквизитовФормы.ВидДокумента * НомерКорректировки;
	ТабличныйДокумент.Области.НомерКорректировки.Значение = НомерКорректировки;
	ТабличныйДокумент.Области.ДатаПодписи.Значение = ДатаПодписи;
	
	СтруктураРеквизитовФормы.ВыводитьСтраницуВТаблДокНаСервере = Ложь;
	
	УстановитьДоступностьОбластей(ЭтаФорма, СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	РегламентированнаяОтчетность.ДобавитьКнопкуПрисоединенныеФайлы(ЭтаФорма);
	
	РегламентированнаяОтчетностьКлиентСервер.ПриИнициализацииФормыРегламентированногоОтчета(ЭтаФорма);
	
	Если СтруктураРеквизитовФормы.СформироватьФормуОтчетаАвтоматически Тогда
		
		ЗаполнитьАвтоНаСервере();
						
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтруктуруЗависимыхЯчеекДляАвторасчета()
	
	СтруктураЗависимыхЯчеекДляАвторасчета = Новый Структура;
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020010003", "П000020004003;П000020005003;П000020006003;П000020007003;П000020008003;П000020009003;П000020003201;П000020003501");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020011003", "П000020004003;П000020005003;П000020006003;П000020007003;П000020008003;П000020009003;П000020003201;П000020003501");
	
 	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030001003", "П000020004003;П000020005003;П000020006003;П000020007003;П000020008003;П000020009003;П000020003201;П000020003501");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030002003", "П000020004003;П000020005003;П000020006003;П000020007003;П000020008003;П000020009003;П000020003201;П000020003501");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030005003", "П000030003003;П000030004003;П000030002003");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030006003", "П000020004003;П000020005003;П000020006003;П000020007003;П000020008003;П000020009003;П000030003003;П000030004003;П000030002003;;П000020003201;П000020003501");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если СтрНайти(Заголовок, СтруктураРеквизитовФормы.СтрПериодОтчета) = 0 Тогда
		Заголовок = Заголовок + " за " + СтруктураРеквизитовФормы.СтрПериодОтчета;
	КонецЕсли;
	
	ОргСтр = " (" + СтруктураРеквизитовФормы.НаимОрганизации + ")";
	Если СтрНайти(Заголовок, ОргСтр) = 0 Тогда
		Заголовок = Заголовок + ОргСтр;
	КонецЕсли;
	
	Заголовок = Заголовок + ?(СтрНайти(ЭтаФорма.ИмяФормы, "Внешний") > 0, " - внешний отчет", "");
	
	ПодключитьОбработчикОжидания("ВыполнитьПроверкуПередОткрытием", 0.1, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПроверкуПередОткрытием()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриОткрытииЗавершение", ЭтотОбъект);
	Отказ = Ложь;
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередОткрытиемФормыРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Модифицированность = Ложь;
		Закрыть();
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	РегламентированнаяОтчетностьКлиент.ПередЗакрытиемРегламентированногоОтчета(ЭтаФорма, Отказ, СтандартнаяОбработка, ЗавершениеРаботы, ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
				
		Возврат;
		
	КонецЕсли;
	
	ПриЗакрытииНаСервере();
		
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
			
	РегламентированнаяОтчетность.ПриЗакрытииРегламентированногоОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура НачальныеОперацииСМногострочнымиБлоками()
	Перем ИсходноеКоличествоСтрокГруппы;

	Для Каждого ЭлементСтруктуры Из мСтруктураМногострочныхРазделов Цикл
		ИмяГруппы = ЭлементСтруктуры.Ключ;
		СтруктураГруппы = ЭтаФорма[ЭлементСтруктуры.Значение];
		
		мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, ИсходноеКоличествоСтрокГруппы);

		Для НСтр = 1 По ИсходноеКоличествоСтрокГруппы Цикл

			СтруктураГруппы.Добавить();
            			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиРазделВТабличныйДокумент(Форма, ИмяГруппы, СтруктураГруппы)
	
	Перем ИсходноеКоличествоСтрокГруппы;
	
	Форма.мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, ИсходноеКоличествоСтрокГруппы);
	
	ТекущееКоличествоСтрокГруппы = СтруктураГруппы.Количество();
	
	ТекТабличноеПолеИмя = "ТабличныйДокумент";
	
	ТекТабличноеПоле = Форма[ТекТабличноеПолеИмя];
	
	// Защита от случая, когда передают многострочную часть с количеством строк менее чем исходное.
	Если ИсходноеКоличествоСтрокГруппы > ТекущееКоличествоСтрокГруппы Тогда
		Для Инд = 1 По (ИсходноеКоличествоСтрокГруппы - ТекущееКоличествоСтрокГруппы) Цикл
			СтруктураГруппы.Добавить();
		КонецЦикла;
	КонецЕсли;
	
	Если ТекущееКоличествоСтрокГруппы > ИсходноеКоличествоСтрокГруппы Тогда
		
		Для НомерНовойСтроки = ИсходноеКоличествоСтрокГруппы + 1 По ТекущееКоличествоСтрокГруппы Цикл
			
			ИмяГиперссылки = Неопределено;
			Если ИмяГруппы = СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_1 Тогда
				ИмяГиперссылки = "П000020003301";
			ИначеЕсли ИмяГруппы = СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_2 Тогда
				ИмяГиперссылки = "П000020003601";
			КонецЕсли;
			
			ОпорнаяОбласть = ТабличныйДокумент.Области[ИмяГиперссылки + "_" + СтрокаЧГ0(НомерНовойСтроки - 1)];
			
			ОбластьКопированияВерх = ОпорнаяОбласть.Верх;
			ОбластьКопированияНиз = ОбластьКопированияВерх + 1;
			ОбластьКопирования = ТабличныйДокумент.ПолучитьОбласть(ОбластьКопированияВерх, , ОбластьКопированияНиз, );
			
			ПромежуточныйДокумент = Новый ТабличныйДокумент;
			ПромежуточныйДокумент.Вывести(ОбластьКопирования);
			ПромежуточныйДокумент.Области[ОпорнаяОбласть.Имя].Имя = ИмяГиперссылки + "_" + СтрокаЧГ0(НомерНовойСтроки);
			
			ВставляемаяОбласть = ПромежуточныйДокумент.Область(1, , ПромежуточныйДокумент.ВысотаТаблицы, );
			
			ПозицияВставки = ОбластьКопированияВерх + 2;
			ОбластьВставки = ТабличныйДокумент.Область(ПозицияВставки, , ПозицияВставки, );
			
			ТабличныйДокумент.ВставитьОбласть(ВставляемаяОбласть, ОбластьВставки, ТипСмещенияТабличногоДокумента.ПоВертикали);
			
			ОпорнаяОбласть.Текст = "Удалить дату";
			
			ИсходнаяОбластьВводаДаты = ТабличныйДокумент.Области[ИмяГруппы + "01_1"];
			НоваяОбластьВводаДаты = ТабличныйДокумент.Область(ОбластьКопированияВерх, 9, ОбластьКопированияВерх, 9);
			
			ТабличныйДокумент.ВставитьОбласть(ИсходнаяОбластьВводаДаты, НоваяОбластьВводаДаты, ТипСмещенияТабличногоДокумента.БезСмещения, Ложь);
			НоваяОбластьВводаДаты.Имя = ИмяГруппы + "01_" + СтрокаЧГ0(НомерНовойСтроки);
			НоваяОбластьВводаДаты.Очистить();
			
		КонецЦикла;
		
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из СтруктураГруппы Цикл
		
		НомерСтрокиВТаблице      = СтруктураГруппы.Индекс(СтрокаТаблицы);
		НомерСтрокиВФормеТаблицы = НомерСтрокиВТаблице + 1;
		НомерСтрокиВФормеТаблицыСтр = Формат(НомерСтрокиВФормеТаблицы, "ЧГ=0");
		
		Для НомерГрафы = 1 По Форма.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
			
			КолонкаТаблицыИмя = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=");
												
			Если СтруктураГруппы[0].Свойство(КолонкаТаблицыИмя) Тогда
				
				ЗначениеЯчейки = СтрокаТаблицы[КолонкаТаблицыИмя];
				ИмяЯчейки      = КолонкаТаблицыИмя + "_" + НомерСтрокиВФормеТаблицыСтр;
				
				ОбластьЯчейкиТаблицы = ТекТабличноеПоле.Области[ИмяЯчейки];
				
				Если ОбластьЯчейкиТаблицы.СодержитЗначение Тогда
					ОбластьЯчейкиТаблицы.Значение = ЗначениеЯчейки;
				Иначе
					ОбластьЯчейкиТаблицы.Текст = ЗначениеЯчейки;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;

	КонецЦикла;
			
	Если ИмяГруппы = СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_1 Тогда
		ТаблицаДопСтрок = ЭтаФорма["Хранилище" + СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_1].Добавить().Таблица;
	ИначеЕсли ИмяГруппы = СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_2 Тогда
		ТаблицаДопСтрок = ЭтаФорма["Хранилище" + СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_2].Добавить().Таблица;
	КонецЕсли;
	
	КопироватьДанныеФормы(СтруктураГруппы, ТаблицаДопСтрок);
	
	КопироватьДанныеФормы(ТаблицаДопСтрок, ЭтаФорма[мСтруктураМногострочныхРазделов[ИмяГруппы]]);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьДополнительнуюСтрокуДаты(ИмяОбласти, МногострочнаяЧасть, ИдМСЧ)
	
	ПозицияРазделителя = СтрНайти(ИмяОбласти, "_");
	ОсновноеИмяГиперссылки = Лев(ИмяОбласти, ПозицияРазделителя - 1);
	НомерГиперссылки = Число(Сред(ИмяОбласти, ПозицияРазделителя + 1));
	
	ОпорнаяОбласть = ТабличныйДокумент.Области[ИмяОбласти];
	
	ОбластьКопированияВерх = ОпорнаяОбласть.Верх;
	ОбластьКопированияНиз = ОбластьКопированияВерх + 1;
	ОбластьКопирования = ТабличныйДокумент.ПолучитьОбласть(ОбластьКопированияВерх, , ОбластьКопированияНиз, );
	
	ПромежуточныйДокумент = Новый ТабличныйДокумент;
	ПромежуточныйДокумент.Вывести(ОбластьКопирования);
	ПромежуточныйДокумент.Области[ИмяОбласти].Имя = ОсновноеИмяГиперссылки + "_" + СтрокаЧГ0(НомерГиперссылки + 1);
	
	ВставляемаяОбласть = ПромежуточныйДокумент.Область(1, , ПромежуточныйДокумент.ВысотаТаблицы, );
	
	ПозицияВставки = ОбластьКопированияВерх + 2;
	ОбластьВставки = ТабличныйДокумент.Область(ПозицияВставки, , ПозицияВставки, );
	
	ТабличныйДокумент.ВставитьОбласть(ВставляемаяОбласть, ОбластьВставки, ТипСмещенияТабличногоДокумента.ПоВертикали);
	
	ОпорнаяОбласть.Текст = "Удалить дату";
	
	МногострочнаяЧасть.Добавить();
		
	ИсходнаяОбластьВводаДаты = ТабличныйДокумент.Области[ИдМСЧ + "01_1"];
	НоваяОбластьВводаДаты = ТабличныйДокумент.Область(ОбластьКопированияВерх, 9, ОбластьКопированияВерх, 9);
	
	ТабличныйДокумент.ВставитьОбласть(ИсходнаяОбластьВводаДаты, НоваяОбластьВводаДаты, ТипСмещенияТабличногоДокумента.БезСмещения, Ложь);
	НоваяОбластьВводаДаты.Имя = ИдМСЧ + "01_" + СтрокаЧГ0(МногострочнаяЧасть.Количество());
	НоваяОбластьВводаДаты.Очистить();
	
	ТабличныйДокумент.ТекущаяОбласть = НоваяОбластьВводаДаты;
		
	Модифицированность = Истина;
	
	КопироватьДанныеФормы(МногострочнаяЧасть, ЭтаФорма[мСтруктураМногострочныхРазделов[ИдМСЧ]]);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтруктуруМногострочногоРаздела(ИмяГруппы) Экспорт
	
	Перем СтруктураГруппы;
	
	мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы);
	
	СтруктураГруппы = ЭтаФорма[СтруктураГруппы];
		
	ТекТабличноеПолеИмя = "ТабличныйДокумент";
	
	ТекТабличноеПоле = ЭтаФорма[ТекТабличноеПолеИмя];
	
	Для НСтр = 1 По СтруктураГруппы.Количество() Цикл
		
		ТекСтрокаТаблицы = СтруктураГруппы[НСтр - 1];
		
		Для НомерГрафы = 1 По мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
				
			Если Прав(ИмяГруппы, 2) = "20" Тогда
				ИмяКолонки = ИмяГруппы + Формат((НомерГрафы + 1) * 10, "ЧЦ=2; ЧВН=");
			Иначе
				ИмяКолонки = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=");
			КонецЕсли;
			
			Если СтруктураГруппы[0].Свойство(ИмяКолонки) Тогда	
				
				ИмяЯчейки     = ИмяКолонки + "_" + НСтр;
				ОбластьЯчейки = ТекТабличноеПоле.Области[ИмяЯчейки];
				
				Если ОбластьЯчейки.СодержитЗначение = Истина Тогда
					ЗначениеЯчейки = ОбластьЯчейки.Значение;
				Иначе
					ЗначениеЯчейки = ОбластьЯчейки.Текст;
				КонецЕсли;
				
				ТекСтрокаТаблицы[ИмяКолонки] = ЗначениеЯчейки;
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьДополнительнуюСрокуДаты(ИмяОбласти)
	
	Перем МногострочнаяЧасть;
	
	Если СтрНайти(ИмяОбласти, "П000020003301") = 1 Тогда
		ИдМСЧ = СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_1;
	ИначеЕсли СтрНайти(ИмяОбласти, "П000020003601") = 1 Тогда
		ИдМСЧ = СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_2;
	Иначе
		ВызватьИсключение "Вызов процедуры ОбработатьДополнительнуюСроку() с недопустимым параметром";
	КонецЕсли;
	
	мСтруктураМногострочныхРазделов.Свойство(ИдМСЧ, МногострочнаяЧасть);
	МногострочнаяЧасть = ЭтаФорма[МногострочнаяЧасть];
	
	ПозицияРазделителя = СтрНайти(ИмяОбласти, "_");
	НомерГиперссылки = Число(Сред(ИмяОбласти, ПозицияРазделителя + 1));
	
	Если НомерГиперссылки < МногострочнаяЧасть.Количество() Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьДополнительнуюСрокуДатыЗавершение", ЭтотОбъект, Новый Структура("ИдМСЧ, ИмяОбласти, МногострочнаяЧасть", ИдМСЧ, ИмяОбласти, МногострочнаяЧасть));
		ТекстВопроса = НСтр("ru='Удалить выбранную дату?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		
	Иначе
		
		ДобавитьДополнительнуюСтрокуДаты(ИмяОбласти, МногострочнаяЧасть, ИдМСЧ);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьДополнительнуюСрокуДатыЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ИдМСЧ = ДополнительныеПараметры.ИдМСЧ;
	ИмяОбласти = ДополнительныеПараметры.ИмяОбласти;
	МногострочнаяЧасть = ДополнительныеПараметры.МногострочнаяЧасть;
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьДополнительнуюСтрокуДаты(ИмяОбласти, МногострочнаяЧасть, ИдМСЧ);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьСписокДат(ИдМСЧ)
	
	МногострочнаяЧасть = ЭтаФорма[мСтруктураМногострочныхРазделов[ИдМСЧ]];
	ИсходноеЧислоСтрок = мСтруктураИсхКолвоСтрокРазделов[ИдМСЧ];
	АктуальноеЧислоСтрок = МногострочнаяЧасть.Количество();
	
	Если АктуальноеЧислоСтрок > ИсходноеЧислоСтрок Тогда
		ВерхняяОбласть = ТабличныйДокумент.Области[ИдМСЧ + "01_" + СтрокаЧГ0(ИсходноеЧислоСтрок + 1)];
		НижняяОбласть  = ТабличныйДокумент.Области[ИдМСЧ + "01_" + СтрокаЧГ0(АктуальноеЧислоСтрок)];
		
		УдаляемаяОбласть = ТабличныйДокумент.Область(ВерхняяОбласть.Верх, , НижняяОбласть.Верх + 1, );
		ТабличныйДокумент.УдалитьОбласть(УдаляемаяОбласть, ТипСмещенияТабличногоДокумента.ПоВертикали);
		
		Если ИдМСЧ = СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_1 Тогда
			ИмяГиперссылки = "П000020003301";
		ИначеЕсли ИдМСЧ = СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_2 Тогда
			ИмяГиперссылки = "П000020003601";
		КонецЕсли;
		
		ОбластьГиперссылки = ТабличныйДокумент.Области[ИмяГиперссылки + "_" + СтрокаЧГ0(АктуальноеЧислоСтрок)];
		ОбластьГиперссылки.Имя = ИмяГиперссылки + "_1";
	КонецЕсли;
	
	МногострочнаяЧасть.Очистить();
	Для Инд = 1 По ИсходноеЧислоСтрок Цикл
		МногострочнаяЧасть.Добавить();
	КонецЦикла;
	ВывестиРазделВТабличныйДокумент(ЭтаФорма, ИдМСЧ, МногострочнаяЧасть);
	
	Модифицированность = Истина;
	РасчетНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьДниОсуществленияДеятельности()
	
	ПервыйМесяцКвартала = Месяц(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета);
	
	ОбластиРасчета = Новый Соответствие();
	ОбластиРасчета.Вставить(1, ТабличныйДокумент.Области.П000020005004);
	ОбластиРасчета.Вставить(2, ТабличныйДокумент.Области.П000020006004);
	ОбластиРасчета.Вставить(3, ТабличныйДокумент.Области.П000020007004);
	
	ЕстьСобытиеВМесяце = Новый Соответствие;
	ЕстьСобытиеВМесяце.Вставить(1, Ложь);
	ЕстьСобытиеВМесяце.Вставить(2, Ложь);
	ЕстьСобытиеВМесяце.Вставить(3, Ложь);
	
	ОписаниеТиповДата = Новый ОписаниеТипов("Дата", , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	ОписаниеТиповЧисло = Новый ОписаниеТипов("Число");
	
	ДатыСобытий = Новый ТаблицаЗначений;
	ДатыСобытий.Колонки.Добавить("ДатаСобытия", ОписаниеТиповДата);
	ДатыСобытий.Колонки.Добавить("ВидСобытия", ОписаниеТиповЧисло); // 0 - постановка, 1 - снятие
	
	ДатыСобытий.Индексы.Добавить("ДатаСобытия, ВидСобытия");
	
	ДатыПостановкиНаУчет = ЭтаФорма[мСтруктураМногострочныхРазделов[СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_1]];
	Для Инд = 1 По ДатыПостановкиНаУчет.Количество() Цикл
		НомерСтроки = СтрокаЧГ0(Инд);
		ЗначениеДаты = ТабличныйДокумент.Области[СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_1 + "01_" + НомерСтроки].Значение;
		Если ЗначениеЗаполнено(ЗначениеДаты)
		   И (НачалоДня(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) <= ЗначениеДаты И ЗначениеДаты <= КонецДня(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета)) Тогда
			СтрокаДаты = ДатыСобытий.Добавить();
			СтрокаДаты.ДатаСобытия = ЗначениеДаты;
			СтрокаДаты.ВидСобытия  = 0;
			
			МесяцКварталаСобытия = Месяц(ЗначениеДаты) - ПервыйМесяцКвартала + 1;
			ЕстьСобытиеВМесяце.Вставить(МесяцКварталаСобытия, Истина);
		КонецЕсли;
	КонецЦикла;
	
	ДатыСнятияСУчета = ЭтаФорма[мСтруктураМногострочныхРазделов[СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_2]];
	Для Инд = 1 По ДатыСнятияСУчета.Количество() Цикл
		НомерСтроки = СтрокаЧГ0(Инд);
		ЗначениеДаты = ТабличныйДокумент.Области[СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_2 + "01_" + НомерСтроки].Значение;
		Если ЗначениеЗаполнено(ЗначениеДаты)
		   И (НачалоДня(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) <= ЗначениеДаты И ЗначениеДаты <= КонецДня(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета)) Тогда
			СтрокаПроверки = ДатыСобытий.Добавить();
			СтрокаПроверки.ДатаСобытия = ЗначениеДаты;
			СтрокаПроверки.ВидСобытия  = 1;
			
			МесяцКварталаСобытия = Месяц(ЗначениеДаты) - ПервыйМесяцКвартала + 1;
			ЕстьСобытиеВМесяце.Вставить(МесяцКварталаСобытия, Истина);
		КонецЕсли;
	КонецЦикла;
	
	ДатыСобытий.Сортировать("ДатаСобытия, ВидСобытия");
	
	Если ДатыСобытий.Количество() > 0 Тогда
		Если НачалоДня(ДатыСобытий[0].ДатаСобытия) <> НачалоДня(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
			НачальноеСостяние = 1 - ДатыСобытий[0].ВидСобытия;
			НачальноеСобытие = ДатыСобытий.Вставить(0);
			НачальноеСобытие.ДатаСобытия = НачалоДня(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета);
			НачальноеСобытие.ВидСобытия = НачальноеСостяние
		КонецЕсли;
		
		Для Инд = 0 По ДатыСобытий.Количество() - 1 Цикл
			Событие = ДатыСобытий[Инд];
			ВедениеДеятельности = 1 - Событие.ВидСобытия; // 0 - деятельнось не велась, 1 - деятельность велась
			ДатаИзменения = НачалоДня(Событие.ДатаСобытия);
			
			Для Каждого ДеньКалендаря Из СтруктураРеквизитовФормы.РасчетныйКалендарь Цикл
				Если ДеньКалендаря.Дата >= ДатаИзменения Тогда
					ДеньКалендаря.Деятельность = ВедениеДеятельности;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	РасчетныйКалендарь = Новый ТаблицаЗначений;
	
	РасчетныйКалендарь.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата", , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	РасчетныйКалендарь.Колонки.Добавить("МесяцКвартала", Новый ОписаниеТипов("Число"));
	РасчетныйКалендарь.Колонки.Добавить("Деятельность", Новый ОписаниеТипов("Число"));
	
	Для Каждого ЭлементМассива Из СтруктураРеквизитовФормы.РасчетныйКалендарь Цикл
		
		НоваяСтрока = РасчетныйКалендарь.Добавить();
		НоваяСтрока.Дата = ЭлементМассива.Дата;
		НоваяСтрока.МесяцКвартала = ЭлементМассива.МесяцКвартала;
		НоваяСтрока.Деятельность = ЭлементМассива.Деятельность;
		
	КонецЦикла;
		
	Для Инд = 1 По 3 Цикл
		Если ЕстьСобытиеВМесяце[Инд] Тогда
			СтрокиМесяца = РасчетныйКалендарь.НайтиСтроки(Новый Структура("МесяцКвартала", Инд));
			КалендарьМесяца = РасчетныйКалендарь.Скопировать(СтрокиМесяца);
			КоличествоДнейДеятельности = КалендарьМесяца.Итог("Деятельность");
		Иначе
			КоличествоДнейДеятельности = 0;
		КонецЕсли;
		ОбластиРасчета[Инд].Значение = КоличествоДнейДеятельности;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьСведенияОПостановкеНаУчет(ДанныеСтраницы)
	
	Показатели = ДанныеСтраницы.Данные;
	
	ПостановкаУстановленаДа = Показатели.Свойство("П000020003101") И ЗначениеЗаполнено(Показатели.П000020003101);
	ПостановкаУстановленаНет = Показатели.Свойство("П000020003102") И ЗначениеЗаполнено(Показатели.П000020003102);
	
	Если НЕ ПостановкаУстановленаДа И НЕ ПостановкаУстановленаНет Тогда
		Показатели.Вставить("П000020003101", "");
		Показатели.Вставить("П000020003102", "V");
	КонецЕсли;
	
	СнятиеУстановленоДа = Показатели.Свойство("П000020003401") И ЗначениеЗаполнено(Показатели.П000020003401);
	СнятиеУстановленоНет = Показатели.Свойство("П000020003402") И ЗначениеЗаполнено(Показатели.П000020003402);
	
	Если НЕ СнятиеУстановленоДа И НЕ СнятиеУстановленоНет Тогда
		Показатели.Вставить("П000020003401", "");
		Показатели.Вставить("П000020003402", "V");
	КонецЕсли;
	
	Если НЕ Показатели.Свойство("П000020005004") Тогда
		Показатели.Вставить("П000020005004", 0);
	КонецЕсли;
	
	Если НЕ Показатели.Свойство("П000020006004") Тогда
		Показатели.Вставить("П000020006004", 0);
	КонецЕсли;
	
	Если НЕ Показатели.Свойство("П000020007004") Тогда
		Показатели.Вставить("П000020007004", 0);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СтрокаЧГ0(ИсходноеЧисло)
	
	Возврат Формат(ИсходноеЧисло, "ЧН=; ЧГ=0");
	
КонецФункции

&НаСервере
Функция СформироватьСтруктуруДанныхДопСтрокСтраницы(ИмяСтраницы) Экспорт
	
	Перем СтруктураДанныхДопСтрокРаздела;
	
	Если ИмяСтраницы = "Раздел2" Тогда
		
		// Так как раздел содержит несколько многострочных блоков,
		// то поочередно сохраняем данные дополнительных строк каждого блока.
		ОбновитьСтруктуруМногострочногоРаздела(СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_1);
		ОбновитьСтруктуруМногострочногоРаздела(СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_2);
		
		СтруктураДанныхДопСтрокРаздела = Новый Структура;
		
		ПромежуточнаяТаблица = Неопределено;
		мСтруктураМногострочныхРазделов.Свойство(СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_1, ПромежуточнаяТаблица);
		ПромежуточнаяТаблица = ЭтаФорма[ПромежуточнаяТаблица];
		ТаблицаДопСтрокРаздел2_1 = ЭтаФорма["Хранилище" + СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_1].Добавить().Таблица;
		КопироватьДанныеФормы(ПромежуточнаяТаблица, ТаблицаДопСтрокРаздел2_1);
		СтруктураДанныхДопСтрокРаздела.Вставить(СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_1, ТаблицаДопСтрокРаздел2_1);
		
		ПромежуточнаяТаблица = Неопределено;
		мСтруктураМногострочныхРазделов.Свойство(СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_2, ПромежуточнаяТаблица);
		ПромежуточнаяТаблица = ЭтаФорма[ПромежуточнаяТаблица];
		ТаблицаДопСтрокРаздел2_2 = ЭтаФорма["Хранилище" + СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_2].Добавить().Таблица;
		КопироватьДанныеФормы(ПромежуточнаяТаблица, ТаблицаДопСтрокРаздел2_2);
		СтруктураДанныхДопСтрокРаздела.Вставить(СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_2, ТаблицаДопСтрокРаздел2_2);
		
	КонецЕсли;
	
	Возврат СтруктураДанныхДопСтрокРаздела;
	
КонецФункции

&НаСервере
Процедура УдалитьДополнительнуюСтрокуДаты(ИмяОбласти, МногострочнаяЧасть, ИдМСЧ)
		
	ПозицияРазделителя = СтрНайти(ИмяОбласти, "_");
	ОсновноеИмяГиперссылки = Лев(ИмяОбласти, ПозицияРазделителя - 1);
	НомерГиперссылки = Число(Сред(ИмяОбласти, ПозицияРазделителя + 1));
	
	ОпорнаяОбласть = ТабличныйДокумент.Области[ИмяОбласти];
	
	УдаляемаяОбласть = ТабличныйДокумент.Область(ОпорнаяОбласть.Верх, , ОпорнаяОбласть.Верх + 1, );
	ТабличныйДокумент.УдалитьОбласть(УдаляемаяОбласть, ТипСмещенияТабличногоДокумента.ПоВертикали);
	
	Для Инд = НомерГиперссылки + 1 По МногострочнаяЧасть.Количество() Цикл
		ОбластьГиперссылки = ТабличныйДокумент.Области[ОсновноеИмяГиперссылки + "_" + СтрокаЧГ0(Инд)];
		ОбластьГиперссылки.Имя = ОсновноеИмяГиперссылки + "_" + СтрокаЧГ0(Инд - 1);
	КонецЦикла;
		
	Для Инд = НомерГиперссылки + 2 По МногострочнаяЧасть.Количество() Цикл
		ОбластьВводаДаты = ТабличныйДокумент.Области[ИдМСЧ + "01_" + СтрокаЧГ0(Инд)];
		ОбластьВводаДаты.Имя = ИдМСЧ + "01_" + СтрокаЧГ0(Инд - 1);
	КонецЦикла;
	
	ИндексУдаляемойСтроки = НомерГиперссылки;
	МногострочнаяЧасть.Удалить(ИндексУдаляемойСтроки);
	
	КопироватьДанныеФормы(МногострочнаяЧасть, ЭтаФорма[мСтруктураМногострочныхРазделов[ИдМСЧ]]);
	
	РассчитатьДниОсуществленияДеятельности();
	
	Модифицированность = Истина;
			
	РасчетНаСервере("Раздел2", ИдМСЧ);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьДеревоНастройкиСтраниц(Знач СохраненныйДок)
	
	Если СохраненныйДок <> Неопределено Тогда
		
		Если ТипЗнч(СохраненныйДок) = Тип("ДокументСсылка.РегламентированныйОтчет") Тогда
			СохраненныйДок = СохраненныйДок.ПолучитьОбъект();
		КонецЕсли;
		
		Если Не СохраненныйДок.ЭтоНовый() Тогда
			// Сохраняем выбранные листы для печати в хранилище
			ХранилищеДанных = Новый ХранилищеЗначения(РеквизитФормыВЗначение("мДеревоСтраницОтчета"));
			СохраненныйДок.ДеревоНастройкиСтраниц = ХранилищеДанных;
			Попытка
				СохраненныйДок.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
Конецпроцедуры

&НаСервере
Процедура ЗаполнитьНачальныеНастройки()
	
	ЭтаФормаИмя = ЭтаФорма.ИмяФормы;
	МакетСоставаПоказателей = ОбъектОтчета(ЭтаФормаИмя).ПолучитьМакет(СтруктураРеквизитовФормы.мСоставПоказателей);
	
	ОписаниеТиповСтрока15  = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(15));
	ОписаниеТиповСтрока50  = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50));
	ОписаниеТиповСтрока100 = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100));
	ОписаниеТиповЧисло1    = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(1));
	
	Для Инд = 0 По МакетСоставаПоказателей.Области.Количество() - 1 Цикл
				
		ТекОбласть    = МакетСоставаПоказателей.Области[Инд];
		ИмяСтраницы   = ТекОбласть.Имя;
		
		ЭтаФорма["ТаблицаВариантыЗаполнения" + ИмяСтраницы].Добавить();
		
		// Таблица значений содержит информацию о вариантах заполнения показателя отчета.
		// В колонках таблицы значений отображается следующая информация:
		//   - имя ячейки (код показателя);
		//   - вариант заполнения ячейки;
		//   - вычисленное по данным ИБ значение ячейки;
		//   - величина автокорректировки значения ячейки;
		//   - примечание к ячейке.
		//
				
		Для Ном = ТекОбласть.Верх По ТекОбласть.Низ Цикл
			// перебираем строки макета
            					
			// Код показателя (по составу показателей) определяется по первой колонке макета
			КодПоказателя = СокрП(МакетСоставаПоказателей.Область(Ном, 1).Текст);
			ИмяПоказателя = КодПоказателя;

			Если КодПоказателя = "===" Тогда         // признак конечной строки
				Прервать;
			КонецЕсли;

			Если Лев(КодПоказателя, 2) = "//" Тогда  // пропускаем комментарии
				Продолжить;
			КонецЕсли;

			// код показателя по форме отчете (имя ячейки в полях табличного документа формы)
			КодПоказателяПоФорме = СокрЛП(МакетСоставаПоказателей.Область(Ном, 2).Текст);
			// признак многострочности определяется по третьей колонке макета
			ПризнМногострочность = СокрЛП(МакетСоставаПоказателей.Область(Ном, 3).Текст);
			// по четвертой колонке определяется тип данных реквизита
			ТипДанныхРеквизита   = СокрЛП(МакетСоставаПоказателей.Область(Ном, 4).Текст);
			// по колонке 5 определяется исходное количество строк многострочного раздела
			стрКолСтрокИсходный  = СокрЛП(МакетСоставаПоказателей.Область(Ном, 5).Текст);
			// вариант заполнения ячейки определяется по колонке 6 макета
			стрВариантЗаполнения = РегламентированнаяОтчетность.ПолучитьВариантЗаполненияПоказателяРегОтчета(МакетСоставаПоказателей, Ном);
			// код показателя из структуры, берется из колонки 9
			КодПоказателяПоСтруктуре = СокрЛП(МакетСоставаПоказателей.Область(Ном, 9).Текст);

			чКолСтрокИсходный    = ? (ПустаяСтрока(стрКолСтрокИсходный),  0, Число(стрКолСтрокИсходный));
			чВариантЗаполнения   = ? (ПустаяСтрока(стрВариантЗаполнения), 0, Число(стрВариантЗаполнения));

			// формируем таблицу значений, содержащей состав показателей отчета
			НоваяСтрока = мТаблицаСоставПоказателей.Добавить();
			НоваяСтрока.ИмяПоляТаблДокумента   = ИмяСтраницы;
			НоваяСтрока.КодПоказателяПоСоставу = КодПоказателя;
			НоваяСтрока.КодПоказателяПоФорме   = КодПоказателяПоФорме;
			НоваяСтрока.ПризнМногострочности   = ПризнМногострочность;
			НоваяСтрока.ТипДанныхПоказателя    = ТипДанныхРеквизита;
			НоваяСтрока.КодПоказателяПоСтруктуре = КодПоказателяпоСтруктуре;

			Если чВариантЗаполнения <> 0 Тогда
				// Если в колонке 6 задан вариант заполнения показателя, 
				// то его значение может определяться по данным ИБ.
				// Дополняем таблицу значений вариантов заполнения
				НоваяСтрока = ЭтаФорма["ТаблицаВариантыЗаполнения" + ИмяСтраницы][0].ТаблицаВариантовЗаполнения.Добавить();
				НоваяСтрока.КодПоказателя      = ? (Не ПустаяСтрока(КодПоказателяПоФорме), КодПоказателяПоФорме, КодПоказателя);
				НоваяСтрока.ВариантЗаполнения  = чВариантЗаполнения;
				НоваяСтрока.КодПоказателяПоСтруктуре  = КодПоказателяПоСтруктуре;
			КонецЕсли;

		КонецЦикла;

		Если ЭтаФорма["ТаблицаВариантыЗаполнения" + ИмяСтраницы][0].ТаблицаВариантовЗаполнения.Количество() > 0 Тогда
			// имеются автоматически заполняемые ячейки
            
			// Создаем структуру, содержащей варианты заполнения показателей отчета.
			//
			// В качестве ключа используется имя страницы основной панели формы, содержащей
			//   табличный документ с автоматически заполняемыми показателями.
			// В качестве значения принимаем Массив из таблицы значений - вариантов заполнения
			//   показателей по каждой странице многостраничного раздела.
			//
			мСтруктураВариантыЗаполнения.Вставить(ИмяСтраницы, ИмяСтраницы);
			мСтруктураВариантыЗаполненияЭталон.Вставить(ИмяСтраницы, ИмяСтраницы);
						
		Конецесли;

	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ФормироватьСтруктуруСтраницОтчета() 

	// Дерево содержит коллекцию страниц отчета.
	// В колонках дерева хранятся следующие данные:
	//    - представление листа;
	//    - имя страницы основной панели формы, содержащей выводимый на печать лист;
	//    - имя поля табличного документа;
	//    - имя области ячеек табличного документа (используется в случае вывода
	//      на печать отдельных страниц титульного листа);
	//    - ориентация страницы при печати;
	//    - число, метка вывода страницы на печать;
	//    - число, метка показа страницы на основной панели формы;
	//    - число, метка выгрузки данных страницы в ИМНС.
	//

	мДеревоСтраницОтчета.ПолучитьЭлементы().Очистить();

	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Титульный";
	СтрокаУровня1.Представление            = "Титульный лист";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 2;

	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Раздел1";
	СтрокаУровня1.Представление            = "Раздел 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 2;

	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Раздел2";
	СтрокаУровня1.Представление            = "Раздел 2";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 2;
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Раздел3";
	СтрокаУровня1.Представление            = "Раздел 3";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 2;
	
КонецПроцедуры

&НаСервере
Процедура ФормироватьСтруктуруСвойствСтраниц() Экспорт
		
	мСвойстваРазделовДекларации.ПолучитьЭлементы().Очистить();

	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	
	СтрокаУровня1.ИмяСтраницы                          = "Титульный";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.ОчищатьРаздел                        = Ложь;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;

	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Раздел1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Истина;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;

	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Раздел2";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Истина;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "П000020000100";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Раздел3";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "П000030000100";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
    	
КонецПроцедуры

&НаСервере
Процедура СформироватьДеревоРазделовОтчетаНаСервере() Экспорт
	
	СформироватьДеревоРазделовОтчета(ЭтаФорма);
			
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДеревоРазделовОтчетаНаКлиенте() Экспорт
	
	СформироватьДеревоРазделовОтчета(ЭтаФорма);
			
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьДеревоРазделовОтчета(Форма)
	
	Форма["РазделыОтчета"].ПолучитьЭлементы().Очистить();
	
	Для Каждого ЭлементДереваСтраницОтчета Из Форма["мДеревоСтраницОтчета"].ПолучитьЭлементы() Цикл
		
		Если ЭлементДереваСтраницОтчета.ПоказатьСтраницу = 1 Тогда
			
			ЭлементРазделовОтчета = Форма["РазделыОтчета"].ПолучитьЭлементы().Добавить();
			ЭлементРазделовОтчета.КолонкаРазделыОтчета         = ЭлементДереваСтраницОтчета.Представление;
			ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим = ЭлементДереваСтраницОтчета.ИмяСтраницы;
			ЭлементРазделовОтчета.ИндексКартинки               = 1;
			ЭлементРазделовОтчета.РазделМногостраничный        = Ложь;
			ЭлементРазделовОтчета.РазделМногострочный          = РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(Форма, "мТаблицаМногострочныхРазделов");
			
			НайденноеЗначение = Неопределено;
			
			Если Форма["мСтруктураМногостраничныхРазделов"].Свойство(ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим, НайденноеЗначение) Тогда
				
				Если НЕ НайденноеЗначение = Неопределено Тогда
					
					НайденноеЗначение = Форма[НайденноеЗначение];
					
					ЭлементРазделовОтчета.ИндексКартинки        = 0;
					ЭлементРазделовОтчета.РазделМногостраничный = Истина;
					
					Для НомерСтраницы = 1 По НайденноеЗначение.Количество() Цикл
						
						СтраницаРазделаОтчета = ЭлементРазделовОтчета.ПолучитьЭлементы().Добавить();
						
						СтраницаРазделаОтчета.КолонкаРазделыОтчета              = "Стр. " + НомерСтраницы;
						СтраницаРазделаОтчета.КолонкаРазделыОтчетаСокрНаим      = ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим;
						СтраницаРазделаОтчета.КолонкаНомерСтраницыРазделаОтчета = НомерСтраницы;
						СтраницаРазделаОтчета.ИндексКартинки                    = 1;
						СтраницаРазделаОтчета.РазделМногостраничный             = ЭлементРазделовОтчета.РазделМногостраничный;
						СтраницаРазделаОтчета.РазделМногострочный               = ЭлементРазделовОтчета.РазделМногострочный;
						
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЕсли;
				
		КонецЕсли;
				
	КонецЦикла;
			
КонецПроцедуры

&НаСервере
Процедура СформироватьСпискиВыбора()
	
	МакетСоставаПоказателей = ОбъектОтчета(ЭтаФорма.ИмяФормы).ПолучитьМакет("Списки2012Кв1");
	
	КоллекцияСписковВыбора = Новый Соответствие;
	Для Каждого Область Из МакетСоставаПоказателей.Области Цикл
		Если Область.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Строки Тогда
			ВерхОбласти = Область.Верх;
			НизОбласти = Область.Низ;
			ТаблСписка = Новый ТаблицаЗначений;
			ТаблСписка.Колонки.Добавить("Код",,, МакетСоставаПоказателей.Область(ВерхОбласти, 1, ВерхОбласти, 1).ШиринаКолонки);
			ТаблСписка.Колонки.Добавить("Название",,, МакетСоставаПоказателей.Область(ВерхОбласти, 2, ВерхОбласти, 2).ШиринаКолонки);
			ТаблСписка.Колонки.Добавить("РезультатПроверки",,, 0);
			//только для данного отчета (ЕНВД) вводится дополнительная колонка
			ТаблСписка.Колонки.Добавить("БазоваяДоходность",,, МакетСоставаПоказателей.Область(ВерхОбласти, 2, ВерхОбласти, 2).ШиринаКолонки);
			Для НомСтр = ВерхОбласти По НизОбласти Цикл
				КодПоказателя = СокрП(МакетСоставаПоказателей.Область(НомСтр, 1).Текст);
				Если КодПоказателя <> "###" Тогда
					НовСтрока = ТаблСписка.Добавить();
					НовСтрока.Код = КодПоказателя;
					НовСтрока.Название = СокрП(МакетСоставаПоказателей.Область(НомСтр, 2).Текст);
					НовСтрока.РезультатПроверки = СокрП(МакетСоставаПоказателей.Область(НомСтр, 3).Текст);
					//только для данного отчета (ЕНВД) вводится дополнительная колонка
					ТекстБазоваяДоходность = СокрП(МакетСоставаПоказателей.Область(НомСтр, 4).Текст);
					НовСтрока.БазоваяДоходность = ?(РегламентированнаяОтчетностьКлиентСервер.ЯвляетсяЧислом(ТекстБазоваяДоходность), Число(ТекстБазоваяДоходность), 0);
				КонецЕсли;
			КонецЦикла;
			КоллекцияСписковВыбора.Вставить(Область.Имя, ТаблСписка);
		КонецЕсли;
	КонецЦикла;
	
	СвойстваПоказателей.Очистить();
	
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "Период", 2, , "Выбор кода налогового периода", КоллекцияСписковВыбора["КодыПериодов"]);
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "ПоМесту", 3, , "Выбор места представления", КоллекцияСписковВыбора["МестаПредставления"]);
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "ФормаРеорганизации", 1, , "Выбор формы реорганизации", КоллекцияСписковВыбора["ФормыРеорганизации"]);
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П000010001003", 20, , "Выбор КБК", КоллекцияСписковВыбора["КодыКБК"]);
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П000020001000", 2, , "Выбор кода вида предпринимательской деятельности", КоллекцияСписковВыбора["КодыВидовДеятельности"]);
		
	Для Инд = 1 По 8 Цикл
		РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П000010002003_" + Инд, 11, "ОКАТО");
	КонецЦикла;
	
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П000020003000", 11, "ОКАТО");								
	
КонецПроцедуры

&НаСервере
Функция ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(ИмяЛиста = Неопределено) Экспорт
	
	ИдГрупп = Новый Структура;
	ИдГрупп.Вставить("ИдМСЧ_Раздел2_1", СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_1);
	ИдГрупп.Вставить("ИдМСЧ_Раздел2_2", СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_2);
			
	Возврат ОпределитьИдМногострочногоРазделаПоАктивнойСтранице(ИмяЛиста, , ИдГрупп);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОпределитьИдМногострочногоРазделаПоАктивнойСтранице(ИмяЛиста = Неопределено, ТекущаяСтраница, ИдГрупп)
	Перем ИмяГруппы;
    	
	Если ИмяЛиста = Неопределено Тогда
        ИмяТекущейСтраницыПанели = ТекущаяСтраница.Имя;
	Иначе
		ИмяТекущейСтраницыПанели = ИмяЛиста;
	КонецЕсли;

	Если ИмяТекущейСтраницыПанели = "Раздел2" Тогда
		ИмяГруппы = ИдГрупп.ИдМСЧ_Раздел2_1;
	КонецЕсли;

	Возврат ИмяГруппы;

КонецФункции

&НаСервере
Процедура ВосстановитьСохраненныеДанные()
	Перем ДанныеМногостраничныхРазделов;
	Перем ДанныеВариановАвтоЗаполнения;
	Перем ПоказателиОтчета;
	Перем Автозаполнение;
	Перем ТаблицаМногостраничногоДокумента;
	Перем ВерсияФормы;

	Если НЕ ЗначениеЗаполнено(СтруктураРеквизитовФормы.Организация) Тогда
		СтруктураРеквизитовФормы.Организация =	СтруктураРеквизитовФормы.мСохраненныйДок.Организация;
	КонецЕсли;
	
	ДатаПодписи			   = СтруктураРеквизитовФормы.мСохраненныйДок.ДатаПодписи;
	СтруктураРеквизитовФормы.ЕдиницаИзмерения 		   = СтруктураРеквизитовФормы.мСохраненныйДок.ЕдиницаИзмерения;
	СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения  = СтруктураРеквизитовФормы.мСохраненныйДок.ТочностьЕдиницыИзмерения;
	Комментарий					   = СтруктураРеквизитовФормы.мСохраненныйДок.Комментарий;

	СписокСохранения = СтруктураРеквизитовФормы.мСохраненныйДок.ДанныеОтчета.Получить();
	
	ДеревоНастройкиСтраниц = СтруктураРеквизитовФормы.мСохраненныйДок.ДеревоНастройкиСтраниц.Получить();
	ЗначениеВРеквизитФормы(ДеревоНастройкиСтраниц.Скопировать(), "мДеревоСтраницОтчета");
	    	
	Если СписокСохранения.Свойство("ДанныеВариантовАвтоЗаполнения", ДанныеВариановАвтоЗаполнения) Тогда
		
		Если НЕ ДанныеВариановАвтоЗаполнения = Неопределено Тогда
			
			мСтруктураВариантыЗаполнения.Очистить();
			
			Для Каждого ЭлементСтруктуры Из ДанныеВариановАвтоЗаполнения Цикл
				
				мСтруктураВариантыЗаполнения.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Ключ);
				
				ЭтаФорма["ТаблицаВариантыЗаполнения" + ЭлементСтруктуры.Ключ].Очистить();
				
				Для Каждого ЭлементМассива Из ЭлементСтруктуры.Значение Цикл
					
					Если ЭлементСтруктуры.Ключ = "Раздел3" Тогда
					
						Элемент = ЭлементМассива.НайтиСтроки(Новый Структура("КодПоказателя", "П000030001003"));
						
						Если Элемент.Количество() > 0 Тогда
						
							ЭлементМассива.Удалить(ЭлементМассива.Индекс(Элемент[0]));
						
						КонецЕсли; 
						
						Элемент = ЭлементМассива.НайтиСтроки(Новый Структура("КодПоказателя", "П000030002003"));
						
						Если Элемент.Количество() > 0 Тогда
						
							ЭлементМассива.Удалить(ЭлементМассива.Индекс(Элемент[0]));
						
						КонецЕсли; 
					КонецЕсли;
					
					ТаблВарЗаполнения = ЭтаФорма["ТаблицаВариантыЗаполнения" + ЭлементСтруктуры.Ключ].Добавить().ТаблицаВариантовЗаполнения;
										
					ЗначениеВДанныеФормы(ЭлементМассива, ТаблВарЗаполнения);
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;

	СписокСохранения.Свойство("ПоказателиОтчета", ПоказателиОтчета);
	
	ВерсияФормыИзменилась = Ложь;
	Если СписокСохранения.Свойство("ВерсияФормы", ВерсияФормы) И (ВерсияФормы <> СтруктураРеквизитовФормы.мВерсияФормы) Тогда
		ВерсияФормыИзменилась = Истина;
	КонецЕсли;
		
	// восстанавливаем сохраненные данные многостраничных разделов
	Если СписокСохранения.Свойство("ДанныеМногостраничныхРазделов", ДанныеМногостраничныхРазделов) Тогда
		
		Если ВерсияФормыИзменилась Тогда
			
			ДанныеМногостраничныхРазделов.Свойство("Раздел2", ТаблицаМногостраничногоДокумента);
			
			Если ТаблицаМногостраничногоДокумента.Колонки.Найти("ДанныеДопСтрок") = Неопределено Тогда
				ТаблицаМногостраничногоДокумента.Колонки.Добавить("ДанныеДопСтрок");
			КонецЕсли;
			
			СтруктураМногострочногоРаздела2_1 = ДанныеФормыВЗначение(ЭтаФорма[мСтруктураМногострочныхРазделов[СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_1]], Тип("ТаблицаЗначений"));
			СтруктураМногострочногоРаздела2_2 = ДанныеФормыВЗначение(ЭтаФорма[мСтруктураМногострочныхРазделов[СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_2]], Тип("ТаблицаЗначений"));
			
			Для Каждого Страница Из ТаблицаМногостраничногоДокумента Цикл
				
				ВосстановитьСведенияОПостановкеНаУчет(Страница);
				
				Если Страница.ДанныеДопСтрок = Неопределено Тогда
					
					ДанныеМСЧ = Новый Структура;
					ДанныеМСЧ.Вставить(СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_1, СтруктураМногострочногоРаздела2_1.Скопировать());
					ДанныеМСЧ.Вставить(СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_2, СтруктураМногострочногоРаздела2_2.Скопировать());
					Страница.ДанныеДопстрок = ДанныеМСЧ;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Для Каждого ЭлементСтруктуры Из ДанныеМногостраничныхРазделов Цикл
					
			НайденноеЗначение = Неопределено;
			
			мСтруктураМногостраничныхРазделов.Свойство(ЭлементСтруктуры.Ключ, НайденноеЗначение);
			
			Если НЕ НайденноеЗначение = Неопределено Тогда
				
				НайденноеЗначение = ЭтаФорма[НайденноеЗначение];
				
				ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, НайденноеЗначение);
				                     				
				Если НайденноеЗначение[0].Свойство("Данные") Тогда
					
					Для Каждого СтрокаТаблЗнач Из НайденноеЗначение Цикл
						
						Если ТипЗнч(СтрокаТаблЗнач.Данные) = Тип("СписокЗначений") Тогда
							
							СтрокаТаблЗнач.Данные.Очистить();
							СтрокаТаблЗнач.Данные.Добавить(ЭлементСтруктуры.Значение[НайденноеЗначение.Индекс(СтрокаТаблЗнач)].Данные);
							
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
								
				Если НайденноеЗначение[0].Свойство("ДанныеДопСтрок") Тогда
					
					Ном = 0;
					
					Для Каждого СтрокаТаблЗнач Из ЭлементСтруктуры.Значение Цикл
						
						Если ТипЗнч(СтрокаТаблЗнач.ДанныеДопСтрок) = Тип("Структура") Тогда
							
							СтруктураДопСтрок = Новый Структура;
							
							Для Каждого ЭлСтруктуры Из СтрокаТаблЗнач.ДанныеДопСтрок Цикл
								
								ТаблЗнач = ЭлСтруктуры.Значение;
								
								СтрокаТаблЗначДанныеДопСтрок = ЭтаФорма["Хранилище" + ЭлСтруктуры.Ключ].Добавить().Таблица;
								
								ЗначениеВДанныеФормы(ТаблЗнач, СтрокаТаблЗначДанныеДопСтрок);
								
								СтруктураДопСтрок.Вставить(ЭлСтруктуры.Ключ, СтрокаТаблЗначДанныеДопСтрок);
                                								
							КонецЦикла;
							
							НайденноеЗначение[Ном].ДанныеДопСтрок.Добавить(СтруктураДопСтрок, "ДанныеФормыКоллекцияТаблицаДопСтрокРаздела");
							
						КонецЕсли;
						
						Ном = Ном + 1;
						
					КонецЦикла;
					
				КонецЕсли;
								   				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
      
	СписокСохранения.Свойство("ФлПодсчетСтраниц", СтруктураРеквизитовФормы.мСчетчикСтраниц);
	СписокСохранения.Свойство("ФлПроверятьСоотношенияПриПечатиИВыгрузки", СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки);
	СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки = ?(СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки = Неопределено, Ложь, СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки);
	СписокСохранения.Свойство("ФлОтклВыборЗначений", СтруктураРеквизитовФормы.мАвтоВыборКодов);
	СтруктураРеквизитовФормы.мАвтоВыборКодов = ?(СтруктураРеквизитовФормы.мАвтоВыборКодов = Неопределено, Ложь, СтруктураРеквизитовФормы.мАвтоВыборКодов);

	СписокСохранения.Свойство("Автозаполнение", Автозаполнение);
	СтруктураРеквизитовФормы.ФлажокОтклАвтоРасчет = Автозаполнение;
	
 	Если НЕ СписокСохранения.Свойство("ПечатьБезШтрихкодаРазрешена", СтруктураРеквизитовФормы.мПечатьБезШтрихкодаРазрешена) Тогда
		СтруктураРеквизитовФормы.мПечатьБезШтрихкодаРазрешена = Ложь;
	КонецЕсли;
	 	
	СформироватьДеревоРазделовОтчетаНаСервере();
	
	Префикс = "ПолеТабличногоДокумента";
    	
	Для Каждого Раздел Из мСвойстваРазделовДекларации.ПолучитьЭлементы() Цикл	
		
		Если НЕ Раздел.МногостраничностьВРазделе Тогда
			ЭтаФорма["СтруктураДанных" + Раздел.ИмяСтраницы] = ПоказателиОтчета[Префикс + Раздел.ИмяСтраницы];
		КонецЕсли;
	
	КонецЦикла;
	
	ВосстановитьСведенияОбОрганизацииИзТитульногоЛистаСтарогоОбразца(ПоказателиОтчета);
		
	ИмяТекРаздела = "Титульный";
	
	Для Каждого ЭлСтруктуры Из ЭтаФорма["СтруктураДанных" + ИмяТекРаздела] Цикл
		Попытка
			ТабличныйДокумент.Области[ЭлСтруктуры.Ключ].Значение = ЭлСтруктуры.Значение;
		Исключение
		КонецПопытки;
	КонецЦикла;
              	
	РегламентированнаяОтчетность.ОперацииПриВосстановленииРегламентированногоОтчета(ЭтаФорма);

	КопироватьДанныеФормы(мДеревоСтраницОтчета, мДеревоВыбранныхСтраниц);
 
	ОтобразитьНомерКорректировки(ЭтаФорма);
	
	РасчетНаСервере("Раздел3");
	
 	Модифицированность   = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьСведенияОбОрганизацииИзТитульногоЛистаСтарогоОбразца(ПоказателиОтчета)
	
	ПоказателиТаблПоле = ПоказателиОтчета["ПолеТабличногоДокументаТитульный"];
	
	Для Каждого Показатель Из ПоказателиТаблПоле Цикл
		
		ИмяПоказателя = Показатель.Ключ;
		
		Если ИмяПоказателя = "ИНН1_1" Тогда
			СтруктураДанныхТитульный.Вставить("ИНН1");
			Для Ном = 1 По 12 Цикл
				СтруктураДанныхТитульный.ИНН1 = СокрЛП(СтруктураДанныхТитульный.ИНН1) + ПоказателиТаблПоле["ИНН1_" + Ном];
				СтруктураДанныхТитульный.Удалить("ИНН1_" + Ном);
			КонецЦикла;
			Если Лев(СтруктураДанныхТитульный.ИНН1, 2) = "00" Тогда
				СтруктураДанныхТитульный.ИНН1 = Сред(СтруктураДанныхТитульный.ИНН1, 3);
			КонецЕсли;
			Если Прав(СтруктураДанныхТитульный.ИНН1, 2) = "--" Тогда
				СтруктураДанныхТитульный.ИНН1 = Лев(СтруктураДанныхТитульный.ИНН1, СтрНайти(СтруктураДанныхТитульный.ИНН1, "--") - 1);
			КонецЕсли;
		ИначеЕсли ИмяПоказателя = "КПП1_1" Тогда
			СтруктураДанныхТитульный.Вставить("КПП1");
			Для Ном = 1 По 9 Цикл
				СтруктураДанныхТитульный.КПП1 = СокрЛП(СтруктураДанныхТитульный.КПП1) + ПоказателиТаблПоле["КПП1_" + Ном];
				СтруктураДанныхТитульный.Удалить("КПП1_" + Ном);
			КонецЦикла;
		ИначеЕсли ИмяПоказателя = "НомерКорректировки1" Тогда
			СтруктураДанныхТитульный.Вставить("НомерКорректировки");
			Для Ном = 1 По 3 Цикл
				СтруктураДанныхТитульный.НомерКорректировки = СокрЛП(СтруктураДанныхТитульный.НомерКорректировки) + ПоказателиТаблПоле["НомерКорректировки" + Ном];
				СтруктураДанныхТитульный.Удалить("НомерКорректировки" + Ном);
			КонецЦикла;				
		ИначеЕсли ИмяПоказателя = "Период1" Тогда
			СтруктураДанныхТитульный.Вставить("Период");
			Для Ном = 1 По 2 Цикл
				СтруктураДанныхТитульный.Период = СокрЛП(СтруктураДанныхТитульный.Период) + ПоказателиТаблПоле["Период" + Ном];
				СтруктураДанныхТитульный.Удалить("Период" + Ном);
			КонецЦикла;					
		ИначеЕсли ИмяПоказателя = "ОтчетГод1" Тогда
			СтруктураДанныхТитульный.Вставить("ОтчетГод");
			Для Ном = 1 По 4 Цикл
				СтруктураДанныхТитульный.ОтчетГод = СокрЛП(СтруктураДанныхТитульный.ОтчетГод) + ПоказателиТаблПоле["ОтчетГод" + Ном];
				СтруктураДанныхТитульный.Удалить("ОтчетГод" + Ном);
			КонецЦикла;						
		ИначеЕсли ИмяПоказателя = "КодИМНС1" Тогда
			СтруктураДанныхТитульный.Вставить("КодИМНС");
			Для Ном = 1 По 4 Цикл
				СтруктураДанныхТитульный.КодИМНС = СокрЛП(СтруктураДанныхТитульный.КодИМНС) + ПоказателиТаблПоле["КодИМНС" + Ном];
				СтруктураДанныхТитульный.Удалить("КодИМНС" + Ном);
			КонецЦикла;	
		ИначеЕсли ИмяПоказателя = "ПоМесту1" Тогда
			СтруктураДанныхТитульный.Вставить("ПоМесту");
			Для Ном = 1 По 3 Цикл
				СтруктураДанныхТитульный.ПоМесту = СокрЛП(СтруктураДанныхТитульный.ПоМесту) + ПоказателиТаблПоле["ПоМесту" + Ном];
				СтруктураДанныхТитульный.Удалить("ПоМесту" + Ном);
			КонецЦикла;		
		ИначеЕсли ИмяПоказателя = "Прил1" Тогда
			СтруктураДанныхТитульный.Вставить("Прил");
			Для Ном = 1 По 3 Цикл
				СтруктураДанныхТитульный.Прил = СокрЛП(СтруктураДанныхТитульный.Прил) + ПоказателиТаблПоле["Прил" + Ном];
				СтруктураДанныхТитульный.Удалить("Прил" + Ном);
			КонецЦикла;				
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаполнитьДатуПодписи(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОтобразитьНомерКорректировки(Форма)
	
	НомерКорр = Форма.СтруктураРеквизитовФормы.ВидДокумента * Форма.НомерКорректировки;
	НомерКорректировкиСтрока = Формат(НомерКорр, "ЧН=0; ЧГ=");
	
	Форма.ТабличныйДокумент.Области.НомерКорректировки.Значение = НомерКорректировкиСтрока;
			
Конецпроцедуры

&НаСервере
Процедура УстановитьФорматВыводаВПоляхВводаНаСервере(НаимРаздела)
	
	УстановитьФорматВыводаВПоляхВвода(ЭтаФорма, НаимРаздела);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФорматВыводаВПоляхВводаНаКлиенте(НаимРаздела)
	
	УстановитьФорматВыводаВПоляхВвода(ЭтаФорма, НаимРаздела);
	
КонецПроцедуры
    
&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьФорматВыводаВПоляхВвода(Форма, НаимРаздела) Экспорт
	Перем СтруктураГруппы;

	Если Форма.СтруктураРеквизитовФормы.ЕдиницаИзмерения = Форма.ПорядкиОкругленияОтчетности.ПеречислениеПорядкиОкругленияОтчетностиОкр1 Тогда
		Форма.СтруктураРеквизитовФормы.мСтрокаФормата = "; ЧДЦ = " + Форма.СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения + "; ЧРД=,; ЧН=-; ЧС = 0";
	ИначеЕсли Форма.СтруктураРеквизитовФормы.ЕдиницаИзмерения = Форма.ПорядкиОкругленияОтчетности.ПеречислениеПорядкиОкругленияОтчетностиОкр1000 Тогда
		Форма.СтруктураРеквизитовФормы.мСтрокаФормата = "; ЧДЦ = " + Форма.СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения + "; ЧРД=,; ЧН=-; ЧС = 3";
	ИначеЕсли Форма.СтруктураРеквизитовФормы.ЕдиницаИзмерения = Форма.ПорядкиОкругленияОтчетности.ПеречислениеПорядкиОкругленияОтчетностиОкр1000000 Тогда
		Форма.СтруктураРеквизитовФормы.мСтрокаФормата = "; ЧДЦ = " + Форма.СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения + "; ЧРД=,; ЧН=-; ЧС = 6";
	КонецЕсли;

	Для Каждого СтрПоказатели Из Форма.мТаблицаСоставПоказателей Цикл

		Если НЕ НаимРаздела = СтрПоказатели.ИмяПоляТаблДокумента Тогда
			Продолжить;
		КонецЕсли;
		
		КодПоказателя				= СокрП(СтрПоказатели.КодПоказателяПоСоставу);
		ПризнМногострочность		= СокрП(СтрПоказатели.ПризнМногострочности);
		КодПоказателяПоСтруктуре	= СокрП(СтрПоказатели.КодПоказателяПоСтруктуре);
		КодПоказателяПоФорме		= СокрП(СтрПоказатели.КодПоказателяПоФорме);
		ТипДанныхПоказателя			= СокрП(СтрПоказатели.ТипДанныхПоказателя);
		ИмяПоказателя				= ?(ПустаяСтрока(СтрПоказатели.КодПоказателяПоФорме), КодПоказателя, КодПоказателяПоФорме);

		Если ПустаяСтрока(КодПоказателя) ИЛИ КодПоказателя = "===" ИЛИ КодПоказателя = "###" ИЛИ Лев(КодПоказателя, 2) = "//" Тогда
			Продолжить;
		КонецЕсли;

		Если ТипДанныхПоказателя = "Е" И ПустаяСтрока(КодПоказателяПоСтруктуре) Тогда
			ТекТабличноеПоле = Форма.ТабличныйДокумент;
			Если ПризнМногострочность <> "/" Тогда
				ФорматируемаяОбласть = ТекТабличноеПоле.Области[ИмяПоказателя];
				ДопустимыйЗнакПоказателя = ФорматируемаяОбласть.ТипЗначения.КвалификаторыЧисла.ДопустимыйЗнак;
				ЧислоЕЗнак = ПолучитьОписаниеТипаЧислаЕДляРаздела(НаимРаздела);
				
				Если ДопустимыйЗнакПоказателя = ДопустимыйЗнак.Неотрицательный Тогда
					ЧислоЕЗнак = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(ЧислоЕЗнак.КвалификаторыЧисла.Разрядность,ЧислоЕЗнак.КвалификаторыЧисла.РазрядностьДробнойЧасти, ДопустимыйЗнакПоказателя));
				КонецЕсли;
				ФорматируемаяОбласть.ТипЗначения = ЧислоЕЗнак;
				ФорматируемаяОбласть.Формат = "ЧЦ = " + ЧислоЕЗнак.КвалификаторыЧисла.Разрядность + Форма.СтруктураРеквизитовФормы.мСтрокаФормата;
			Иначе
				// определяем кол-во строк многострочного раздела и применяем процедуру форматирования к данной графе по всем строкам
				НСтр = 1;
				Пока ТекТабличноеПоле.Области.Найти(ИмяПоказателя + "_" + Формат(НСтр, "ЧГ=0")) <> Неопределено Цикл
					ФорматируемаяОбласть = ТекТабличноеПоле.Области[ИмяПоказателя + "_" + Формат(НСтр, "ЧГ=0")];
					ДопустимыйЗнакПоказателя = ФорматируемаяОбласть.ТипЗначения.КвалификаторыЧисла.ДопустимыйЗнак;
					ЧислоЕЗнак = ПолучитьОписаниеТипаЧислаЕДляРаздела(НаимРаздела);
					Если ДопустимыйЗнакПоказателя = ДопустимыйЗнак.Неотрицательный Тогда
						ЧислоЕЗнак = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(ЧислоЕЗнак.КвалификаторыЧисла.Разрядность,ЧислоЕЗнак.КвалификаторыЧисла.РазрядностьДробнойЧасти, ДопустимыйЗнакПоказателя));
					КонецЕсли;
					ФорматируемаяОбласть.ТипЗначения = ЧислоЕЗнак;
					ФорматируемаяОбласть.Формат = "ЧЦ = " + ЧислоЕЗнак.КвалификаторыЧисла.Разрядность + Форма.СтруктураРеквизитовФормы.мСтрокаФормата;
					НСтр = НСтр + 1;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьДатуПодписи(Форма)
    
	Форма.ТабличныйДокумент.Области.ДатаПодписи.Значение = ?(ЗначениеЗаполнено(Форма.ДатаПодписи), Формат(Форма.ДатаПодписи, "ДФ = 'дд.ММ.гггг'") + " г.", "");
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьПериод()
	
	Если СокрЛП(ТабличныйДокумент.Области.Период.Значение) = "" ИЛИ СтруктураРеквизитовФормы.мСкопированаФорма <> Неопределено Тогда
		
		// выводим признак периода на титульный лист
		НомерМесяца = Месяц(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
		
		ТабличныйДокумент.Области.Период.Значение = "2" + Строка(НомерМесяца / 3);
		
	КонецЕсли; 
	  	
	// выводим год на титульный лист
	ОтчетныйГод = Формат(Год(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета), "ЧГ=");
	ТабличныйДокумент.Области.ОтчетГод.Значение = ОтчетныйГод;

	СтруктураРеквизитовФормы.СтрПериодОтчета = ПредставлениеПериода(НачалоДня(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета), КонецДня(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета), "ФП = Истина");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияОбОрганизацииНаСервере(ВПрограммеИзмененаДатаПодписи = Ложь)
	
	ЗаполнитьСведенияОбОрганизации(ЭтаФорма, ВПрограммеИзмененаДатаПодписи);
		
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьСведенияОбОрганизации(Форма, ИзмененаДатаПодписи = Ложь)
    
	Если НЕ ИзмененаДатаПодписи Тогда
	
		СтрокаСведений = "ИННЮЛ, КППЮЛ, НаимЮЛПол, КодНО, НаимНО, ТипНП, ТелОрганизации, ФИО";
		СведенияОбОрганизации = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(Форма.СтруктураРеквизитовФормы.Организация, Форма.ДатаПодписи, СтрокаСведений);
	              		
		// заполняем ИНН
		ИНН = СокрЛП(СведенияОбОрганизации.ИННЮЛ);
		
		Форма.ТабличныйДокумент.Области.ИНН1.Значение = ИНН;
		
		// заполняем КПП
		КПП = СокрЛП(СведенияОбОрганизации.КППЮЛ);
		
		Форма.ТабличныйДокумент.Области.КПП1.Значение = КПП;
				
		// заполняем код ИФНС
		КодНО = СведенияОбОрганизации.КодНО;
		Для Инд = СтрДлина(СведенияОбОрганизации.КодНО) + 1 По 4 Цикл
			КодНО = " " + КодНО;
		КонецЦикла;
		
		Форма.ТабличныйДокумент.Области.КодИМНС.Значение = КодНО;
				
		Если Форма.СтруктураРеквизитовФормы.ИП Тогда
			НаименованиеОрганизации = СокрЛП(СведенияОбОрганизации.ФИО);
		Иначе
			НаименованиеОрганизации = СокрЛП(СведенияОбОрганизации.НаимЮлПол);
		КонецЕсли;
			
		Форма.ТабличныйДокумент.Области.НаимОрг.Значение = НаименованиеОрганизации;
		
		// заполняем телефон организации
		Форма.ТабличныйДокумент.Области.ТелОрганизации.Значение = СокрЛП(СведенияОбОрганизации.ТелОрганизации);
		
	КонецЕсли;
	
	РегламентированнаяОтчетность.ПолучитьЗначениеОКВЭД(Форма.ДатаПодписи, Форма.СтруктураРеквизитовФормы);
	РегламентированнаяОтчетностьКлиентСервер.УстановитьЗначениеОКВЭД(Форма.ДатаПодписи,
																	 Форма.СтруктураРеквизитовФормы,
																	 Форма.ТабличныйДокумент.Области.ОКВЭД.Значение);
	
	// заполняем сведения о подписантах
	Форма.ЗаполнитьСведенияОПодписантах();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияОПодписантах() Экспорт
	
	ТипПодписанта = "1";
	Подписант = "";
	НаименованиеОрганизацииПредставителя = "";
	ДокументПредставителя = "";
	
	//выясним, есть ли представитель
	КодНО = СокрЛП(ТабличныйДокумент.Области.КодИМНС.Значение);
	КПП   = СокрЛП(ТабличныйДокумент.Области.КПП1.Значение);

	СведенияОПредставителе = РегламентированнаяОтчетностьВызовСервера.ПолучитьПоКодамСведенияОПредставителе(СтруктураРеквизитовФормы.Организация, КодНО, КПП);
	
	ТипПодписанта = СведенияОПредставителе.ТипПодписанта;
	
	Если ТипПодписанта = "1" Тогда
		//представителя нет
		Если РегламентированнаяОтчетностьВызовСервера.ЭтоЮридическоеЛицо(СтруктураРеквизитовФормы.Организация) Тогда
			//подписант - руководитель
			СведенияОбОрганизации = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(СтруктураРеквизитовФормы.Организация, ДатаПодписи, "ФИОРук, ФИО");
			Подписант = СокрЛП(?(ЗначениеЗаполнено(СведенияОбОрганизации.ФИОРук), СведенияОбОрганизации.ФИОРук, СведенияОбОрганизации.ФИО));	
		КонецЕсли;
	Иначе
		//есть представитель, подписант - он
	    Подписант 								= СведенияОПредставителе.ФИОПредставителя;
 		НаименованиеОрганизацииПредставителя 	= СведенияОПредставителе.НаименованиеОрганизацииПредставителя;
		ДокументПредставителя 					= СведенияОПредставителе.ДокументПредставителя;
	КонецЕсли;
	
	ТабличныйДокумент.Области.ПрПодп.Значение = ТипПодписанта;
	ТабличныйДокумент.Области.ОргПодписант.Значение = Подписант;
	ТабличныйДокумент.Области.ОргУп.Значение = НаименованиеОрганизацииПредставителя;
	ТабличныйДокумент.Области.ДокУпПред.Значение = ДокументПредставителя;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦветФонаЯчейкиНаКлиенте(ИмяЯчейки = Неопределено, ВариантЗаполнения = Неопределено, ИмяТекущейСтраницыПанели = "") Экспорт
	
	РегламентированнаяОтчетностьКлиентСервер.УстановитьЦветФонаЯчейки(ЭтаФорма, ИмяЯчейки, ВариантЗаполнения, ИмяТекущейСтраницыПанели);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЦветФонаЯчейкиНаСервере(ИмяЯчейки = Неопределено, ВариантЗаполнения = Неопределено, ИмяТекущейСтраницыПанели = "") Экспорт
	
	РегламентированнаяОтчетностьКлиентСервер.УстановитьЦветФонаЯчейки(ЭтаФорма, ИмяЯчейки, ВариантЗаполнения, ИмяТекущейСтраницыПанели);
	
КонецПроцедуры

&НаСервере
Функция ОбновитьПеременныеМодуляНаСервере(ИмяПоказателя, ЗначениеПоказателя) Экспорт
    	
	ПеременныеМодуля = Новый Структура;
	ПеременныеМодуля.Вставить("мПредставительФизЛицо",  СтруктураРеквизитовФормы.мПредставительФизЛицо);
	ПеременныеМодуля.Вставить("мНазваниеПредставителя", СтруктураРеквизитовФормы.мНазваниеПредставителя);
	ПеременныеМодуля.Вставить("мДокументПредставителя", СтруктураРеквизитовФормы.мДокументПредставителя);
	ПеременныеМодуля.Вставить("мФамилияПредставителя",  СтруктураРеквизитовФормы.мФамилияПредставителя);
	ПеременныеМодуля.Вставить("мИмяПредставителя",      СтруктураРеквизитовФормы.мИмяПредставителя);
	ПеременныеМодуля.Вставить("мОтчествоПредставителя", СтруктураРеквизитовФормы.мОтчествоПредставителя);
	
	флОбновитьПеременныеМодуля = ОбновитьПеременныеМодуля(ИмяПоказателя, ЗначениеПоказателя, ПеременныеМодуля);
	
	СтруктураРеквизитовФормы.мПредставительФизЛицо  = ПеременныеМодуля.мПредставительФизЛицо;
	СтруктураРеквизитовФормы.мНазваниеПредставителя = ПеременныеМодуля.мНазваниеПредставителя;
	СтруктураРеквизитовФормы.мДокументПредставителя = ПеременныеМодуля.мДокументПредставителя;
	СтруктураРеквизитовФормы.мФамилияПредставителя  = ПеременныеМодуля.мФамилияПредставителя;
	СтруктураРеквизитовФормы.мИмяПредставителя      = ПеременныеМодуля.мИмяПредставителя;
	СтруктураРеквизитовФормы.мОтчествоПредставителя = ПеременныеМодуля.мОтчествоПредставителя;
	
	Возврат флОбновитьПеременныеМодуля;
	
КонецФункции

&НаКлиенте
Функция ОбновитьПеременныеМодуляНаКлиенте(ИмяПоказателя, ЗначениеПоказателя) Экспорт

	ПеременныеМодуля = Новый Структура;
	ПеременныеМодуля.Вставить("мПредставительФизЛицо",  СтруктураРеквизитовФормы.мПредставительФизЛицо);
	ПеременныеМодуля.Вставить("мНазваниеПредставителя", СтруктураРеквизитовФормы.мНазваниеПредставителя);
	ПеременныеМодуля.Вставить("мДокументПредставителя", СтруктураРеквизитовФормы.мДокументПредставителя);
	ПеременныеМодуля.Вставить("мФамилияПредставителя",  СтруктураРеквизитовФормы.мФамилияПредставителя);
	ПеременныеМодуля.Вставить("мИмяПредставителя",      СтруктураРеквизитовФормы.мИмяПредставителя);
	ПеременныеМодуля.Вставить("мОтчествоПредставителя", СтруктураРеквизитовФормы.мОтчествоПредставителя);
	
	флОбновитьПеременныеМодуля = ОбновитьПеременныеМодуля(ИмяПоказателя, ЗначениеПоказателя, ПеременныеМодуля);
	
	СтруктураРеквизитовФормы.мПредставительФизЛицо  = ПеременныеМодуля.мПредставительФизЛицо;
	СтруктураРеквизитовФормы.мНазваниеПредставителя = ПеременныеМодуля.мНазваниеПредставителя;
	СтруктураРеквизитовФормы.мДокументПредставителя = ПеременныеМодуля.мДокументПредставителя;
	СтруктураРеквизитовФормы.мФамилияПредставителя  = ПеременныеМодуля.мФамилияПредставителя;
	СтруктураРеквизитовФормы.мИмяПредставителя      = ПеременныеМодуля.мИмяПредставителя;
	СтруктураРеквизитовФормы.мОтчествоПредставителя = ПеременныеМодуля.мОтчествоПредставителя;
	
	Возврат флОбновитьПеременныеМодуля;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОбновитьПеременныеМодуля(ИмяПоказателя, ЗначениеПоказателя, ПеременныеМодуля)

	ИзмененияПроизошли = Ложь;

	Если Лев(ИмяПоказателя, 1) = "_" Тогда
		Возврат Истина;
	КонецЕсли;

	Если ИмяПоказателя = "ПредставительФизЛицо" Тогда
		ПеременныеМодуля.мПредставительФизЛицо = ЗначениеПоказателя;
		ИзмененияПроизошли = Истина;
	ИначеЕсли ИмяПоказателя = "НазваниеПредставителя" Тогда
		ПеременныеМодуля.мНазваниеПредставителя = ЗначениеПоказателя;
		ИзмененияПроизошли = Истина;
	ИначеЕсли ИмяПоказателя = "ДокументПредставителя" Тогда
		ПеременныеМодуля.мДокументПредставителя = ЗначениеПоказателя;
		ИзмененияПроизошли = Истина;
	ИначеЕсли ИмяПоказателя = "ФамилияПредставителя" Тогда
		ПеременныеМодуля.мФамилияПредставителя = ЗначениеПоказателя;
		ИзмененияПроизошли = Истина;
	ИначеЕсли ИмяПоказателя = "ИмяПредставителя" Тогда
		ПеременныеМодуля.мИмяПредставителя = ЗначениеПоказателя;
		ИзмененияПроизошли = Истина;
	ИначеЕсли ИмяПоказателя = "ОтчествоПредставителя" Тогда
		ПеременныеМодуля.мОтчествоПредставителя = ЗначениеПоказателя;
		ИзмененияПроизошли = Истина;
	КонецЕсли;

	Возврат ИзмененияПроизошли;

КонецФункции

&НаКлиенте
Процедура СохранитьОтчет(Команда)
	
	Если Элементы.РазделыОтчета.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНаКлиенте(Автосохранение = Ложь, ВыполняемоеОповещение = Неопределено) Экспорт
	
	Вариант = СтруктураРеквизитовФормы.ВидДокумента * НомерКорректировки;

	Если СтруктураДанныхТитульный.Количество() = 0
		ИЛИ СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Титульный" Тогда
		СтруктураДанныхТитульный.Вставить("КодИМНС", ТабличныйДокумент.Области.КодИМНС.Значение);
		СтруктураДанныхТитульный.Вставить("КПП1", ТабличныйДокумент.Области.КПП1.Значение);
	КонецЕсли;
	
	КодИФНС = СтруктураДанныхТитульный.КодИМНС;
	КПП = СтруктураДанныхТитульный.КПП1;
                      
	Если НЕ РегламентированнаяОтчетностьКлиент.ПриЗаписиРегламентированногоОтчетаНаКлиенте(ЭтаФорма, КодИФНС, Автосохранение, Вариант) Тогда
		Возврат;
	КонецЕсли;
	
	ПодобныйОтчетСуществует = Ложь;
	ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки = Ложь;
	
	Если Элементы.РазделыОтчета.ТекущиеДанные = Неопределено Тогда
		НаименованиеТекущегоРаздела = СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	Иначе
		НаименованиеТекущегоРаздела = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим;
	КонецЕсли;
	
	РезультатСохранения = ПередСохранением(КодИФНС, КПП, ПодобныйОтчетСуществует, Вариант, ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки, Автосохранение, НаименованиеТекущегоРаздела);
	
	ВидДокументаНомерКорректировкиИзменен = Неопределено;
	
	Если ПодобныйОтчетСуществует И Автосохранение Тогда
		Возврат;
	КонецЕсли;
	
	НуженВопросПередСохранением = (ПодобныйОтчетСуществует ИЛИ ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки);
	
	Если НуженВопросПередСохранением Тогда
		
		СохранитьНаКлиентеСВопросом(Автосохранение, Вариант, ВыполняемоеОповещение, ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки, ПодобныйОтчетСуществует, КодИФНС, КПП);
		
	Иначе
		
		ПослеСохраненияНаКлиенте(ВыполняемоеОповещение, РезультатСохранения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНаКлиентеСВопросом(Автосохранение, Вариант, ВыполняемоеОповещение, ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки, ПодобныйОтчетСуществует, КодИФНС, КПП)
	
	Если ПодобныйОтчетСуществует Тогда
		
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, "Сохранить");
		Кнопки.Добавить(КодВозвратаДиалога.Нет, "Отмена");
		
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Отчет с видом %1 уже существует.
			|Сохранить отчет с таким же видом?'"), ?(Вариант = 0, """Первичный""", """Корректирующий/" + Вариант + """"));
		ДополнительныеПараметры = Новый Структура("Автосохранение, Вариант, ВыполняемоеОповещение, ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки, КодИФНС, КПП", Автосохранение, Вариант, ВыполняемоеОповещение, ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки, КодИФНС, КПП);
		ОписаниеОповещения = Новый ОписаниеОповещения("ВопросСохранитьОтчетСТакимЖеВидомЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Кнопки, , Кнопки.Получить(1).Значение);
		
	Иначе
		
		СохранитьНаКлиентеСВопросомПродолжение(Автосохранение, Вариант, ВыполняемоеОповещение, ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки,КодИФНС, КПП);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросСохранитьОтчетСТакимЖеВидомЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Автосохранение = ДополнительныеПараметры.Автосохранение;
	Вариант = ДополнительныеПараметры.Вариант;
	ВыполняемоеОповещение = ДополнительныеПараметры.ВыполняемоеОповещение;
	КодИФНС = ДополнительныеПараметры.КодИФНС;
	КПП = ДополнительныеПараметры.КПП;
	ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки = ДополнительныеПараметры.ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки;
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьНаКлиентеСВопросомПродолжение(Автосохранение, Вариант, ВыполняемоеОповещение, ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки,КодИФНС, КПП);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНаКлиентеСВопросомПродолжение(Автосохранение, Вариант, ВыполняемоеОповещение, ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки, КодИФНС, КПП)
	
	Если ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки Тогда
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ВидОтчета", Вариант);
		
		ФормаВопроса = РегламентированнаяОтчетностьКлиент.ПолучитьОбщуюФормуПоИмени("ВопросПриИзмененииВидаДокументаНомераКорректировки", ПараметрыФормы);
		ФормаВопроса.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		ДополнительныеПараметры = Новый Структура("Автосохранение, Вариант, ВыполняемоеОповещение, КодИФНС, КПП", Автосохранение, Вариант, ВыполняемоеОповещение,КодИФНС, КПП );
		ОписаниеОповещения = Новый ОписаниеОповещения("ВопросПриИзмененииВидаДокументаЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ФормаВопроса.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
		ФормаВопроса.Открыть();
	Иначе
		Состояние(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Сохраняется %1...'"), ЭтаФорма.Заголовок), , , БиблиотекаКартинок.Записать);
		РезультатСохранения = Сохранить(Автосохранение, КодИФНС, КПП, Вариант, Неопределено, Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим);
		ПослеСохраненияНаКлиенте(ВыполняемоеОповещение, РезультатСохранения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПриИзмененииВидаДокументаЗавершение(КодВозврата, ДополнительныеПараметры) Экспорт
	
	Автосохранение = ДополнительныеПараметры.Автосохранение;
	Вариант = ДополнительныеПараметры.Вариант;
	ВыполняемоеОповещение = ДополнительныеПараметры.ВыполняемоеОповещение;
	КодИФНС = ДополнительныеПараметры.КодИФНС;
	КПП = ДополнительныеПараметры.КПП;
	Если КодВозврата = КодВозвратаДиалога.Да
		ИЛИ КодВозврата = КодВозвратаДиалога.Нет Тогда
		ВидДокументаНомерКорректировкиИзменен = ?(КодВозврата = КодВозвратаДиалога.Да, Истина, Ложь);
	Иначе
		Возврат;
	КонецЕсли;
	
	Состояние(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Сохраняется %1...'"), ЭтаФорма.Заголовок), , , БиблиотекаКартинок.Записать);
	РезультатСохранения = Сохранить(Автосохранение, КодИФНС, КПП, Вариант, ВидДокументаНомерКорректировкиИзменен, Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим);
	ПослеСохраненияНаКлиенте(ВыполняемоеОповещение, РезультатСохранения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеСохраненияНаКлиенте(ВыполняемоеОповещение, РезультатСохранения)
	
	КлючУникальности = СтруктураРеквизитовФормы.мСохраненныйДок;
	
	Если РезультатСохранения Тогда
		
		РегламентированнаяОтчетностьКлиент.ПослеЗаписиРегламентированногоОтчета(ЭтаФорма);
		
		Если ВыполняемоеОповещение <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ВыполняемоеОповещение);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПередСохранением(КодИФНС, КПП, ПодобныйОтчетСуществует, Вариант, ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки, Автосохранение, ПоказателиОтчета)
	
	Если РегламентированнаяОтчетность.БылиИзмененыКлючевыеРеквизитыОтчета(ЭтаФорма, КодИФНС, КПП)
	   И РегламентированнаяОтчетность.СуществуетДокументСАналогичнымиРеквизитами(ЭтаФорма, КодИФНС, КПП) Тогда
		
		ПодобныйОтчетСуществует = Истина;
		
	КонецЕсли;
	
	СтруктураРеквизитовФормы.мЗаписываетсяНовыйДокумент = (СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено ИЛИ СтруктураРеквизитовФормы.мСкопированаФорма <> Неопределено);
	
	Если Вариант <> Неопределено И ((СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено) ИЛИ (СтруктураРеквизитовФормы.мСкопированаФорма <> Неопределено) ИЛИ (Вариант <> СтруктураРеквизитовФормы.мВариант)) Тогда
		
		Если СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено ИЛИ СтруктураРеквизитовФормы.мСкопированаФорма <> Неопределено Тогда
						
		ИначеЕсли Вариант <> СтруктураРеквизитовФормы.мВариант Тогда
			
			ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки = Истина;
								
		КонецЕсли;

	КонецЕсли;
	
	Если ПодобныйОтчетСуществует
	 ИЛИ ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки Тогда
	 
	 	Возврат Ложь;
		
 	КонецЕсли;
		
	Возврат Сохранить(Автосохранение, КодИФНС, КПП, Вариант, , ПоказателиОтчета);
		
КонецФункции

&НаСервере
Функция Сохранить(Автосохранение = Ложь, КодИФНС, КПП, Вариант, ВидДокументаНомерКорректировкиИзменен = Неопределено, НаимТекРаздела) Экспорт
	
	ДанныеДляРазблокирования = Неопределено;
	
	Если НЕ СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено Тогда
		Если НЕ СтруктураРеквизитовФормы.мБезОткрытияФормы Тогда
			ДанныеДляРазблокирования = Новый Структура("Ключ,ИдФормы",
			СтруктураРеквизитовФормы.мСохраненныйДок, ЭтаФорма.УникальныйИдентификатор);
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено
	   И НЕ ТипЗнч(СтруктураРеквизитовФормы.мСохраненныйДок) = Тип("ДокументОбъект.РегламентированныйОтчет") Тогда
		СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.ПолучитьОбъект();
	КонецЕсли;
			
	Если НЕ РегламентированнаяОтчетность.ПриЗаписиРегламентированногоОтчетаНаСервере(ЭтаФорма, КодИФНС, Автосохранение, Вариант, ВидДокументаНомерКорректировкиИзменен, СтруктураРеквизитовФормы.мСохраненныйДок) Тогда
		СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка;
		Возврат Ложь;
	КонецЕсли;
	
	// установим текущие значения реквизитов документа
	СтруктураРеквизитовФормы.мСохраненныйДок.ИсточникОтчета = Метаданные.Отчеты[Сред(Лев(СтрЗаменить(ЭтаФорма.ИмяФормы, "Внешний", ""), СтрНайти(СтрЗаменить(ЭтаФорма.ИмяФормы, "Внешний", ""), ".Форма.") - 1), 7)].Имя;
	СтруктураРеквизитовФормы.мСохраненныйДок.НаименованиеОтчета = Метаданные.Отчеты[Сред(Лев(СтрЗаменить(ЭтаФорма.ИмяФормы, "Внешний", ""), СтрНайти(СтрЗаменить(ЭтаФорма.ИмяФормы, "Внешний", ""), ".Форма.") - 1), 7)].ОсновнаяФорма.Синоним;
	СтруктураРеквизитовФормы.мСохраненныйДок.ДатаНачала                 = СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета;
	СтруктураРеквизитовФормы.мСохраненныйДок.ДатаОкончания              = СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета;
	СтруктураРеквизитовФормы.мСохраненныйДок.Периодичность              = СтруктураРеквизитовФормы.мПериодичность;
	СтруктураРеквизитовФормы.мСохраненныйДок.ВыбраннаяФорма             = СтруктураРеквизитовФормы.мВыбраннаяФорма;
	СтруктураРеквизитовФормы.мСохраненныйДок.Организация                = СтруктураРеквизитовФормы.Организация;
	СтруктураРеквизитовФормы.мСохраненныйДок.ДатаПодписи                = ДатаПодписи;
	СтруктураРеквизитовФормы.мСохраненныйДок.ЕдиницаИзмерения           = СтруктураРеквизитовФормы.ЕдиницаИзмерения;
	СтруктураРеквизитовФормы.мСохраненныйДок.ТочностьЕдиницыИзмерения   = СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения;
	СтруктураРеквизитовФормы.мСохраненныйДок.ВидОтчетности              = Перечисления.ВидыОтчетности.РегламентированнаяОтчетность;
	СтруктураРеквизитовФормы.мСохраненныйДок.Комментарий                = Комментарий;
	СтруктураРеквизитовФормы.мСохраненныйДок.КодНалоговогоОргана        = КодИФНС;
	СтруктураРеквизитовФормы.мСохраненныйДок.КПП        				= КПП;
	СтруктураРеквизитовФормы.мСохраненныйДок.Вид                        = Вариант;
	СтруктураРеквизитовФормы.мСохраненныйДок.ПредставлениеВида          = РегламентированнаяОтчетность.ПредставлениеВидаДокумента(СтруктураРеквизитовФормы.мСохраненныйДок.Вид);
	СтруктураРеквизитовФормы.мВариант 									= Вариант;
	СтруктураРеквизитовФормы.мСохраненныйДок.ФорматВыгрузки = "Автоматически";
    
	СохранитьДанныеРаздела(НаимТекРаздела, Ложь, Ложь);
	
	ЗаполнитьПустыеСтруктурыДанных();
	
	// формируем данные редактируемых ячеек таблицы
	ПоказателиОтчета = Новый Структура();
	
	ЗаполнитьПоказателиОтчетаНаСервере(ПоказателиОтчета);
	
	// формируем список сохранения
	СписокСохранения = Новый Структура();

	// вставляем данные редактируемых ячеек таблицы	
	СписокСохранения.Вставить("ПоказателиОтчета", ПоказателиОтчета);
    
	ДанныеМногостраничныхРазделов = Новый Структура;
	
	МассивТиповНеопределено = Новый Массив; 
	МассивТиповНеопределено.Добавить(Тип("Неопределено"));
	ОписаниеТиповНеопределено = Новый ОписаниеТипов(МассивТиповНеопределено);
	
	Для Каждого ЭлементСтруктуры Из мСтруктураМногостраничныхРазделов Цикл
		
		ДанныеМногостраничныхРазделов.Вставить(ЭлементСтруктуры.Ключ, ДанныеФормыВЗначение(ЭтаФорма[ЭлементСтруктуры.Значение], Тип("ТаблицаЗначений")));
		
		ТаблЗнач = Неопределено;
		
		Если ДанныеМногостраничныхРазделов.Свойство(ЭлементСтруктуры.Ключ, ТаблЗнач) Тогда
						
			Если НЕ ТаблЗнач.Колонки.Найти("Данные") = Неопределено Тогда
												
				ТаблЗнач.Колонки.Удалить("Данные");
				ТаблЗнач.Колонки.Добавить("Данные", ОписаниеТиповНеопределено);
				
				Ном = 0;
				
				Для Каждого СтрокаТаблЗнач Из ТаблЗнач Цикл
					
					СтрокаТаблЗнач.Данные = ЭтаФорма[ЭлементСтруктуры.Значение][Ном].Данные[0].Значение;
					
					Ном = Ном + 1;
					
				КонецЦикла;
				
			КонецЕсли;
						
			Если НЕ ТаблЗнач.Колонки.Найти("ДанныеДопСтрок") = Неопределено Тогда
															
				ТаблЗнач.Колонки.Удалить("ДанныеДопСтрок");
				ТаблЗнач.Колонки.Добавить("ДанныеДопСтрок", ОписаниеТиповНеопределено);
				
				Ном = 0;
				
				Для Каждого СтрокаТаблЗнач Из ТаблЗнач Цикл
						
					СтруктураДанныхДопСтрок = Новый Структура;
					
					Для Каждого ЭлСтруктуры Из ЭтаФорма[ЭлементСтруктуры.Значение][Ном].ДанныеДопСтрок[0].Значение Цикл
														
						СтруктураДанныхДопСтрок.Вставить(ЭлСтруктуры.Ключ, ДанныеФормыВЗначение(ЭлСтруктуры.Значение, Тип("ТаблицаЗначений")));	
							
					КонецЦикла;
					
					СтрокаТаблЗнач.ДанныеДопСтрок = СтруктураДанныхДопСтрок;
					
					Ном = Ном + 1;
			
				КонецЦикла;
				
			КонецЕсли;
						
		КонецЕсли;
				
	КонецЦикла;
		
	// вставляем данные многостраничных разделов
	СписокСохранения.Вставить("ДанныеМногостраничныхРазделов", ДанныеМногостраничныхРазделов);

	ДанныеВариантовАвтоЗаполнения = Новый Структура;
	
	Для Каждого ЭлементСтруктуры Из мСтруктураВариантыЗаполнения Цикл
		
		МассивТаблЗнач = Новый Массив;
		
		ДанныеВариантовАвтоЗаполнения.Вставить(ЭлементСтруктуры.Ключ, МассивТаблЗнач);
			
		Для Каждого ЭлементМассива Из ЭтаФорма["ТаблицаВариантыЗаполнения" + ЭлементСтруктуры.Ключ] Цикл
			
			МассивТаблЗнач.Добавить(ДанныеФормыВЗначение(ЭлементМассива.ТаблицаВариантовЗаполнения, Тип("ТаблицаЗначений")));
			
		КонецЦикла;
			
	КонецЦикла;
	
	// вставляем данные вариантов автозаполнения ячеек
	СписокСохранения.Вставить("ДанныеВариантовАвтоЗаполнения", ДанныеВариантовАвтоЗаполнения);
	
	// вствляем версию формы
	СписокСохранения.Вставить("ВерсияФормы", СтруктураРеквизитовФормы.мВерсияФормы);
	
	// вствляем флажок пересчета страниц
	СписокСохранения.Вставить("ФлПодсчетСтраниц", СтруктураРеквизитовФормы.мСчетчикСтраниц);
	
	СписокСохранения.Вставить("ФлПроверятьСоотношенияПриПечатиИВыгрузки", СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки);
	
	// вствляем флажок отключения
	СписокСохранения.Вставить("ФлОтклВыборЗначений", СтруктураРеквизитовФормы.мАвтоВыборКодов);

	// вствляем флажок ручной ввод ВРЕМЕННАЯ ОТМЕНА
	СписокСохранения.Вставить("Автозаполнение", СтруктураРеквизитовФормы.ФлажокОтклАвтоРасчет);

	// вствляем флажок разрешения печати без штрихкода
	СписокСохранения.Вставить("ПечатьБезШтрихкодаРазрешена", СтруктураРеквизитовФормы.мПечатьБезШтрихкодаРазрешена);
	
	ХранилищеДанных = Новый ХранилищеЗначения(СписокСохранения);
	СтруктураРеквизитовФормы.мСохраненныйДок.ДанныеОтчета = ХранилищеДанных;

	// записываем документ, хранящий данные отчета	
	Попытка
		СтруктураРеквизитовФормы.мСохраненныйДок.Записать();
	Исключение
		Если НЕ Автосохранение Тогда
			
			Сообщение = Новый СообщениеПользователю;

			Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1'"), РегламентированнаяОтчетностьКлиентСервер.СформироватьТекстСообщения(ОписаниеОшибки()));

			Сообщение.Сообщить();
			
		КонецЕсли;
		СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка;
		Возврат Ложь;
	КонецПопытки;
			
	Модифицированность   = Ложь;
	
	СохранитьДеревоНастройкиСтраниц(СтруктураРеквизитовФормы.мСохраненныйДок);
	
	СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка;
	
	Если НЕ СтруктураРеквизитовФормы.мБезОткрытияФормы
       И НЕ СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено Тогда
				   
    	ЗаблокироватьДанныеДляРедактирования(СтруктураРеквизитовФормы.мСохраненныйДок, , ЭтаФорма.УникальныйИдентификатор);

    КонецЕсли;
	
	Если ДанныеДляРазблокирования <> Неопределено Тогда
		РазблокироватьДанныеДляРедактирования(ДанныеДляРазблокирования.Ключ, ДанныеДляРазблокирования.ИдФормы);
	КонецЕсли;
	
	Возврат Истина;

КонецФункции

&НаСервере
Процедура ЗаполнитьПустыеСтруктурыДанных()
	
	СохрТабличныйДокумент = Новый ТабличныйДокумент;
	
	СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
	
	Для Каждого Раздел Из мСвойстваРазделовДекларации.ПолучитьЭлементы() Цикл
		
		Если НЕ Раздел.МногостраничностьВРазделе
		  И (ЭтаФорма["СтруктураДанных" + Раздел.ИмяСтраницы].Количество() = 0) Тогда
		  
			ТабличныйДокумент.Очистить();
			ТабличныйДокумент.Вывести(ОбъектОтчета(ЭтаФорма.ИмяФормы).ПолучитьМакет(Сред(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, "ФормаОтчета")) + "_" + Раздел.ИмяСтраницы));
			
			СохранитьДанныеРаздела(Раздел.ИмяСтраницы, Ложь);
			
		ИначеЕсли Раздел.МногостраничностьВРазделе
			    И (ЭтаФорма[мСтруктураМногостраничныхРазделов[Раздел.ИмяСтраницы]][0].Данные.Количество() = 0) Тогда
				
			ТабличныйДокумент.Очистить();
			ТабличныйДокумент.Вывести(ОбъектОтчета(ЭтаФорма.ИмяФормы).ПолучитьМакет(Сред(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, "ФормаОтчета")) + "_" + Раздел.ИмяСтраницы));
			
			ЗаполнитьПоказателиЗначениямиПоУмолчанию(Раздел.ИмяСтраницы);
			
			СохранитьДанныеРаздела(Раздел.ИмяСтраницы, Ложь);	
			
		КонецЕсли;
	
	КонецЦикла;
	
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(СохрТабличныйДокумент);
	
КонецПроцедуры
    
&НаСервере
Процедура ЗаполнитьПоказателиОтчетаНаСервере(ПоказателиОтчета)
	
	Перем ТаблицаСтраниц;
	
	Префикс = "ПолеТабличногоДокумента";
	
	Для Каждого Раздел Из мСвойстваРазделовДекларации.ПолучитьЭлементы() Цикл
			
		Если НЕ Раздел.МногостраничностьВРазделе Тогда
			ПоказателиОтчета.Вставить(Префикс + Раздел.ИмяСтраницы, ЭтаФорма["СтруктураДанных" + Раздел.ИмяСтраницы]);
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СобратьДанныеТекущегоТаблПоляНаСервере(ИмяТабличногоПоля) Экспорт
	
	Возврат СобратьДанныеТекущегоТаблПоля(ЭтаФорма, ИмяТабличногоПоля);

КонецФункции

&НаКлиенте
Функция СобратьДанныеТекущегоТаблПоляНаКлиенте(ИмяТабличногоПоля) Экспорт
	
	Возврат СобратьДанныеТекущегоТаблПоля(ЭтаФорма, ИмяТабличногоПоля);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СобратьДанныеТекущегоТаблПоля(Форма, ТабличноеПоле) Экспорт

	СтруктураДанныхПоля = Новый Структура;
	Для Каждого ТекущаяОбласть Из Форма[ТабличноеПоле].Области Цикл
		Если ТекущаяОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник И ТекущаяОбласть.СодержитЗначение = Истина Тогда
			СтруктураДанныхПоля.Вставить(ТекущаяОбласть.Имя, ТекущаяОбласть.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтруктураДанныхПоля;

КонецФункции

&НаКлиенте
Процедура ЗаполнитьДатуВЯчейкахНаКлиенте() Экспорт
    	
	ЗаполнитьДатуВЯчейках(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьДатуВЯчейках(Форма)
    	
	Форма.ТабличныйДокумент.Области.ДатаПодписи.Значение = Форма.ДатаПодписи;
    	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДатуВЯчейкахНаСервере() Экспорт
    	
	ЗаполнитьДатуВЯчейках(ЭтаФорма);
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция РазмерОграниченияУменьшенияСуммыСтраховогоВзноса(Форма, ПредварительнаяСуммаЕНВД)
	
	Результат = 0;
	
	Если Форма.СтруктураРеквизитовФормы.ОпределятьТрудНаемныхРабочих И НЕ Форма.СтруктураРеквизитовФормы.ИПИспользуетТрудНаемныхРаботников Тогда
		Результат = 35664.66;
	Иначе
		Результат = Цел(0.5 * ПредварительнаяСуммаЕНВД)
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбораВПолеТабличногоДокумента(Элемент, Область, СтандартнаяОбработка)
	
	Если (СтрНайти(Область.Имя, "П000020003301") = 1 И ЗначениеЗаполнено(ТабличныйДокумент.Области.П000020003101.Значение))
	 ИЛИ (СтрНайти(Область.Имя, "П000020003601") = 1 И ЗначениеЗаполнено(ТабличныйДокумент.Области.П000020003401.Значение)) Тогда
		ОбработатьДополнительнуюСрокуДаты(Область.Имя);
	КонецЕсли;
	
	Если СтрЧислоВхождений(Область.Имя, "ДобавитьСтраницу") > 0 И Область.Текст <> "" Тогда
		СтандартнаяОбработка = Ложь;
		ДобавитьСтраницу("");
	ИначеЕсли СтрЧислоВхождений(Область.Имя, "УдалитьСтраницу") > 0 И Область.Текст <> "" Тогда
		СтандартнаяОбработка = Ложь;
		УдалитьСтраницу("");
	ИначеЕсли Область.Имя = "СобратьДанные" Тогда 
		СтандартнаяОбработка = Ложь;
		СобратьДанные(Неопределено);
	КонецЕсли;
	
	Если РегламентированнаяОтчетностьКлиент.ВыбраннаяОбластьРегламентированногоОтчетаНеВерна(ЭтаФорма, Область, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяЯчейки = Область.Имя;
	ИсходноеЗначениеЯчейки = Область.Значение;
	
	Если Лев(ИмяЯчейки, 7) = "КодИМНС" Тогда
		ОбработкаВыбораИФНС();
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	// Форма заполнения адреса раздела 2.
	Если (ИмяЯчейки = "П000020002001")
	 ИЛИ (ИмяЯчейки = "П000020002002") 
	 ИЛИ (ИмяЯчейки = "П000020002003") 
	 ИЛИ (ИмяЯчейки = "П000020002004") 
	 ИЛИ (ИмяЯчейки = "П000020002005") 
	 ИЛИ (ИмяЯчейки = "П000020002006")
	 ИЛИ (ИмяЯчейки = "П000020002007") 
	 ИЛИ (ИмяЯчейки = "П000020002008") 
	 ИЛИ (ИмяЯчейки = "П000020002009") Тогда 

	    СтандартнаяОбработка = Ложь;
		
		РоссийскийАдрес = Новый Соответствие;
		
		РоссийскийАдрес.Вставить("Индекс",	        ТабличныйДокумент.Области.П000020002001.Значение);
		РоссийскийАдрес.Вставить("Регион",          ТабличныйДокумент.Области.П000020002002.Значение);
		РоссийскийАдрес.Вставить("КодРегиона",      ТабличныйДокумент.Области.П000020002002.Значение);
		РоссийскийАдрес.Вставить("Район",           ТабличныйДокумент.Области.П000020002003.Значение);
		РоссийскийАдрес.Вставить("Город",           ТабличныйДокумент.Области.П000020002004.Значение);
		РоссийскийАдрес.Вставить("НаселенныйПункт", ТабличныйДокумент.Области.П000020002005.Значение);
		РоссийскийАдрес.Вставить("Улица",           ТабличныйДокумент.Области.П000020002006.Значение);
		РоссийскийАдрес.Вставить("Дом",             ТабличныйДокумент.Области.П000020002007.Значение);
		РоссийскийАдрес.Вставить("Корпус",          ТабличныйДокумент.Области.П000020002008.Значение);
		РоссийскийАдрес.Вставить("Квартира",        ТабличныйДокумент.Области.П000020002009.Значение);
		
		Если Регионы.Количество() = 0 Тогда
			ЗаполнитьРегионыНаСервере();
		КонецЕсли;
		
		Регион = Регионы.НайтиСтроки(Новый Структура("Код", СокрЛП(РоссийскийАдрес["Регион"])));
	   
	   	Если Регион.Количество() > 0 Тогда
			РоссийскийАдрес["Регион"] = Регион[0].Наим;
		КонецЕсли;
		
		ЗначенияПолей = Новый СписокЗначений;
		
		ЗначенияПолей.Добавить(РоссийскийАдрес["Индекс"],          "Индекс");
		ЗначенияПолей.Добавить(РоссийскийАдрес["Регион"],          "Регион");
		ЗначенияПолей.Добавить(РоссийскийАдрес["КодРегиона"],      "КодРегиона");
		ЗначенияПолей.Добавить(РоссийскийАдрес["Район"],           "Район");
		ЗначенияПолей.Добавить(РоссийскийАдрес["Город"],           "Город");
		ЗначенияПолей.Добавить(РоссийскийАдрес["НаселенныйПункт"], "НаселенныйПункт");
		ЗначенияПолей.Добавить(РоссийскийАдрес["Улица"],           "Улица");
		ЗначенияПолей.Добавить(РоссийскийАдрес["Дом"],             "Дом");
		ЗначенияПолей.Добавить(РоссийскийАдрес["Корпус"],          "Корпус");
		ЗначенияПолей.Добавить(РоссийскийАдрес["Квартира"],        "Квартира");
		                         		
		ПредставлениеАдреса = РегламентированнаяОтчетностьКлиентСервер.ПредставлениеАдресаВФормате9Запятых("643," + РоссийскийАдрес["Индекс"] + ","
																												  + РоссийскийАдрес["Регион"] + ","
																												  + РоссийскийАдрес["Район"] + ","
																												  + РоссийскийАдрес["Город"] + ","
																												  + РоссийскийАдрес["НаселенныйПункт"] + ","
																												  + РоссийскийАдрес["Улица"] + ","
																												  + РоссийскийАдрес["Дом"] + ","
																												  + РоссийскийАдрес["Корпус"] + ","
																												  + РоссийскийАдрес["Квартира"]);
								
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Заголовок",               "Ввод адреса");
		ПараметрыФормы.Вставить("ЗначенияПолей", 		   ЗначенияПолей);
		ПараметрыФормы.Вставить("Представление", 		   ПредставлениеАдреса);
		ПараметрыФормы.Вставить("ВидКонтактнойИнформации", СтруктураРеквизитовФормы.СправочникиВидыКонтактнойИнформацииФактАдресОрганизации);
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("РоссийскийАдрес", РоссийскийАдрес);
		
		ТипЗначения = Тип("ОписаниеОповещения");
		ПараметрыКонструктора = Новый Массив(3);
		ПараметрыКонструктора[0] = "ОткрытьФормуКонтактнойИнформацииЗавершение";
		ПараметрыКонструктора[1] = ЭтаФорма;
		ПараметрыКонструктора[2] = ДополнительныеПараметры;
		
		Оповещение = Новый (ТипЗначения, ПараметрыКонструктора);
		
		ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент").ОткрытьФормуКонтактнойИнформации(ПараметрыФормы, , Оповещение);
				
	КонецЕсли;
	
	Если ИмяЯчейки = "П000020003101" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если НЕ ЗначениеЗаполнено(Область.Значение) Тогда
			ТабличныйДокумент.Области.П000020003101.Значение = "V";
			ТабличныйДокумент.Области.П000020003102.Значение = "";
		КонецЕсли;
		
	КонецЕсли;		
	
	Если ИмяЯчейки = "П000020003102" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если НЕ ЗначениеЗаполнено(Область.Значение) Тогда
			
			ТабличныйДокумент.Области.П000020003101.Значение = "";
			ТабличныйДокумент.Области.П000020003102.Значение = "V";
			
			ОчиститьСписокДат(СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_1);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяЯчейки = "П000020003401" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если НЕ ЗначениеЗаполнено(Область.Значение) Тогда
			
			ТабличныйДокумент.Области.П000020003401.Значение = "V";
			ТабличныйДокумент.Области.П000020003402.Значение = "";
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяЯчейки = "П000020003402" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если НЕ ЗначениеЗаполнено(Область.Значение) Тогда
			
			ТабличныйДокумент.Области.П000020003401.Значение = "";
			ТабличныйДокумент.Области.П000020003402.Значение = "V";
			
			ОчиститьСписокДат(СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_2);
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрВводаПоля = РегламентированнаяОтчетностьКлиентСервер.НайтиСвойстваПоказателя(ЭтаФорма, ИмяЯчейки);
	
	//создание динамического списка выбора
	Если ПараметрВводаПоля <> Неопределено И ПараметрВводаПоля.ТаблицаЗначений.Количество() > 0 Тогда
		//обработка таблицы значений - удаление вариантов, не проходящих по условиям
		КодПоказателя = ПараметрВводаПоля.Показатель;
		КопироватьДанныеФормы(ПараметрВводаПоля.ТаблицаЗначений, ТЗВыбора);
				
		ТребРезультат = 0;
		Если КодПоказателя = "Период" Тогда
			
			//код периода	
			НомерКвартала = Число(Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ=к"));
			ТребРезультат = НомерКвартала;
			
		КонецЕсли;
				
		Если ТребРезультат <> 0 Тогда
			//из ТЗВыбора удаляются элементы, у которых результат отличается от нуля и ТребРезультат
			РазмерТЗ = ТЗВыбора.Количество();
			Для Сч = 1 По РазмерТЗ Цикл
				ЭлементТЗ = ТЗВыбора[РазмерТЗ - Сч];
				Рез = ?(ЭлементТЗ.РезультатПроверки = "", 0, Число(ЭлементТЗ.РезультатПроверки));
				Если Рез <> 0 И Рез <> ТребРезультат Тогда
					ТЗВыбора.Удалить(ЭлементТЗ);
				КонецЕсли;
			КонецЦикла; 
		КонецЕсли;
				
		ВвестиПоказатель(Элемент, Область, КодПоказателя, Ложь, ПараметрВводаПоля.ТекстПриВыборе, ТЗВыбора, СтандартнаяОбработка);
		Возврат;
	КонецЕсли;
	
	Если СтрНайти(ИмяЯчейки, "П0000200015") Тогда
		
		//Для ускорения работы формы в веб-клиенте ввод кода оказываемых услуг по ОКУН обрабатывается отдельно.
		ВвестиКодУслуги(Элемент, Область, СтандартнаяОбработка);

	КонецЕсли;
	
	Если ИмяЯчейки = "П000020001000" Тогда
		НовоеЗначениеЯчейки = ТабличныйДокумент.Области.П000020001000.Значение;
		Если ИсходноеЗначениеЯчейки <> НовоеЗначениеЯчейки Тогда
			ОчиститьСтроку015Раздела2();
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяЯчейки = "ФормаРеорганизации"	Тогда
		УстановитьДоступностьОбластей(ЭтаФорма, СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	КонецЕсли;
	
	Если ИмяЯчейки = "П000020001000"
	 ИЛИ ИмяЯчейки = "П000020003101"
	 ИЛИ ИмяЯчейки = "П000020003102"
	 ИЛИ ИмяЯчейки = "П000020003401"
	 ИЛИ ИмяЯчейки = "П000020003402" Тогда
	 
		УстановитьДоступностьОбластей(ЭтаФорма, СтруктураРеквизитовФормы.НаимТекущегоРаздела);
		РассчитатьДниОсуществленияДеятельности();
		РасчетНаКлиенте("Раздел2", ИмяЯчейки);
		
	КонецЕсли;	
	
	Если ИмяЯчейки = "П000010001003" Тогда
		
		ТаблицаСтраницРаздела = Неопределено;

		// Изменим во всех листах многостраничного документа.
		КБК = ТабличныйДокумент.Области.П000010001003.Значение;
		мСтруктураМногостраничныхРазделов.Свойство("Раздел1", ТаблицаСтраницРаздела);
		ТаблицаСтраницРаздела = ЭтаФорма[ТаблицаСтраницРаздела];
		Для Каждого Страница Из ТаблицаСтраницРаздела Цикл
			Если Страница.Данные.Количество() > 0 Тогда
				Страница.Данные[0].Значение.П000010001003 = КБК;
				Страница.Данные[0].Пометка = Истина;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуКонтактнойИнформацииЗавершение(Результат, Параметры) Экспорт
	
	ОбновитьАдресВТабличномДокументе(Результат, Параметры.РоссийскийАдрес);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьАдресВТабличномДокументе(Результат, РоссийскийАдрес)
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		// Обход ошибки платформы: в веб-клиенте, в результате выполнения процедуры "СформироватьАдрес"
		// общего модуля "РегламентированнаяОтчетностьВызовСервера", не изменяются значения ключей
		// соответствия "РоссийскийАдрес", передаваемого в качестве параметра.
		РоссийскийАдрес_ = РоссийскийАдрес;
		
		РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат.КонтактнаяИнформация, РоссийскийАдрес_);
		
		ТабличныйДокумент.Области.П000020002001.Значение = РоссийскийАдрес_["Индекс"];
		ТабличныйДокумент.Области.П000020002002.Значение = РоссийскийАдрес_["КодРегиона"];
		ТабличныйДокумент.Области.П000020002003.Значение = РоссийскийАдрес_["Район"];
		ТабличныйДокумент.Области.П000020002004.Значение = РоссийскийАдрес_["Город"];
		ТабличныйДокумент.Области.П000020002005.Значение = РоссийскийАдрес_["НаселенныйПункт"];
		ТабличныйДокумент.Области.П000020002006.Значение = РоссийскийАдрес_["Улица"];
		ТабличныйДокумент.Области.П000020002007.Значение = РоссийскийАдрес_["Дом"];
		ТабличныйДокумент.Области.П000020002008.Значение = РоссийскийАдрес_["Корпус"];
		ТабличныйДокумент.Области.П000020002009.Значение = РоссийскийАдрес_["Квартира"];
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСтроку015Раздела2()
	
	Для Инд = 1 По 6 Цикл
		НомерСтроки = Формат(Инд, "ЧГ=0");
		ТабличныйДокумент.Области["П000020001501" + "_" + НомерСтроки].Значение = "";
		ТабличныйДокумент.Области["П000020001502" + "_" + НомерСтроки].Значение = "";
		ТабличныйДокумент.Области["П000020001503" + "_" + НомерСтроки].Значение = "";
		ТабличныйДокумент.Области["П000020001504" + "_" + НомерСтроки].Значение = "";
		ТабличныйДокумент.Области["П000020001505" + "_" + НомерСтроки].Значение = "";
		ТабличныйДокумент.Области["П000020001506" + "_" + НомерСтроки].Значение = "";
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораИФНС()
		
	КодИМНС = СокрЛП(ТабличныйДокумент.Области.КодИМНС.Значение);
	КПП     = СокрЛП(ТабличныйДокумент.Области.КПП1.Значение); 
	ЗначенияДляОтбора = Новый Массив;
	ЗначенияДляОтбора.Добавить(Новый Структура("КодНО, КПП", КодИМНС, КПП));
						   
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", СтруктураРеквизитовФормы.Организация);
	ПараметрыФормы.Вставить("ЗначенияДляОтбора", ЗначенияДляОтбора);
						   
	ФормаВыбораНалоговогоОргана = РегламентированнаяОтчетностьКлиент.ПолучитьОбщуюФормуПоИмени("ФормаВыбораНалоговогоОргана", ПараметрыФормы, ЭтаФорма);
	
	Если ФормаВыбораНалоговогоОргана.ТаблицаНО.Количество() <> 0 Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораИФНСЗавершение", ЭтотОбъект);
		
		ФормаВыбораНалоговогоОргана.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
		ФормаВыбораНалоговогоОргана.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		ФормаВыбораНалоговогоОргана.Открыть();
		
	ИначеЕсли НЕ ЗначениеЗаполнено(КодИМНС) Тогда	
				
		Сообщение = Новый СообщениеПользователю;

		Сообщение.Текст = НСтр("ru='Код налогового органа необходимо задать в справочнике ""Организации"".'");

		Сообщение.Сообщить();
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю;

		Сообщение.Текст = НСтр("ru='Для выбора инспекции, необходимо завести соответствующую запись в справочнике ""Регистрации в налоговом органе"".'");

		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораИФНСЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора <> Неопределено Тогда
		
		ВыбранныйКодНО = РезультатВыбора.КодНО;
		ДлинаКодаНО = СтрДлина(ВыбранныйКодНО);
		
		Для Инд = ДлинаКодаНО + 1 По 4 Цикл
			ВыбранныйКодНО = "0" + ВыбранныйКодНО;
		КонецЦикла;
		
		ТабличныйДокумент.Области.КодИМНС.Значение = ВыбранныйКодНО;
		
		ТабличныйДокумент.Области.КПП1.Значение = РезультатВыбора.КПП;
		
		//заполняем сведения о подписантах
		ЗаполнитьСведенияОПодписантах();
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиПоказатель(Элемент, Область, КодПоказателя, Знач ЭтоСумма, Знач ТекстВыбора, ТаблицаВыбора, СтандартнаяОбработка, КолонкаПоиска = "Код") Экспорт
	
	Если ТаблицаВыбора = Неопределено ИЛИ СтруктураРеквизитовФормы.мАвтоВыборКодов Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
		
	Если Область.Имя = КодПоказателя ИЛИ СтрНайти(Область.Имя, "П0000200015") > 0 Тогда	
		ИсходноеЗначение = ?(ТипЗнч(Область.Значение) = Тип("Строка"), СокрЛП(Область.Значение), Область.Значение);
	Иначе
		Разделитель = ?(Лев(Область.Имя, СтрДлина(КодПоказателя) + 1) = КодПоказателя + "_", "_", "");
		ИндексОбласти = 1;
		ИсходноеЗначение = "";
		Пока ЭтаФорма[ТекущийЭлемент.Имя].Области.Найти(КодПоказателя + Разделитель + Формат(ИндексОбласти, "ЧГ=")) <> Неопределено Цикл
			ИсходноеЗначение = ИсходноеЗначение + Строка(ЭтаФорма[ТекущийЭлемент.Имя].Области[КодПоказателя + Разделитель + Формат(ИндексОбласти, "ЧГ=")].Значение);
			ИндексОбласти = ИндексОбласти + 1;
		КонецЦикла;
		ИсходноеЗначение = СокрЛП(ИсходноеЗначение);
	КонецЕсли;
	
	ИсходноеЗначениеЯчейки = Область.Значение;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок",          ТекстВыбора);
	ПараметрыФормы.Вставить("ТаблицаЗначений",    ТаблицаВыбора);
	ПараметрыФормы.Вставить("СтруктураДляПоиска", Новый Структура(КолонкаПоиска, ИсходноеЗначение));
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВвестиПоказательЗавершение", ЭтотОбъект, Новый Структура("ИндексОбласти, КодПоказателя, КолонкаПоиска, Область, Разделитель, ИсходноеЗначениеЯчейки", ИндексОбласти, КодПоказателя, КолонкаПоиска, Область, Разделитель, ИсходноеЗначениеЯчейки));
	ОткрытьФорму("Обработка.ОбщиеОбъектыРеглОтчетности.Форма.ФормаВыбораЗначенияИзТаблицы", ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиПоказательЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	ИндексОбласти = ДополнительныеПараметры.ИндексОбласти;
	КодПоказателя = ДополнительныеПараметры.КодПоказателя;
	КолонкаПоиска = ДополнительныеПараметры.КолонкаПоиска;
	Область = ДополнительныеПараметры.Область;
	Разделитель = ДополнительныеПараметры.Разделитель;
	ИсходноеЗначениеЯчейки = ДополнительныеПараметры.ИсходноеЗначениеЯчейки;
	ИмяЯчейки = Область.Имя;
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Область.Имя = КодПоказателя ИЛИ СтрНайти(Область.Имя, "П0000200015") > 0 Тогда	
		Область.Значение = РезультатВыбора[КолонкаПоиска];
	Иначе
		СтрокаРезультатВыбора = Строка(РезультатВыбора[КолонкаПоиска]);
		Для Инд = СтрДлина(СтрокаРезультатВыбора) + 1 По ИндексОбласти - 1 Цикл
			СтрокаРезультатВыбора = " " + РезультатВыбора[КолонкаПоиска];
		КонецЦикла;
		Для Инд = 1 По ИндексОбласти - 1 Цикл
			ЭтаФорма[ТекущийЭлемент.Имя].Области[КодПоказателя + Разделитель + Формат(Инд, "ЧГ=")].Значение = СокрЛП(Сред(РезультатВыбора[КолонкаПоиска], Инд, 1));
		КонецЦикла;
	КонецЕсли;
	
	//Только для данного отчета (ЕНВД) прозводится заполнение базовой доходности
	Если КодПоказателя = "П000020001000" Тогда
		
		БазоваяДоходность = РезультатВыбора.БазоваяДоходность;
		Если РезультатВыбора.Код = "20" Тогда
			Если СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета >= '2013-01-01' Тогда
				БазоваяДоходность = 10000;
			Иначе
				БазоваяДоходность = 5000;
			КонецЕсли;
		КонецЕсли;
		
		ТабличныйДокумент.Области.П000020004003.Значение = БазоваяДоходность;
		
	КонецЕсли;
	
	Модифицированность = Истина;
	
	Если СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Раздел2" Тогда
		
		ИмяОбласти = Область.Имя;
		
		ПозицияПодстроки = СтрНайти(ИмяОбласти, "_");
		
		Если ПозицияПодстроки > 0 Тогда
			ИмяОбласти = Лев(ИмяОбласти, ПозицияПодстроки - 1);
		КонецЕсли;
		
		Если СтрЧислоВхождений("П000020001000;П000020004003;П000020005003;П000020006003;П000020007003;П000020008003;П000020009003", ИмяОбласти) = 0 Тогда
			Возврат;
		КонецЕсли;
		
		РасчетНаКлиенте("Раздел2", ИмяОбласти);
		
	КонецЕсли;
	Если ИмяЯчейки = "П000020001000" Тогда
		НовоеЗначениеЯчейки = ТабличныйДокумент.Области.П000020001000.Значение;
		Если ИсходноеЗначениеЯчейки <> НовоеЗначениеЯчейки Тогда
			ОчиститьСтроку015Раздела2();
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяЯчейки = "ФормаРеорганизации"	Тогда
		УстановитьДоступностьОбластей(ЭтаФорма, СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	КонецЕсли;
	
	Если ИмяЯчейки = "П000020001000"
		ИЛИ ИмяЯчейки = "П000020003101"
		ИЛИ ИмяЯчейки = "П000020003102"
		ИЛИ ИмяЯчейки = "П000020003401"
		ИЛИ ИмяЯчейки = "П000020003402" Тогда
		
		УстановитьДоступностьОбластей(ЭтаФорма, СтруктураРеквизитовФормы.НаимТекущегоРаздела);
		РассчитатьДниОсуществленияДеятельности();
		РасчетНаКлиенте("Раздел2", ИмяЯчейки);
		
	КонецЕсли;	
	
	Если ИмяЯчейки = "П000010001003" Тогда
		
		ТаблицаСтраницРаздела = Неопределено;
		
		// Изменим во всех листах многостраничного документа.
		КБК = ТабличныйДокумент.Области.П000010001003.Значение;
		мСтруктураМногостраничныхРазделов.Свойство("Раздел1", ТаблицаСтраницРаздела);
		ТаблицаСтраницРаздела = ЭтаФорма[ТаблицаСтраницРаздела];
		Для Каждого Страница Из ТаблицаСтраницРаздела Цикл
			Если Страница.Данные.Количество() > 0 Тогда
				Страница.Данные[0].Значение.П000010001003 = КБК;
				Страница.Данные[0].Пометка = Истина;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиКодУслуги(Элемент, Область, СтандартнаяОбработка, КолонкаПоиска = "Код") Экспорт
	
	Если СтруктураРеквизитовФормы.мАвтоВыборКодов Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
		
	ИсходноеЗначение = ?(ТипЗнч(Область.Значение) = Тип("Строка"), СокрЛП(Область.Значение), Область.Значение);

	ПараметрыДляЗаполненияТаблицыЗначений = Новый Структура;
	ПараметрыДляЗаполненияТаблицыЗначений.Вставить("ЗаполнятьТаблицуЗначенийИзМакета", Истина);
	ПараметрыДляЗаполненияТаблицыЗначений.Вставить("ИмяМакета", "Списки2012Кв1");
	ПараметрыДляЗаполненияТаблицыЗначений.Вставить("ЗначениеДляДобавленияСтрокиВТаблицу", ТабличныйДокумент.Области.П000020001000.Значение);
	ПараметрыДляЗаполненияТаблицыЗначений.Вставить("ИмяОтчета", Сред(Лев(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, ".Форма.") - 1), 7));
	ПараметрыДляЗаполненияТаблицыЗначений.Вставить("ДатаКонцаПериодаОтчета", СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок",          "Выбор кода оказываемых услуг по ОКУН");
	ПараметрыФормы.Вставить("СтруктураДляПоиска", Новый Структура(КолонкаПоиска, ИсходноеЗначение));
	ПараметрыФормы.Вставить("ПараметрыДляЗаполненияТаблицыЗначений", ПараметрыДляЗаполненияТаблицыЗначений);
	
	ДополнительныеПараметры = Новый Структура("КолонкаПоиска, Область", КолонкаПоиска, Область);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВвестиКодУслугиЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ОткрытьФорму("Обработка.ОбщиеОбъектыРеглОтчетности.Форма.ФормаВыбораЗначенияИзТаблицы", ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиКодУслугиЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	КолонкаПоиска = ДополнительныеПараметры.КолонкаПоиска;
	Область = ДополнительныеПараметры.Область;
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Область.Значение = РезультатВыбора[КолонкаПоиска];
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетНаКлиенте(ИмяСтраницыПанели = "", ОбластьИмя = "", ПриИзмененииСодержимогоОбласти = Ложь) Экспорт

	Расчет(ЭтаФорма, ИмяСтраницыПанели, ОбластьИмя);

КонецПроцедуры

&НаСервере
Процедура РасчетНаСервере(ИмяСтраницыПанели = "", ОбластьИмя = "", ПриИзмененииСодержимогоОбласти = Ложь) Экспорт

	Расчет(ЭтаФорма, ИмяСтраницыПанели, ОбластьИмя);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура Расчет(Форма, ИмяСтраницыПанели = "", ОбластьИмя = "", ПриИзмененииСодержимогоОбласти = Ложь)
	
	Перем ТаблицаБлока;
	
	Если Форма.СтруктураРеквизитовФормы.мРежимПечати Тогда
		Возврат;
	КонецЕсли;
	
	Если (Форма.СтруктураРеквизитовФормы.ФлажокОтклАвтоРасчет) Тогда
		Возврат;
	КонецЕсли;
	
	Если ИмяСтраницыПанели = "" Тогда
		
		ИмяТекущейСтраницыПанели = Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела;
		
	Иначе
		
		ИмяТекущейСтраницыПанели = ИмяСтраницыПанели;
		
	КонецЕсли;
	
	Если СтрЧислоВхождений(ОбластьИмя, "_") > 0 Тогда
		ОбластьИмя = Лев(ОбластьИмя, СтрНайти(ОбластьИмя, "_") - 1);
	КонецЕсли;
			
	Если ИмяСтраницыПанели = "Раздел2" Тогда
						
		Если ОбластьИмя = "П000020001000"
		 ИЛИ ОбластьИмя = "П000020003101"
		 ИЛИ ОбластьИмя = "П000020003102"
		 ИЛИ ОбластьИмя = "П000020003401"
		 ИЛИ ОбластьИмя = "П000020003402" Тогда
			
			Расчет(Форма, "Раздел2", "П000020005003", ПриИзмененииСодержимогоОбласти);
		
		КонецЕсли; 
		
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020010003, ОбластьИмя) > 0 Тогда
			
			СтруктураРаздела = Неопределено;
			Форма.мСтруктураМногостраничныхРазделов.Свойство("Раздел2", СтруктураРаздела);
			СтруктураРаздела = Форма[СтруктураРаздела];
			
			Для Каждого СтраницаРаздела Из СтруктураРаздела Цикл
				
				ОбработкаВТабличномПоле = СтраницаРаздела.АктивнаяСтраница;
				Если ОбработкаВТабличномПоле Тогда
					РазмещениеДанных = Форма.ТабличныйДокумент;
				Иначе
					РазмещениеДанных = СтраницаРаздела.Данные;
				КонецЕсли;
				
				РасчетЛистаРаздел2(Форма, РазмещениеДанных);
				
				Если ОбработкаВТабличномПоле И ПриИзмененииСодержимогоОбласти Тогда
					
					СтраницаРаздела.Данные.Вставить("П000020003000", Форма.ТабличныйДокумент.Области.П000020003000.Значение);
					СтраницаРаздела.Данные.Вставить("П000020010003", Форма.ТабличныйДокумент.Области.П000020010003.Значение);
					СтраницаРаздела.Данные.Вставить("П000020011003", Форма.ТабличныйДокумент.Области.П000020011003.Значение);
					
				КонецЕсли;
				
			КонецЦикла;
			
		Конецесли;
	        		
	ИначеЕсли ИмяСтраницыПанели = "Раздел3" Тогда
		
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000030006003, ОбластьИмя) > 0 Тогда

			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Раздел3" Тогда
				
				ОкрП000030003003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030003003.Значение);
				ОкрП000030004003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030004003.Значение);
				
				П000030002003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030002003.Значение);
				
				ОграничениеУменьшающейСуммы = РазмерОграниченияУменьшенияСуммыСтраховогоВзноса(Форма, П000030002003);
				
				П000030005003 = ОкрП000030003003 + ОкрП000030004003;
				П000030005003 = Мин(П000030005003, ОграничениеУменьшающейСуммы);
				
				Форма.ТабличныйДокумент.Области.П000030005003.Значение = П000030005003;
				Форма.ТабличныйДокумент.Области.П000030006003.Значение = Макс(0, П000030002003 - П000030005003);
				
			Иначе	
				
				Если Форма.СтруктураДанныхРаздел3.Количество() > 0 Тогда
					
					ОкрП000030003003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхРаздел3.П000030003003);
					ОкрП000030004003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхРаздел3.П000030004003);
					
					П000030002003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхРаздел3.П000030002003);
					
					ОграничениеУменьшающейСуммы = РазмерОграниченияУменьшенияСуммыСтраховогоВзноса(Форма, П000030002003);
					
					П000030005003 = ОкрП000030003003 + ОкрП000030004003;
					П000030005003 = Мин(П000030005003, ОграничениеУменьшающейСуммы);
					
					Форма.СтруктураДанныхРаздел3.П000030005003 = П000030005003;
					Форма.СтруктураДанныхРаздел3.П000030006003 = Макс(0, П000030002003 - П000030005003);
					
				КонецЕсли;

			КонецЕсли;
		
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры 

&НаКлиентеНаСервереБезКонтекста
Процедура РасчетЛистаРаздел2(Форма, МестоРазмещенияДанных)
	
	КоличествоДней = КалендарныеДниПериода(Форма.СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
	
	Строка040 = ПолучитьДанныеИзМестаРазмещения(МестоРазмещенияДанных, "П000020004003");
	Строка040 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Строка040);
	
	К1 = ПолучитьДанныеИзМестаРазмещения(МестоРазмещенияДанных, "П000020008003");
	К2 = ПолучитьДанныеИзМестаРазмещения(МестоРазмещенияДанных, "П000020009003");
	
	Строка050Графа2 = ПолучитьДанныеИзМестаРазмещения(МестоРазмещенияДанных, "П000020005003");
	Строка060Графа2 = ПолучитьДанныеИзМестаРазмещения(МестоРазмещенияДанных, "П000020006003");
	Строка070Графа2 = ПолучитьДанныеИзМестаРазмещения(МестоРазмещенияДанных, "П000020007003");
	
	// Календарные дни в отчетных периодах.
	Строка050Графа4 = КоличествоДней.ПервыйМесяц;
	Строка060Графа4 = КоличествоДней.ВторойМесяц;
	Строка070Графа4 = КоличествоДней.ТретийМесяц;
	
	// Количество дней осуществления деятельности.
	Строка050Графа3 = ПолучитьДанныеИзМестаРазмещения(МестоРазмещенияДанных, "П000020005004");
	Строка060Графа3 = ПолучитьДанныеИзМестаРазмещения(МестоРазмещенияДанных, "П000020006004");
	Строка070Графа3 = ПолучитьДанныеИзМестаРазмещения(МестоРазмещенияДанных, "П000020007004");
	
	Строка050Графа3 = ?(Строка050Графа3 = 0, Строка050Графа4, Строка050Графа3);
	Строка060Графа3 = ?(Строка060Графа3 = 0, Строка060Графа4, Строка060Графа3);
	Строка070Графа3 = ?(Строка070Графа3 = 0, Строка070Графа4, Строка070Графа3);
	
	// Учет времени осуществления деятельности.
	Строка050Графа2 = Строка050Графа2 * Строка050Графа3 / Строка050Графа4;
	Строка060Графа2 = Строка060Графа2 * Строка060Графа3 / Строка060Графа4;
	Строка070Графа2 = Строка070Графа2 * Строка070Графа3 / Строка070Графа4;
	
	ЗначениеСтроки100 = Строка040 * К1 * К2 * (Строка050Графа2 + Строка060Графа2 + Строка070Графа2);
	ЗначениеСтроки100 = Окр(ЗначениеСтроки100, 2);
	
	ПоместитьДанныеПоМестуРазмещения(МестоРазмещенияДанных, "П000020010003", ЗначениеСтроки100);
	
	Строка100 = ПолучитьДанныеИзМестаРазмещения(МестоРазмещенияДанных, "П000020010003");
	Строка100 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Строка100);
	
	ЗначениеСтроки110 = Окр(Строка100 * 15 / 100, 2);
	ПоместитьДанныеПоМестуРазмещения(МестоРазмещенияДанных, "П000020011003", ЗначениеСтроки110);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция КалендарныеДниПериода(мДатаКонцаПериодаОтчета)
	
	Результат = Новый Структура;
	
	ПервыйМесяц = День(КонецМесяца(ДобавитьМесяц(мДатаКонцаПериодаОтчета, -2)));
	Результат.Вставить("ПервыйМесяц", ПервыйМесяц);
	
	ВторойМесяц = День(КонецМесяца(ДобавитьМесяц(мДатаКонцаПериодаОтчета, -1)));
	Результат.Вставить("ВторойМесяц", ВторойМесяц);
	
	ТретийМесяц = День(КонецМесяца(мДатаКонцаПериодаОтчета));
	Результат.Вставить("ТретийМесяц", ТретийМесяц);
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьДанныеИзМестаРазмещения(МестоРазмещенияДанных, АдресДанных)
	
	Если ТипЗнч(МестоРазмещенияДанных) = Тип("СписокЗначений") Тогда
		ЗначениеВСтруктуре = Неопределено;
		Если МестоРазмещенияДанных[0].Значение.Свойство(АдресДанных, ЗначениеВСтруктуре) Тогда
			Возврат ЗначениеВСтруктуре;
		Иначе
			ВызватьИсключение "Невозможно получить данные из структуры: поле " + АдресДанных + " не существует";
		КонецЕсли;
	Иначе
		// Это должны быть данные в поле табличного документа.
		Возврат МестоРазмещенияДанных.Области[АдресДанных].Значение;
	КонецЕсли;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ПоместитьДанныеПоМестуРазмещения(МестоРазмещенияДанных, АдресДанных, ЗначениеДанных)
	
	Если ТипЗнч(МестоРазмещенияДанных) = Тип("СписокЗначений") Тогда
		МестоРазмещенияДанных[0].Значение.Вставить(АдресДанных, ЗначениеДанных);
	Иначе
		МестоРазмещенияДанных.Области[АдресДанных].Значение = ЗначениеДанных;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПримечаниеРаздел3Строка050()
	
	Если СтруктураРеквизитовФормы.ОпределятьТрудНаемныхРабочих И НЕ СтруктураРеквизитовФормы.ИПИспользуетТрудНаемныхРаботников Тогда
		ТекстПримечания = "Ограничение суммы уменьшения страховых взносов не распространяется
		                  |на Индивидуальных предпринимателей, не использующих труд наемных
		                  |работников. Подробнее см. Справку";
	Иначе
		ТекстПримечания = "";
	КонецЕсли;
	
	ТабличныйДокумент.Области.ЗаголовокСтроки050.Примечание.Текст = ТекстПримечания;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьРаздел3()
	
	ОчисткаИПодготовкаРаздела3НаСервере();
	
	ОКАТО = СуммаПоказателяПоВсемСтраницам(ЭтаФорма, "П000020010003", Истина);
	
	Если ТипЗнч(ОКАТО) <> Тип("Число") Тогда
		Возврат;
	КонецЕсли; 
	
	ТабличныйДокумент.Области.П000030001003.Значение = ОКАТО;
	ТабличныйДокумент.Области.П000030002003.Значение = СуммаПоказателяПоВсемСтраницам(ЭтаФорма, "П000020011003", Истина);

	Расчет(ЭтаФорма, "Раздел3", "П000020005003");
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СуммаПоказателяПоВсемСтраницам(Форма, Показатель, Округлять)
	
	Результат = 0;
	
	Для Каждого Лист Из Форма.ТаблицаСтраницыРаздела2 Цикл
		
		Если Лист.Данные.Количество() = 0 Тогда
			Прервать;
		КонецЕсли;
				
		ДанныеТаблПоле = Лист.Данные[0];
			
		Если Не ЗначениеЗаполнено(ДанныеТаблПоле.Значение.П000020003000) Тогда
			
			Сообщение = Новый СообщениеПользователю;
			
			Сообщение.Текст = НСтр("ru='Не заполнен код ОКАТО на странице Раздела 2!'");
			
			Сообщение.Сообщить();
			
			СтатусПроверки = Ложь;
			Возврат Ложь;
			
		КонецЕсли; 
		
		Результат = Результат + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, ДанныеТаблПоле.Значение[Показатель]);	
				
	КонецЦикла; 
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаИзмененияСодержимогоВПолеТабличногоДокумента(Элемент, Область)
	
	Перем ТаблицаСтраницРаздела;
	
	ПараметрВводаПоля = СвойстваПоказателей.НайтиСтроки(Новый Структура("Показатель", Область.Имя));
	
	Если ПараметрВводаПоля.Количество() > 0 Тогда
		
		ПараметрВводаПоля = ПараметрВводаПоля[0];
		
		Если ПараметрВводаПоля.Тип = "ОКАТО" И ЗначениеЗаполнено(Область.Значение) Тогда
			ДлинаЗначения = СтрДлина(СокрЛП(Область.Значение));
			Для Инд = ДлинаЗначения+1 По 11 Цикл
				Область.Значение = СокрЛП(Область.Значение) + "0";
			КонецЦикла;
		КонецЕсли;
		
		Если СтрДлина(СокрЛП(Область.Значение)) <> 0 И ПараметрВводаПоля.Длина <> 0 И СтрДлина(СокрЛП(Область.Значение)) <> ПараметрВводаПоля.Длина Тогда
									
			Сообщение = Новый СообщениеПользователю;

			Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Длина значения показателя должна быть равна %1!'"), ПараметрВводаПоля.Длина);

			Сообщение.Сообщить();
			
		КонецЕсли;
	
	КонецЕсли;
	
	Если Область.Имя = "ОКВЭД" Тогда
		
		Если НЕ ПустаяСтрока(Область.Значение) И НЕ РегламентированнаяОтчетностьКлиентСервер.ОКВЭДСоответствуетТребованиям(Область.Значение) Тогда
					
			Сообщение = Новый СообщениеПользователю;

			Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='На титульном листе задано некорректное значение кода вида деятельности по ОКВЭД!%1Допустимы значения, соответствующие следующим шаблонам:%2""XX"", ""XX.X"", ""XX.XX"", ""XX.XX.X"", ""XX.XX.XX"" (X - любая цифра).'"), Символы.ПС, Символы.ПС);

			Сообщение.Сообщить();

		КонецЕсли;
		
	КонецЕсли;
		
	Если Область.Имя = "ФормаРеорганизации" ИЛИ Область.Имя = "П000020001000" Тогда
		
		УстановитьДоступностьОбластей(ЭтаФорма, СтруктураРеквизитовФормы.НаимТекущегоРаздела);
		
	КонецЕсли;
	
	ИмяРаздела = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим;
	
	Если ИмяРаздела = "Раздел2" 
	 ИЛИ ИмяРаздела = "Раздел3" Тогда
		
		ИмяОбласти = Область.Имя;
						
		РасчетНаКлиенте(ИмяРаздела, ИмяОбласти, Истина);
				
	КонецЕсли;
	
	Модифицированность = Истина;
		          	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьК1ПоУмолчанию(Форма)
		
	Если Год(Форма.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) >= 2014 Тогда
		Возврат 1.672;
	ИначеЕсли Год(Форма.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) >= 2013 Тогда
		Возврат 1.569;
	ИначеЕсли Год(Форма.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) >= 2012 Тогда
		Возврат 1.4942;
	ИначеЕсли Год(Форма.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) >= 2011 Тогда
		Возврат 1.372;
	Иначе
		Возврат 1.295;
	КонецЕсли;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьОбластей(Форма, ИмяСтраницыПанели = "")
	
	Если ИмяСтраницыПанели = "Титульный" Тогда
		ОпределяющаяОбласть    = Форма.ТабличныйДокумент.Области.ФормаРеорганизации;
		ОбрабатываемаяОбласть1 = Форма.ТабличныйДокумент.Области.РеорганизацияИНН;
		ОбрабатываемаяОбласть2 = Форма.ТабличныйДокумент.Области.РеорганизацияКПП;
		Если ПустаяСтрока(ОпределяющаяОбласть.Значение)
		 ИЛИ ОпределяющаяОбласть.Значение = "0" Тогда
			ЗапретитьВводДанныхВОбласть(Форма, ОбрабатываемаяОбласть1);
			ЗапретитьВводДанныхВОбласть(Форма, ОбрабатываемаяОбласть2);
		Иначе
			РазрешитьВводДанныхВОбласть(Форма, ОбрабатываемаяОбласть1);
			РазрешитьВводДанныхВОбласть(Форма, ОбрабатываемаяОбласть2);
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Раздел2" Тогда
		
		КодВидаПредпринимательскойДеятельности = Форма.ТабличныйДокумент.Области.П000020001000.Значение;
		
		Если КодВидаПредпринимательскойДеятельности <> "01" 
		   И КодВидаПредпринимательскойДеятельности <> "02" 
		   И КодВидаПредпринимательскойДеятельности <> "03" Тогда
			ЗапретитьВводДанныхВСтроку015Раздела2(Форма);
		Иначе
			РазрешитьВводДанныхВСтроку015Раздела2(Форма);
		КонецЕсли;
		
		ЕстьДатыПостановкиНаУчет = ЗначениеЗаполнено(Форма.ТабличныйДокумент.Области.П000020003101.Значение);
		Если ЕстьДатыПостановкиНаУчет Тогда
			ЦветГиперссылки = Новый Цвет(0, 0, 255);
			ОтображатьГиперссылку = Истина;
			ЦветФона = Форма.мСтруктураЦветовРаскраски["_0"];
			ЗащитаПолей = Ложь;
		Иначе
			ЦветГиперссылки = Новый Цвет(128, 128, 128);
			ОтображатьГиперссылку = Ложь;
			ЦветФона = Форма.мСтруктураЦветовРаскраски["_5"];
			ЗащитаПолей = Истина;
		КонецЕсли;
		
		Инд = 1;
		Пока Истина Цикл
			ИмяПоляДаты        = "П000020003201_" + СтрокаЧГ0(Инд);
			ИмяПоляГиперссылки = "П000020003301_" + СтрокаЧГ0(Инд);
			
			Если Форма.ТабличныйДокумент.Области.Найти(ИмяПоляДаты) = Неопределено Тогда
				Прервать;
			КонецЕсли;
			
			ОбластьПоляДаты        = Форма.ТабличныйДокумент.Области[ИмяПоляДаты];
			ОбластьПоляГиперссылки = Форма.ТабличныйДокумент.Области[ИмяПоляГиперссылки];
			
			ОбластьПоляДаты.Защита   = ЗащитаПолей;
			ОбластьПоляДаты.ЦветФона = ЦветФона;
			
			ОбластьПоляГиперссылки.ЦветТекста  = ЦветГиперссылки;
			ОбластьПоляГиперссылки.Гиперссылка = ОтображатьГиперссылку;
			
			Инд = Инд + 1;
		КонецЦикла;
		
		ЕстьДатыПостановкиНаУчет = ЗначениеЗаполнено(Форма.ТабличныйДокумент.Области.П000020003401.Значение);
		Если ЕстьДатыПостановкиНаУчет Тогда
			ЦветГиперссылки = Новый Цвет(0, 0, 255);
			ОтображатьГиперссылку = Истина;
			ЦветФона = Форма.мСтруктураЦветовРаскраски["_0"];
			ЗащитаПолей = Ложь;
		Иначе
			ЦветГиперссылки = Новый Цвет(128, 128, 128);
			ОтображатьГиперссылку = Ложь;
			ЦветФона = Форма.мСтруктураЦветовРаскраски["_5"];
			ЗащитаПолей = Истина;
		КонецЕсли;
		
		Инд = 1;
		Пока Истина Цикл
			ИмяПоляДаты        = "П000020003501_" + СтрокаЧГ0(Инд);
			ИмяПоляГиперссылки = "П000020003601_" + СтрокаЧГ0(Инд);
			
			Если Форма.ТабличныйДокумент.Области.Найти(ИмяПоляДаты) = Неопределено Тогда
				Прервать;
			КонецЕсли;
			
			ОбластьПоляДаты        = Форма.ТабличныйДокумент.Области[ИмяПоляДаты];
			ОбластьПоляГиперссылки = Форма.ТабличныйДокумент.Области[ИмяПоляГиперссылки];
			
			ОбластьПоляДаты.Защита   = ЗащитаПолей;
			ОбластьПоляДаты.ЦветФона = ЦветФона;
			
			ОбластьПоляГиперссылки.ЦветТекста  = ЦветГиперссылки;
			ОбластьПоляГиперссылки.Гиперссылка = ОтображатьГиперссылку;
			
			Инд = Инд + 1;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗапретитьВводДанныхВОбласть(Форма, ОбрабатываемаяОбласть)
	
	ЦветНедоступнойОбласти = Форма.мСтруктураЦветовРаскраски["_5"];
	
	ОбрабатываемаяОбласть.Защита   = Истина;
	ОбрабатываемаяОбласть.ЦветФона = ЦветНедоступнойОбласти;
	
	ТипЗначенияОбласти = ТипЗнч(ОбрабатываемаяОбласть.Значение);
	Если ТипЗначенияОбласти = Тип("Число") Тогда
		ОбрабатываемаяОбласть.Значение = 0;
	ИначеЕсли ТипЗначенияОбласти = Тип("Строка") Тогда
		ОбрабатываемаяОбласть.Значение = "";
	Иначе
		ОбрабатываемаяОбласть.Значение = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РазрешитьВводДанныхВОбласть(Форма, ОбрабатываемаяОбласть)
	
	ЦветОбластиРучногоВвода = Форма.мСтруктураЦветовРаскраски["_0"];
	
	ОбрабатываемаяОбласть.Защита   = Ложь;
	ОбрабатываемаяОбласть.ЦветФона = ЦветОбластиРучногоВвода;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗапретитьВводДанныхВСтроку015Раздела2(Форма)
	
	Для Инд = 1 По 6 Цикл
		НомерСтроки = Формат(Инд, "ЧГ=0");
		ЗапретитьВводДанныхВОбласть(Форма, Форма.ТабличныйДокумент.Области["П000020001501" + "_" + НомерСтроки]);
		ЗапретитьВводДанныхВОбласть(Форма, Форма.ТабличныйДокумент.Области["П000020001502" + "_" + НомерСтроки]);
		ЗапретитьВводДанныхВОбласть(Форма, Форма.ТабличныйДокумент.Области["П000020001503" + "_" + НомерСтроки]);
		ЗапретитьВводДанныхВОбласть(Форма, Форма.ТабличныйДокумент.Области["П000020001504" + "_" + НомерСтроки]);
		ЗапретитьВводДанныхВОбласть(Форма, Форма.ТабличныйДокумент.Области["П000020001505" + "_" + НомерСтроки]);
		ЗапретитьВводДанныхВОбласть(Форма, Форма.ТабличныйДокумент.Области["П000020001506" + "_" + НомерСтроки]);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РазрешитьВводДанныхВСтроку015Раздела2(Форма)
	
	Для Инд = 1 По 6 Цикл
		НомерСтроки = Формат(Инд, "ЧГ=0");
		РазрешитьВводДанныхВОбласть(Форма, Форма.ТабличныйДокумент.Области["П000020001501" + "_" + НомерСтроки]);
		РазрешитьВводДанныхВОбласть(Форма, Форма.ТабличныйДокумент.Области["П000020001502" + "_" + НомерСтроки]);
		РазрешитьВводДанныхВОбласть(Форма, Форма.ТабличныйДокумент.Области["П000020001503" + "_" + НомерСтроки]);
		РазрешитьВводДанныхВОбласть(Форма, Форма.ТабличныйДокумент.Области["П000020001504" + "_" + НомерСтроки]);
		РазрешитьВводДанныхВОбласть(Форма, Форма.ТабличныйДокумент.Области["П000020001505" + "_" + НомерСтроки]);
		РазрешитьВводДанныхВОбласть(Форма, Форма.ТабличныйДокумент.Области["П000020001506" + "_" + НомерСтроки]);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РазделыОтчетаПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено
	 ИЛИ Элемент.ТекущаяСтрока = СтруктураРеквизитовФормы.ТекущаяСтрокаРазделовОтчета Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураРеквизитовФормы.ТекущаяСтрокаРазделовОтчета = Элемент.ТекущаяСтрока;
		
	Элементы.ОчиститьТекущуюСтраницу.Доступность = Истина;
	
	Если СтруктураРеквизитовФормы.ВыводитьСтраницуВТаблДокНаСервере Тогда
		
		Если Элемент.ТекущиеДанные.РазделМногостраничный Тогда
			
			Элемент.ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета = ?(Элемент.ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета = Неопределено
															        ИЛИ Элемент.ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета = 0, 1, Элемент.ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета);
																
		КонецЕсли;														
				
		ВывестиМакетСтраницыВТабличныйДокументНаСервере(Элемент.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим, Элемент.ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета);
		
	Иначе
		
		СтруктураРеквизитовФормы.ВыводитьСтраницуВТаблДокНаСервере = Истина;
		
	КонецЕсли;
		
	КМенюРО = Элементы.РазделыОтчета.КонтекстноеМеню;
	Если Элемент.ТекущиеДанные.РазделМногостраничный Тогда
		Элемент.Развернуть(Элемент.ТекущаяСтрока);
		КМенюРО.Видимость = Истина;
		
		Если Элемент.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
			Элементы.ОчиститьТекущуюСтраницу.Доступность = Ложь;
		КонецЕсли;
		
		Если Элемент.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
			КМенюРО.ПодчиненныеЭлементы.РазделыОтчетаКонтекстноеМенюУдалитьСтраницу.Видимость = Ложь;
			КМенюРО.ПодчиненныеЭлементы.РазделыОтчетаКонтекстноеМенюДобавитьСтраницу.Видимость = Истина;
		ИначеЕсли Элемент.ТекущиеДанные.ПолучитьРодителя().ПолучитьЭлементы().Количество() = 1 Тогда
			КМенюРО.ПодчиненныеЭлементы.РазделыОтчетаКонтекстноеМенюУдалитьСтраницу.Видимость = Ложь;
			КМенюРО.ПодчиненныеЭлементы.РазделыОтчетаКонтекстноеМенюДобавитьСтраницу.Видимость = Истина;
		Иначе
			КМенюРО.ПодчиненныеЭлементы.РазделыОтчетаКонтекстноеМенюУдалитьСтраницу.Видимость = Истина;
			КМенюРО.ПодчиненныеЭлементы.РазделыОтчетаКонтекстноеМенюДобавитьСтраницу.Видимость = Истина;
		КонецЕсли;
	Иначе
		КМенюРО.Видимость = Ложь;
		КМенюРО.ПодчиненныеЭлементы.РазделыОтчетаКонтекстноеМенюУдалитьСтраницу.Видимость = Ложь;
		КМенюРО.ПодчиненныеЭлементы.РазделыОтчетаКонтекстноеМенюДобавитьСтраницу.Видимость = Ложь;
	КонецЕсли;
	
	Если Элемент.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим = "Титульный" Тогда
		Элементы.Обновить.Доступность                  = Истина;
	Иначе
		Элементы.Обновить.Доступность                  = Ложь;
	КонецЕсли;
	
	Если Элемент.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим = "Раздел3" Тогда
		УстановитьПримечаниеРаздел3Строка050();
	КонецЕсли;
	
	Если Элемент.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим = "Раздел2" Тогда
		
		ТабличныйДокумент.Области.П000020003301_1.Гиперссылка = Истина;
		ТабличныйДокумент.Области.П000020003601_1.Гиперссылка = Истина;
		
	КонецЕсли;
	
	РегламентированнаяОтчетностьКлиент.СпрятатьСсылкуУдалитьСтраницу(ЭтаФорма);
	
	Элементы.ТабличныйДокумент.ТекущаяОбласть = ТабличныйДокумент.Область(1, 1);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьДанныеРаздела(НаимРаздела, ОчищатьРазделЕслиЕстьМногострочность, ИзменятьАктивнуюСтраницу = Истина)	
	
	// Многостраничные разделы.
	//
	Если НаимРаздела = "Раздел1" Тогда
		
		СтруктураДанных = Новый Структура;
		
		Для Каждого Область Из ТабличныйДокумент.Области Цикл
			
			Если Область.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник И Область.СодержитЗначение Тогда
				СтруктураДанных.Вставить(Область.Имя, Область.Значение);
			КонецЕсли;
			
		КонецЦикла;
		
		НаимТаблицыСтраницы = "ТаблицаСтраницыРаздела1";
		
		АктивнаяСтраница = ЭтаФорма[НаимТаблицыСтраницы].НайтиСтроки(Новый Структура("АктивнаяСтраница", Истина));
		
		Если АктивнаяСтраница.Количество() > 0 Тогда
			
			АктивнаяСтраница = АктивнаяСтраница[0];
			
			АктивнаяСтраница.Данные.Очистить();
			АктивнаяСтраница.Данные.Добавить(СтруктураДанных);
			
			АктивнаяСтраница.АктивнаяСтраница = НЕ ИзменятьАктивнуюСтраницу;
			
		КонецЕсли;
		
	// Многостраничные и многострочные разделы.
	//	
	ИначеЕсли НаимРаздела = "Раздел2" Тогда
		
		ТаблицаСтраницРаздела = Неопределено;
		
		мСтруктураМногостраничныхРазделов.Свойство(НаимРаздела, ТаблицаСтраницРаздела);
		
		ТаблицаСтраницРаздела = ЭтаФорма[ТаблицаСтраницРаздела];
		
		СтрТаблицаСтраницы = ТаблицаСтраницРаздела.НайтиСтроки(Новый Структура("АктивнаяСтраница", Истина));
		
		Если СтрТаблицаСтраницы.Количество() > 0 Тогда
			
			СтрТаблицаСтраницы = СтрТаблицаСтраницы[0];
			
			СтруктураДанныхТекущейТаблицы = СобратьДанныеТекущегоТаблПоля(ЭтаФорма, "ТабличныйДокумент");
			
			ЗагТекущейСтраницыПанели = СтрТаблицаСтраницы.Представление;
			
			Если ПустаяСтрока(СтрТаблицаСтраницы.Представление) 
				ИЛИ (СтрТаблицаСтраницы.Представление = "Новая страница") Тогда
				
				НаименованиеДопСтраницы = ТабличныйДокумент.Области.П000020001000.Значение;
				
				Если Не ПустаяСтрока(НаименованиеДопСтраницы) Тогда
					ЗагТекущейСтраницыПанели = НаименованиеДопСтраницы;
				Иначе
					ЗагТекущейСтраницыПанели = "Новая страница";
				КонецЕсли;
				
				СтрТаблицаСтраницы.Представление = ЗагТекущейСтраницыПанели;
			КонецЕсли;
			
			СтруктураДанныхДопСтрокРаздела = СформироватьСтруктуруДанныхДопСтрокСтраницы(НаимРаздела);
			
			Если СтрТаблицаСтраницы.Данные.Количество() > 0 Тогда
				СтрТаблицаСтраницы.Данные[0].Значение = СтруктураДанныхТекущейТаблицы;
			Иначе
				СтрТаблицаСтраницы.Данные.Добавить(СтруктураДанныхТекущейТаблицы);
			КонецЕсли;
			
			Если СтрТаблицаСтраницы.ДанныеДопСтрок.Количество() > 0 Тогда
				СтрТаблицаСтраницы.ДанныеДопСтрок[0].Значение = СтруктураДанныхДопСтрокРаздела;
			Иначе
				СтрТаблицаСтраницы.ДанныеДопСтрок.Добавить(СтруктураДанныхДопСтрокРаздела, "ДанныеФормыКоллекцияТаблицаДопСтрокРаздела");
			КонецЕсли;
			
			СтрТаблицаСтраницы.АктивнаяСтраница = НЕ ИзменятьАктивнуюСтраницу;
			
		КонецЕсли;		
			
	// Обычные разделы.
	//
	Иначе
		
		ЭтаФорма["СтруктураДанных" + НаимРаздела] = СобратьДанныеТекущегоТаблПоля(ЭтаФорма, "ТабличныйДокумент");
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ВывестиМакетСтраницыВТабличныйДокументНаСервере(ИмяТекРаздела, НомерСтраницыРазделаОтчета)
		
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела, Истина);
			
	ВывестиМакетВТаблДокНаСервере(ИмяТекРаздела, НомерСтраницыРазделаОтчета);
	
	СтруктураРеквизитовФормы.НаимТекущегоРаздела  = ИмяТекРаздела;
	СтруктураРеквизитовФормы.НомерТекущейСтраницы = НомерСтраницыРазделаОтчета;
	
	УстановитьДоступностьОбластей(ЭтаФорма, ИмяТекРаздела);
						
КонецПроцедуры

&НаСервере
Процедура ВывестиМакетВТаблДокНаСервере(ИмяТекРаздела, НомерСтраницыРазделаОтчета)
	
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(ОбъектОтчета(ЭтаФорма.ИмяФормы).ПолучитьМакет(Сред(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, "ФормаОтчета")) + "_" + ИмяТекРаздела));
	
	// Многостраничные разделы.
	//
	Если ИмяТекРаздела = "Раздел1" Тогда
		
		НаимТаблицыСтраницы = "ТаблицаСтраницыРаздела1";
				
		СтруктураДанных = Новый Структура;
		
		СписокДанных = ЭтаФорма[НаимТаблицыСтраницы][НомерСтраницыРазделаОтчета - 1].Данные;
		
		Для каждого ТаблицаСтраницы Из ЭтаФорма[НаимТаблицыСтраницы] Цикл
			ТаблицаСтраницы.АктивнаяСтраница = Ложь;
		КонецЦикла;
		
		ЭтаФорма[НаимТаблицыСтраницы][НомерСтраницыРазделаОтчета - 1].АктивнаяСтраница = Истина;
		
		Если СписокДанных.Количество() > 0 Тогда
			СтруктураДанных = СписокДанных[0].Значение;
		Иначе
			ЗаполнитьПоказателиЗначениямиПоУмолчанию(ИмяТекРаздела);	
		КонецЕсли;
		
		Для Каждого ЭлСтруктуры Из СтруктураДанных Цикл
			Обл = ТабличныйДокумент.Области.Найти(ЭлСтруктуры.Ключ);
			Если Обл <> Неопределено И Обл.СодержитЗначение Тогда 
				Обл.Значение = ЭлСтруктуры.Значение;
			КонецЕсли;
		КонецЦикла;
		
		Если ЭтаФорма[НаимТаблицыСтраницы].Количество() = 1 Тогда 
			Обл = ТабличныйДокумент.Области["УдалитьСтраницуЗначок"];
			Обл.Гиперссылка = Ложь;
			Обл.Текст = "";
			Обл = ТабличныйДокумент.Области["УдалитьСтраницу"];
			Обл.Гиперссылка = Ложь;
			Обл.Текст = "";
		Иначе
			Обл = ТабличныйДокумент.Области["УдалитьСтраницуЗначок"];
			Обл.Гиперссылка = Истина;
			Обл.Текст = "х";
			Обл = ТабличныйДокумент.Области["УдалитьСтраницу"];
			Обл.Гиперссылка = Истина;
			Обл.Текст = "Удалить страницу";
		КонецЕсли;

		
	// Многостраничные и многострочные разделы.
	//	
	ИначеЕсли ИмяТекРаздела = "Раздел2" Тогда
		
		НаимТаблицыСтраницы = "ТаблицаСтраницыРаздела2";
		
		СтруктураДанных = Новый Структура;
		
		СписокДанных = ЭтаФорма[НаимТаблицыСтраницы][НомерСтраницыРазделаОтчета - 1].Данные;
		
		Для каждого ТаблицаСтраницы Из ЭтаФорма[НаимТаблицыСтраницы] Цикл
			ТаблицаСтраницы.АктивнаяСтраница = Ложь;
		КонецЦикла;
		
		ЭтаФорма[НаимТаблицыСтраницы][НомерСтраницыРазделаОтчета - 1].АктивнаяСтраница = Истина;
		
		Если СписокДанных.Количество() > 0 Тогда
			СтруктураДанных = СписокДанных[0].Значение;
		Иначе	
			ЗаполнитьПоказателиЗначениямиПоУмолчанию(ИмяТекРаздела);		
		КонецЕсли;
		
		Для Каждого ЭлСтруктуры Из СтруктураДанных Цикл
			Обл = ТабличныйДокумент.Области.Найти(ЭлСтруктуры.Ключ);
			Если Обл <> Неопределено И Обл.СодержитЗначение Тогда 
				Обл.Значение = ЭлСтруктуры.Значение;
			КонецЕсли;
		КонецЦикла;
		
		ТаблицаСтраницРаздела = Неопределено;
		
		мСтруктураМногостраничныхРазделов.Свойство(ИмяТекРаздела, ТаблицаСтраницРаздела);
		
		ТаблицаСтраницРаздела = ЭтаФорма[ТаблицаСтраницРаздела];
		
		СтрСледующаяСтраница = ТаблицаСтраницРаздела[НомерСтраницыРазделаОтчета - 1];
		
		СтрСледующаяСтраница.АктивнаяСтраница = Истина;
		
		ТаблицаВариантыЗаполнения = РегламентированнаяОтчетностьВызовСервера.ПолучитьТаблицуВариантовЗаполненияНаСервере(ЭтаФорма, ИмяТекРаздела);
		
		НовДанныеДопСтрокРаздела = СтрСледующаяСтраница.ДанныеДопСтрок;
		
		Если (ТипЗнч(НовДанныеДопСтрокРаздела) = Тип("СписокЗначений"))
			И (НовДанныеДопСтрокРаздела.Количество() > 0)
			И (НовДанныеДопСтрокРаздела[0].Представление = "ДанныеФормыКоллекцияТаблицаДопСтрокРаздела") Тогда
			
			НовДанныеДопСтрокРаздела = НовДанныеДопСтрокРаздела[0].Значение;
			
		Иначе
			
			НовДанныеДопСтрокРаздела = Неопределено;
			
		КонецЕсли;
		
		Если НовДанныеДопСтрокРаздела <> Неопределено Тогда
			
			Для Каждого ГруппаСтрок Из НовДанныеДопСтрокРаздела Цикл
				
				ИмяГруппыДопСтрок = ГруппаСтрок.Ключ;
				ДанныеГруппыСтрок = ГруппаСтрок.Значение;
				
				ПромТаблицаГруппыСтрок = ЭтаФорма["Хранилище" + ИмяГруппыДопСтрок].Добавить().Таблица;
				
				КопироватьДанныеФормы(ДанныеГруппыСтрок, ПромТаблицаГруппыСтрок);
				
				// Заменяем таблицу значений с данными текущей страницы.
				КопироватьДанныеФормы(ПромТаблицаГруппыСтрок, ЭтаФорма[ИмяГруппыДопСтрок]);
				
				ВывестиРазделВТабличныйДокумент(ЭтаФорма, ИмяГруппыДопСтрок, ПромТаблицаГруппыСтрок);
				ОбновитьСтруктуруМногострочногоРаздела(ИмяГруппыДопСтрок);
				
			КонецЦикла;
			
		КонецЕсли;
		         		
	// Обычные разделы.
	//	
	Иначе
		
		Для Каждого ЭлСтруктуры Из ЭтаФорма["СтруктураДанных" + ИмяТекРаздела] Цикл
			Обл = ТабличныйДокумент.Области.Найти(ЭлСтруктуры.Ключ);
			Если Обл <> Неопределено И Обл.СодержитЗначение Тогда 
				Обл.Значение = ЭлСтруктуры.Значение;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;	
	
	Если ИмяТекРаздела = "Титульный" Тогда
		УправлениеЛистамиНаСервере();
	Иначе
		УстановитьФорматВыводаВПоляхВводаНаСервере(ИмяТекРаздела);
		УстановитьЦветФонаЯчейкиНаСервере(,, ИмяТекРаздела);
	КонецЕсли;
	
	УстановитьМаскиВПоляхВвода(ИмяТекРаздела);
			
КонецПроцедуры

&НаСервере
Процедура УстановитьМаскиВПоляхВвода(ИмяТекРаздела)
	
	МаскаКБК = "99999999999999999999";
	МаскаОКАТО = "99999999999";

	// Титульный лист.
	Если ИмяТекРаздела = "Титульный" Тогда
		
		ТабличныйДокумент.Области["Период"].Маска = "99";
		ТабличныйДокумент.Области["Прил"].Маска = "999";
		ТабличныйДокумент.Области["ПоМесту"].Маска = "999";
		ТабличныйДокумент.Области["КодИМНС"].Маска = "9999";
		ТабличныйДокумент.Области["ФормаРеорганизации"].Маска = "9";
		ТабличныйДокумент.Области["РеорганизацияИНН"].Маска = "9999999999";
		ТабличныйДокумент.Области["РеорганизацияКПП"].Маска = "999999999";
		
	// Раздел 1.
	ИначеЕсли ИмяТекРаздела = "Раздел1" Тогда
		
		ТабличныйДокумент.Области["П000010001003"].Маска = МаскаКБК;
		Для Инд = 1 По 8 Цикл
			ТабличныйДокумент.Области["П000010002003_" + Инд].Маска = МаскаОКАТО;
		КонецЦикла;
		
	// Раздел 2.
	ИначеЕсли ИмяТекРаздела = "Раздел2" Тогда

		ТабличныйДокумент.Области["П000020001000"].Маска = "99";
		ТабличныйДокумент.Области["П000020002002"].Маска = "99";
		
		ТабличныйДокумент.Области["П000020002001"].Маска = "999999";
		ТабличныйДокумент.Области["П000020002002"].Маска = "99";
		
		ТабличныйДокумент.Области["П000020003000"].Маска = МаскаОКАТО;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоказателиЗначениямиПоУмолчанию(НаимРаздела)
	
	Если НаимРаздела = "Раздел1" Тогда
						
		// КБК по умолчанию
		Если Год(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета) >= 2011 Тогда
			ТабличныйДокумент.Области.П000010001003.Значение = "18210502010021000110";
		Иначе
			ТабличныйДокумент.Области.П000010001003.Значение = "18210502020021000110";	
		КонецЕсли;
		       		
	ИначеЕсли НаимРаздела = "Раздел2" Тогда
		
		// По умолчанию, коэф. К1 устанавливаем в соответствии с годом.
		ТабличныйДокумент.Области.П000020008003.Значение = ПолучитьК1ПоУмолчанию(ЭтаФорма);
		
		// По умолчанию, коэф. К2 устанавливаем равным 1.
		ТабличныйДокумент.Области.П000020009003.Значение = 1;
	
		ТабличныйДокумент.Области.П000020003102.Значение = "V";
		ТабличныйДокумент.Области.П000020003402.Значение = "V";
			
	КонецЕсли;
	
КонецПроцедуры
    
&НаКлиенте
Процедура ЗаполнениеЗначенийВКвадратикахНаКлиенте(Знач ИмяСтраницы) Экспорт

	ЗаполнениеЗначенийВКвадратиках(ЭтаФорма, ИмяСтраницы);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеЗначенийВКвадратикахНаСервере(Знач ИмяСтраницы) Экспорт

	ЗаполнениеЗначенийВКвадратиках(ЭтаФорма, ИмяСтраницы);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнениеЗначенийВКвадратиках(Форма, Знач ИмяСтраницы)
	
	Возврат;

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтраницу(Команда)
	
	Если Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим = "Раздел1" Тогда
		
		КБК = ТабличныйДокумент.Области.П000010001003.Значение;
				
	КонецЕсли;
	
	ВставитьДополнительнуюСтраницуНаСервере(Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим);
	
	Если Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим = "Раздел1" Тогда
		
		ТабличныйДокумент.Области.П000010001003.Значение = КБК;
		
	ИначеЕсли Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим = "Раздел2" Тогда	
		
		// По умолчанию, коэф. К1 устанавливаем в соответствии с годом.
		ТабличныйДокумент.Области.П000020008003.Значение = ПолучитьК1ПоУмолчанию(ЭтаФорма);
		
		// По умолчанию, коэф. К2 устанавливаем равным 1.
		ТабличныйДокумент.Области.П000020009003.Значение = 1;
		
		ТабличныйДокумент.Области.П000020003102.Значение = "V";
		ТабличныйДокумент.Области.П000020003402.Значение = "V";
				
	КонецЕсли;
	
	СтруктураРеквизитовФормы.НомерТекущейСтраницы = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета;
	Обл = ТабличныйДокумент.Области["УдалитьСтраницуЗначок"];
	Обл.Гиперссылка = Истина;
	Обл.Текст = "х";
	Обл = ТабличныйДокумент.Области["УдалитьСтраницу"];
	Обл.Гиперссылка = Истина;
	Обл.Текст = "Удалить страницу";
			
КонецПроцедуры

&НаСервере
Процедура ВставитьДополнительнуюСтраницуНаСервере(ИмяТекущейСтраницыПанели = Неопределено)

	Если ИмяТекущейСтраницыПанели = "Раздел2" Тогда
		ВставитьДополнительнуюСтраницу(ИмяТекущейСтраницыПанели);
		РассчитатьДниОсуществленияДеятельности();
	Иначе
		РегламентированнаяОтчетность.ВставитьДополнительнуюСтраницуНаСервере(ЭтаФорма, ИмяТекущейСтраницыПанели);
	КонецЕсли;
	
	РегламентированнаяОтчетность.ПослеВставкиДополнительнойСтраницыНаСервере(ЭтаФорма, ИмяТекущейСтраницыПанели);
	
	РегламентированнаяОтчетностьКлиентСервер.СохранитьДанныеМногостраничногоРазделаВактивнойСтранице(ЭтаФорма, ИмяТекущейСтраницыПанели, Ложь);
		
	УстановитьДоступностьОбластей(ЭтаФорма, ИмяТекущейСтраницыПанели);
	
	СтруктураРеквизитовФормы.ВыводитьСтраницуВТаблДокНаСервере = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ВставитьДополнительнуюСтраницу(ИмяТекущейСтраницыПанели)
	
	Перем ТаблицаСтраницРаздела;
	Перем СтруктураДанныхДопСтрокРаздела;
	
	Если ИмяТекущейСтраницыПанели = Неопределено Тогда
		ИмяТекущейСтраницыПанели = СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	КонецЕсли;
	
	Если НЕ мСтруктураМногостраничныхРазделов.Свойство(ИмяТекущейСтраницыПанели, ТаблицаСтраницРаздела) Тогда
		Возврат;
	КонецЕсли;
		
	ТаблицаСтраницРаздела = ЭтаФорма[ТаблицаСтраницРаздела];
	
	ИмяТекТабличногоПоля = "ТабличныйДокумент";
	ТекТабличноеПоле     = ЭтаФорма[ИмяТекТабличногоПоля];
	
	СтруктураДанныхТекущейТаблицы = СобратьДанныеТекущегоТаблПоля(ЭтаФорма, ИмяТекТабличногоПоля);
	
	ОбновитьСтруктуруМногострочногоРаздела(СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_1);
	ОбновитьСтруктуруМногострочногоРаздела(СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_2);
	
	СтруктураДанныхДопСтрокРаздела = Новый Структура;
	
	ПромежуточнаяТаблица = Неопределено;
	мСтруктураМногострочныхРазделов.Свойство(СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_1, ПромежуточнаяТаблица);
	ПромежуточнаяТаблица = ЭтаФорма[ПромежуточнаяТаблица];
	ТаблицаДопСтрокРаздел2_1 = ЭтаФорма["Хранилище" + СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_1].Добавить().Таблица;
	КопироватьДанныеФормы(ПромежуточнаяТаблица, ТаблицаДопСтрокРаздел2_1);
	СтруктураДанныхДопСтрокРаздела.Вставить(СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_1, ТаблицаДопСтрокРаздел2_1);
	
	ПромежуточнаяТаблица = Неопределено;
	мСтруктураМногострочныхРазделов.Свойство(СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_2, ПромежуточнаяТаблица);
	ПромежуточнаяТаблица = ЭтаФорма[ПромежуточнаяТаблица];
	ТаблицаДопСтрокРаздел2_2 = ЭтаФорма["Хранилище" + СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_2].Добавить().Таблица;
	КопироватьДанныеФормы(ПромежуточнаяТаблица, ТаблицаДопСтрокРаздел2_2);
	СтруктураДанныхДопСтрокРаздела.Вставить(СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_2, ТаблицаДопСтрокРаздел2_2);
	
	Если ТаблицаСтраницРаздела.Количество() = 0 Тогда
		
		СтрТаблицаСтраницы = ТаблицаСтраницРаздела.Добавить();
		СтрТаблицаСтраницы.АктивнаяСтраница = Истина;
		СтрТаблицаСтраницы.АвтоматическоеПредставление = Истина;
		
	КонецЕсли;
	
	СтрТаблицаСтраницы = ТаблицаСтраницРаздела.НайтиСтроки(Новый Структура("АктивнаяСтраница", Истина));
	
	Если СтрТаблицаСтраницы.Количество() > 0 Тогда
		
		СтрТаблицаСтраницы = СтрТаблицаСтраницы[0];
		
		Если ПустаяСтрока(СтрТаблицаСтраницы.Представление) 
			ИЛИ (СтрТаблицаСтраницы.Представление = "Новая страница") Тогда
			
			СтрТаблицаСтраницы.Представление = "Новая страница";
			
		КонецЕсли;
		
		Если СтрТаблицаСтраницы.Данные.Количество() > 0 Тогда
			СтрТаблицаСтраницы.Данные[0].Значение = СтруктураДанныхТекущейТаблицы;
		Иначе
			СтрТаблицаСтраницы.Данные.Добавить(СтруктураДанныхТекущейТаблицы);
		КонецЕсли;
		
		Если СтрТаблицаСтраницы.ДанныеДопСтрок.Количество() > 0 Тогда
			СтрТаблицаСтраницы.ДанныеДопСтрок[0].Значение = СтруктураДанныхДопСтрокРаздела;
		Иначе
			СтрТаблицаСтраницы.ДанныеДопСтрок.Добавить(СтруктураДанныхДопСтрокРаздела, "ДанныеФормыКоллекцияТаблицаДопСтрокРаздела");
		КонецЕсли;
		
		СтрТаблицаСтраницы.АктивнаяСтраница = Ложь;
		СтрНоваяСтраница = ТаблицаСтраницРаздела.Добавить();
		СтрНоваяСтраница.Представление      = "Новая страница";
		СтрНоваяСтраница.АктивнаяСтраница   = Истина;
		
		ОчиститьТабличноеПолеНаСервере(ИмяТекущейСтраницыПанели);
																
		РасчетНаСервере(ИмяТекущейСтраницыПанели);
		
		Модифицированность = Истина;
		
	КонецЕсли;

	УстановитьЦветФонаЯчейкиНаСервере(, , ИмяТекущейСтраницыПанели);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтраницу(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УдалитьСтраницуЗавершение", ЭтотОбъект);
	ТекстВопроса = НСтр("ru='Удалить текущую страницу?'");
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да);
		
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтраницуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.РазделыОтчета.ТекущиеДанные;
	
	КопияТекущиеДанные = ТекущиеДанные;
	
	ТекущиеДанные = ТекущиеДанные.ПолучитьРодителя();
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ПолучитьЭлементы().Количество() = 1 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтраницаРазделаПослеУдаления = Неопределено;
	Если КопияТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета = ТекущиеДанные.ПолучитьЭлементы().Количество() Тогда
		ТекущаяСтраницаРазделаПослеУдаления = РегламентированнаяОтчетностьКлиентСервер.НайтиЭлементВДанныхФормыДерево(ТекущиеДанные.ПолучитьЭлементы(), "КолонкаНомерСтраницыРазделаОтчета", КопияТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета - 1);
	КонецЕсли;
	
	УдалитьДополнительнуюСтраницуНаСервере(Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим);
	
	ТекущиеДанные.ПолучитьЭлементы().Удалить(ТекущиеДанные.ПолучитьЭлементы().Индекс(КопияТекущиеДанные));
	
	НомерСтраницы = 1;
	
	Для Каждого СтраницаРаздела Из ТекущиеДанные.ПолучитьЭлементы() Цикл
		
		СтраницаРаздела.КолонкаРазделыОтчета              = "Стр. " + НомерСтраницы;
		СтраницаРаздела.КолонкаНомерСтраницыРазделаОтчета = НомерСтраницы;
		
		НомерСтраницы = НомерСтраницы + 1;
		
	КонецЦикла;
	
	Если НЕ ТекущаяСтраницаРазделаПослеУдаления = Неопределено Тогда
		Элементы.РазделыОтчета.ТекущаяСтрока = ТекущаяСтраницаРазделаПослеУдаления.ПолучитьИдентификатор();
	КонецЕсли;
	
	Если ТекущиеДанные.ПолучитьЭлементы().Количество() = 1 Тогда 
		Обл = ТабличныйДокумент.Области["УдалитьСтраницуЗначок"];
		Обл.Гиперссылка = Ложь;
		Обл.Текст = "";
		Обл = ТабличныйДокумент.Области["УдалитьСтраницу"];
		Обл.Гиперссылка = Ложь;
		Обл.Текст = "";
	Иначе
		Обл = ТабличныйДокумент.Области["УдалитьСтраницуЗначок"];
		Обл.Гиперссылка = Истина;
		Обл.Текст = "х";
		Обл = ТабличныйДокумент.Области["УдалитьСтраницу"];
		Обл.Гиперссылка = Истина;
		Обл.Текст = "Удалить страницу";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьДополнительнуюСтраницуНаСервере(ИмяТекущейСтраницыПанели = Неопределено)

	Если ИмяТекущейСтраницыПанели = "Раздел2" Тогда
		УдалитьДополнительнуюСтраницу(ИмяТекущейСтраницыПанели);
	Иначе
		РегламентированнаяОтчетность.УдалитьДополнительнуюСтраницуНаСервере(ЭтаФорма, ИмяТекущейСтраницыПанели);
	КонецЕсли;
		
	СтруктураРеквизитовФормы.ВыводитьСтраницуВТаблДокНаСервере = Ложь;
	УстановитьДоступностьОбластей(ЭтаФорма, ИмяТекущейСтраницыПанели);
		
КонецПроцедуры

&НаСервере
Процедура УдалитьДополнительнуюСтраницу(ИмяТекущейСтраницыПанели)
	
	Перем ТаблицаСтраницРаздела;
	
	Если НЕ мСтруктураМногостраничныхРазделов.Свойство(ИмяТекущейСтраницыПанели, ТаблицаСтраницРаздела) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаСтраницРаздела = ЭтаФорма[ТаблицаСтраницРаздела];
	
	Если ТаблицаСтраницРаздела.Количество() = 1 Тогда
		Возврат;
	КонецЕсли;
	
	ИмяТекТабличногоПоля = "ТабличныйДокумент";
	ТекТабличноеПоле     = ЭтаФорма[ИмяТекТабличногоПоля];
	
	СтрТаблицаСтраницы = ТаблицаСтраницРаздела.НайтиСтроки(Новый Структура("АктивнаяСтраница", Истина));
	
	Если СтрТаблицаСтраницы.Количество() > 0 Тогда
		
		СтрТаблицаСтраницы = СтрТаблицаСтраницы[0];
		ИндексТекСтрока = ТаблицаСтраницРаздела.Индекс(СтрТаблицаСтраницы);
		ТаблицаСтраницРаздела.Удалить(СтрТаблицаСтраницы);
		
		ОчиститьТабличноеПоле(ЭтаФорма, ИмяТекущейСтраницыПанели);
		
		КолвоДопСтраниц = ТаблицаСтраницРаздела.Количество();
		
		Если КолвоДопСтраниц > 0 Тогда
			
			СтрТаблицаСтраницыЗамена = ТаблицаСтраницРаздела[Мин(ИндексТекСтрока, КолвоДопСтраниц - 1)];
			             			
			ДанныеДопСтрокРаздела = СтрТаблицаСтраницыЗамена.ДанныеДопСтрок[0].Значение;
			
			Если ДанныеДопСтрокРаздела <> Неопределено Тогда
				Для Каждого ГруппаСтрок Из ДанныеДопСтрокРаздела Цикл
					ИмяГруппыДопСтрок = ГруппаСтрок.Ключ;
					ДанныеГруппыСтрок = ГруппаСтрок.Значение;
					
					ПромТаблицаГруппыСтрок = ЭтаФорма["Хранилище" + ИмяГруппыДопСтрок].Добавить().Таблица;
					
					КопироватьДанныеФормы(ДанныеГруппыСтрок, ПромТаблицаГруппыСтрок);
					
					КопироватьДанныеФормы(ПромТаблицаГруппыСтрок, ЭтаФорма[ИмяГруппыДопСтрок]);
					
					ВывестиРазделВТабличныйДокумент(ЭтаФорма, ИмяГруппыДопСтрок, ПромТаблицаГруппыСтрок);
					
				КонецЦикла;
			КонецЕсли;
			
			СтруктураДанныхСтраницыЗамена = СтрТаблицаСтраницыЗамена.Данные[0].Значение;
			
			Для Каждого Элемент Из СтруктураДанныхСтраницыЗамена Цикл
				
				ИмяПоказателя      = Элемент.Ключ;
				ЗначениеПоказателя = Элемент.Значение;
				
				Попытка
					ЭтаФорма[ИмяТекТабличногоПоля].Области[ИмяПоказателя].Значение = ЗначениеПоказателя;
				Исключение
				КонецПопытки;
				
			КонецЦикла;
			
			СтрТаблицаСтраницыЗамена.АктивнаяСтраница = Истина;
		КонецЕсли;
		
		РасчетНаСервере(ИмяТекущейСтраницыПанели);
		Модифицированность = Истина;
	КонецЕсли;
	
	УстановитьЦветФонаЯчейкиНаСервере(, , ИмяТекущейСтраницыПанели);

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТабличноеПолеНаКлиенте(ВыбТабличноеПолеИмя) Экспорт

	ОчиститьТабличноеПоле(ЭтаФорма, ВыбТабличноеПолеИмя);

КонецПроцедуры

&НаСервере
Процедура ОчиститьТабличноеПолеНаСервере(ВыбТабличноеПолеИмя) Экспорт

	ОчиститьТабличноеПоле(ЭтаФорма, ВыбТабличноеПолеИмя);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОчиститьТабличноеПоле(Форма, ВыбТабличноеПолеИмя)
	
    ВыбТабличноеПоле = Форма.ТабличныйДокумент;
	
	МассивМногострочныхБлоков = Новый Массив;
	
	Если ВыбТабличноеПолеИмя = "Раздел2" Тогда
        		
		МассивМногострочныхБлоков.Добавить(Форма.СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_1);
		МассивМногострочныхБлоков.Добавить(Форма.СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_2);
				
		Форма.УдалитьОбластьИзТабличногоДокументаНаСервере(ВыбТабличноеПоле, ВыбТабличноеПолеИмя, МассивМногострочныхБлоков);
		
		Форма.ТабличныйДокумент = ВыбТабличноеПоле;
										
	КонецЕсли;

	СписокИтоговыхЯчеек = Новый СписокЗначений;
	
	Для каждого Область Из ВыбТабличноеПоле.Области Цикл
		Если Область.ЦветФона = Форма.СтруктураРеквизитовФормы.ЦветЗаполняетсяАвтоАрифметика И Область.Защита Тогда
			Область.Защита = Ложь;
			СписокИтоговыхЯчеек.Добавить(Область.Имя);
		КонецЕсли;
	КонецЦикла;
	
	РегламентированнаяОтчетностьКлиентСервер.ОчиститьТабличноеПоле(Форма, ВыбТабличноеПолеИмя);
	
	ВыбТабличноеПоле = Форма.ТабличныйДокумент;
	
	Для Инд = 0 По ВыбТабличноеПоле.Области.Количество() - 1 Цикл
		ТекущаяОбласть = ВыбТабличноеПоле.Области[Инд];

		Если Не ТекущаяОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
			Продолжить;
		КонецЕсли;

		Если ТекущаяОбласть.СодержитЗначение <> Истина Тогда
			Продолжить;
		КонецЕсли;

		Если ТекущаяОбласть.Защита Тогда
			Продолжить;
		КонецЕсли;

		ТекущаяОбласть.Очистить();
	КонецЦикла;
	
	Для Инд = 0 По (МассивМногострочныхБлоков.Количество() - 1) Цикл
		
		ИмяГруппыДопСтрок = МассивМногострочныхБлоков.Получить(Инд);
		
		Если ИмяГруппыДопСтрок <> Неопределено Тогда
			
			Форма.ОбновитьСтруктуруМногострочногоРаздела(ИмяГруппыДопСтрок);
			
			ИмяСтраницыПанели = ВыбТабличноеПолеИмя;
			
		КонецЕсли;
		
	КонецЦикла;
        	
	Для каждого КодИтоговогоПоказателя Из СписокИтоговыхЯчеек Цикл
		ОбластьПоказателя=ВыбТабличноеПоле.Области.Найти(КодИтоговогоПоказателя.Значение);
		Если ОбластьПоказателя <> Неопределено Тогда
			ОбластьПоказателя.Защита = Истина;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура УдалитьОбластьИзТабличногоДокументаНаСервере(ВыбТабличноеПоле, ВыбТабличноеПолеИмя, МассивМногострочныхБлоков) Экспорт
		
	Для Инд = 0 По (МассивМногострочныхБлоков.Количество() - 1) Цикл
		
		ИмяГруппыДопСтрок = МассивМногострочныхБлоков.Получить(Инд);
		
		ПромТаблицаДопСтрокРаздела = Неопределено;
		мСтруктураМногострочныхРазделов.Свойство(ИмяГруппыДопСтрок, ПромТаблицаДопСтрокРаздела);
		
		ПромТаблицаДопСтрокРаздела = ЭтаФорма[ПромТаблицаДопСтрокРаздела];
		
		ИсходноеКоличествоСтрокГруппы = 0;
		мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппыДопСтрок, ИсходноеКоличествоСтрокГруппы);
		
		ТекущееКоличествоСтрок = ПромТаблицаДопСтрокРаздела.Количество();
		
		Если ТекущееКоличествоСтрок > ИсходноеКоличествоСтрокГруппы Тогда
					
			НСтр = ПромТаблицаДопСтрокРаздела.Количество();
			
			СохрНСтр = НСтр;
											
			Пока НСтр > ИсходноеКоличествоСтрокГруппы Цикл
				
				ТекСтрокаТаблицы = ПромТаблицаДопСтрокРаздела[НСтр - 1];
				
				НомерГрафы = 1;
				
				ИмяПервойКолонки = ИмяГруппыДопСтрок + Формат(НомерГрафы, "ЧЦ=2; ЧВН=");
				ИмяПервойЯчейкиУдаляемойСтроки = ИмяПервойКолонки + "_" + НСтр;
				
				ОбластьЯчейки = ВыбТабличноеПоле.Области[ИмяПервойЯчейкиУдаляемойСтроки];
				
				НомерВерхЯчейкиОбласти = ОбластьЯчейки.Верх;
				НомерНижнЯчейкиОбласти = ОбластьЯчейки.Низ + 1;
				
				РегламентированнаяОтчетностьВызовСервера.УдалитьОбластьИзТабличногоДокумента(ВыбТабличноеПоле, НомерВерхЯчейкиОбласти, НомерНижнЯчейкиОбласти);
				
				ЭтаФорма.ТабличныйДокумент = ВыбТабличноеПоле;
				
				ПромТаблицаДопСтрокРаздела.Удалить(ТекСтрокаТаблицы);
				
				НСтр = НСтр - 1;
				
			КонецЦикла;
			
			Если ИмяГруппыДопСтрок = СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_1 Тогда
				
				ОбластьГиперссылки = ВыбТабличноеПоле.Области.Найти("П000020003301_" + СохрНСтр);
				ОбластьГиперссылки.Имя = "П000020003301_1";
				
			ИначеЕсли ИмяГруппыДопСтрок = СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_2 Тогда
				
				ОбластьГиперссылки = ВыбТабличноеПоле.Области.Найти("П000020003601_" + СохрНСтр);
				ОбластьГиперссылки.Имя = "П000020003601_1";
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	    	
КонецПроцедуры

&НаКлиенте
Процедура ОбнулитьПеременныеМодуляХранящиеЗначенияКвадратногоПредставленияПоРазделуНаКлиенте(Знач ИмяРаздела) Экспорт

	ПеременныеМодуля = Новый Структура;
	
	ОбнулитьПеременныеМодуляХранящиеЗначенияКвадратногоПредставленияПоРазделу(ИмяРаздела, ПеременныеМодуля);

КонецПроцедуры

&НаСервере
Процедура ОбнулитьПеременныеМодуляХранящиеЗначенияКвадратногоПредставленияПоРазделуНаСервере(Знач ИмяРаздела) Экспорт

	ПеременныеМодуля = Новый Структура;
	
	ОбнулитьПеременныеМодуляХранящиеЗначенияКвадратногоПредставленияПоРазделу(ИмяРаздела, ПеременныеМодуля);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбнулитьПеременныеМодуляХранящиеЗначенияКвадратногоПредставленияПоРазделу(Знач ИмяРаздела, ПеременныеМодуля)

	Возврат;
	
КонецПроцедуры

&НаКлиенте
Процедура СобратьДанные(Команда)
	
	Если СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Раздел1" Тогда
		СтруктураРеквизитовФормы.ВыводитьСтраницуВТаблДокНаСервере = Ложь;
		СформироватьРаздел1НаСервере();
		РегламентированнаяОтчетностьКлиент.ОбновитьДеревоРазделовВФормеОтчета(ЭтаФорма);
		Обл = ТабличныйДокумент.Области["УдалитьСтраницуЗначок"];
		Если ЭтаФорма["ТаблицаСтраницыРаздела1"].Количество() = 1 Тогда 
			Обл.Гиперссылка = Ложь;
			Обл.Текст = "";
			Обл = ТабличныйДокумент.Области["УдалитьСтраницу"];
			Обл.Гиперссылка = Ложь;
			Обл.Текст = "";
		Иначе
			Обл.Гиперссылка = Истина;
			Обл.Текст = "х";
			Обл = ТабличныйДокумент.Области["УдалитьСтраницу"];
			Обл.Гиперссылка = Истина;
			Обл.Текст = "Удалить страницу";
		КонецЕсли;
	ИначеЕсли СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Раздел3" Тогда
		СтруктураРеквизитовФормы.ВыводитьСтраницуВТаблДокНаСервере = Ложь;
		СформироватьРаздел3();
		РегламентированнаяОтчетностьКлиент.ОбновитьДеревоРазделовВФормеОтчета(ЭтаФорма);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура СформироватьРаздел1НаСервере()
	
	ОчисткаИПодготовкаРаздела1НаСервере();
		
	ИтоговаяТаблица = Новый ТаблицаЗначений;
	ИтоговаяТаблица.Колонки.Добавить("ОКАТО");
	ИтоговаяТаблица.Колонки.Добавить("Сумма");
	
	ОкрП000030001003 = 0;
	ОкрП000030006003 = 0;
	
	Если СтруктураДанныхРаздел3.Количество() > 0 Тогда
		
		// берем данные раздела 3
		ОкрП000030001003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, СтруктураДанныхРаздел3.П000030001003);
		ОкрП000030006003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, СтруктураДанныхРаздел3.П000030006003);	
		
	КонецЕсли;
	
	// собираем данные раздела 2
	ТаблДанных = ЭтаФорма[мСтруктураМногостраничныхРазделов.Раздел2];
	Для Каждого Стр из ТаблДанных Цикл
		
		Если Стр.Данные.Количество() = 0 Тогда
			Прервать;
		КонецЕсли;
				
		ОКАТО = Стр.Данные[0].Значение.П000020003000;
			
		Если НЕ ПустаяСтрока(ОКАТО) Тогда
			НовСтр = ИтоговаяТаблица.Добавить();
			НовСтр.ОКАТО = ОКАТО;
			НовСтр.Сумма = ?(ОкрП000030001003 = 0, 0, ОкрП000030006003 * РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, Стр.Данные[0].Значение.П000020010003) / ОкрП000030001003);
		Иначе
			Сообщение = Новый СообщениеПользователю;
			
			Сообщение.Текст = НСтр("ru='Не заполнен код ОКАТО на странице Раздела 2!'");
			
			Сообщение.Сообщить();
			
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	// сворачиваем по ОКАТО, суммируем по колонке Сумма
	ИтоговаяТаблица.Свернуть("ОКАТО", "Сумма");
	
	// заполняем раздел 1 полученными данными
	СуммаНалогаДолжноБытьВсего = ОкрП000030006003;
	СуммаНалогаПоВсемОКАТО = 0;
	КоличествоБлоковНаЛисте = 8;
	Для Инд = 0 По ИтоговаяТаблица.Количество() - 1 Цикл
		ТекСтр = ИтоговаяТаблица[Инд];
		Если Инд % КоличествоБлоковНаЛисте = 0 И Инд <> 0 Тогда
			КБК = ТабличныйДокумент.Области.П000010001003.Значение;
			ВставитьДополнительнуюСтраницуНаСервере("Раздел1");
			ТабличныйДокумент.Области.П000010001003.Значение = КБК;
		КонецЕсли;
		ОкончаниеИмениОбласти = Формат(Инд % КоличествоБлоковНаЛисте + 1, "ЧГ=");
		ТабличныйДокумент.Области["П000010002003_" + ОкончаниеИмениОбласти].Значение = ТекСтр.ОКАТО;
		СуммаНалогаПоОКАТО = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, ТекСтр.Сумма);
		
		Если Инд = ИтоговаяТаблица.Количество() - 1 Тогда
			//последний ОКАТО
			ТабличныйДокумент.Области["П000010003003_" + ОкончаниеИмениОбласти].Значение = СуммаНалогаДолжноБытьВсего - СуммаНалогаПоВсемОКАТО;		
		Иначе
			//очередной ОКАТО
			ТабличныйДокумент.Области["П000010003003_" + ОкончаниеИмениОбласти].Значение = СуммаНалогаПоОКАТО;		
			СуммаНалогаПоВсемОКАТО = СуммаНалогаПоВсемОКАТО + СуммаНалогаПоОКАТО;
		КонецЕсли; 
		
	КонецЦикла;
	
	СохранитьДанныеРаздела("Раздел1", Ложь, Ложь);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОчисткаИПодготовкаРаздела1НаСервере()
	Перем ТаблицаСтраницРаздела1;

	Если Не мСтруктураМногостраничныхРазделов.Свойство("Раздел1", ТаблицаСтраницРаздела1) Тогда
		Возврат;
	КонецЕсли;

	КБК = ТабличныйДокумент.Области.П000010001003.Значение;
	
	ОчиститьТабличноеПолеНаСервере("Раздел1");     	
	ТабличныйДокумент.Области.П000010001003.Значение = КБК;
		
	ТаблицаСтраницРаздела1 = ЭтаФорма[ТаблицаСтраницРаздела1];

	КоличествоСтраниц = ТаблицаСтраницРаздела1.Количество();
	Для ОбратныйИндекс = 1 По КоличествоСтраниц Цикл
		Инд = КоличествоСтраниц - ОбратныйИндекс;
		СтрокаТаблицы = ТаблицаСтраницРаздела1[Инд];
		Если НЕ СтрокаТаблицы.АктивнаяСтраница Тогда
			Если ТаблицаСтраницРаздела1.Количество() = 1 Тогда
				// В таблице должно быть не менее одной строки.
				СтрокаТаблицы.АктивнаяСтраница = Истина;
			Иначе
				ТаблицаСтраницРаздела1.Удалить(СтрокаТаблицы);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
		
	РегламентированнаяОтчетностьКлиентСервер.ОчиститьВариантыЗаполнения(ЭтаФорма, "Раздел1");
	
КонецПроцедуры

&НаСервере
Процедура ОчисткаИПодготовкаРаздела3НаСервере()
	
	П000030003003 = ТабличныйДокумент.Области.П000030003003.Значение;
	П000030004003 = ТабличныйДокумент.Области.П000030004003.Значение;
	
	ОчиститьТабличноеПолеНаСервере("Раздел3");
	
	ТабличныйДокумент.Области.П000030003003.Значение = П000030003003;
	ТабличныйДокумент.Области.П000030004003.Значение = П000030004003;
			
	РегламентированнаяОтчетностьКлиентСервер.ОчиститьВариантыЗаполнения(ЭтаФорма, "Раздел3");
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
    	
	ЗаполнитьСведенияОбОрганизацииНаСервере();
	
	РасчетНаКлиенте("Раздел3");
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвто(Команда)
	
	Отказ = Ложь;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Команда", Команда);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьАвтоЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередЗаполнениемРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвтоЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Команда = ДополнительныеПараметры.Команда;
	
	ЗаполнитьАвтоНаСервере();
	
	РегламентированнаяОтчетностьКлиент.ОбновитьДеревоРазделовВФормеОтчета(ЭтаФорма);
	
	Если НЕ Элементы.РазделыОтчета.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		Элементы.РазделыОтчета.ТекущаяСтрока = Элементы.РазделыОтчета.ТекущиеДанные.ПолучитьРодителя().ПолучитьЭлементы()[0].ПолучитьИдентификатор();
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАвтоНаСервере()
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела, Ложь);
	
	ЗаполнитьПустыеСтруктурыДанных();
	
	ПараметрыОтчета = Новый Структура();
	ПараметрыОтчета.Вставить("Организация",             СтруктураРеквизитовФормы.Организация);
	ПараметрыОтчета.Вставить("ДатаНачалаПериодаОтчета", СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета);
	ПараметрыОтчета.Вставить("ДатаКонцаПериодаОтчета",  СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
			
	Контейнер = Новый Структура;
	Контейнер.Вставить("Раздел1", ТаблицаСтраницыРаздела1);
	Контейнер.Вставить("Раздел2", ТаблицаСтраницыРаздела2);
	Контейнер.Вставить("Раздел3", СтруктураДанныхРаздел3);
		
	РегламентированнаяОтчетностьПереопределяемый.ЗаполнитьОтчет(Сред(Лев(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, ".Форма.") - 1), 7), Сред(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, ".Форма.") + 7), ПараметрыОтчета, Контейнер);
		
	ВывестиМакетВТаблДокНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела, 1);
	
	РасчетНаСервере();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТекущуюСтраницу(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОчиститьТекущуюСтраницуЗавершение", ЭтотОбъект);
	РегламентированнаяОтчетностьКлиент.МеханизмыОчисткиРегламентированныхОтчетов(
		ЭтаФорма, "ОчиститьТекущийЭкземплярМногостраничногоРаздела"
		+ Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим,
		ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТекущуюСтраницуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Титульный" Тогда
		НомерКорректировки = 0;
		ДатаПодписи = Неопределено;
		ТабличныйДокумент.Области.НомерКорректировки.Значение = НомерКорректировки;
		ТабличныйДокумент.Области.ДатаПодписи.Значение = ДатаПодписи;
		СтруктураРеквизитовФормы.ВидДокумента = 0;
	КонецЕсли;
	УстановитьДоступностьОбластей(ЭтаФорма, СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОтчет(Команда)
		
	РегламентированнаяОтчетностьКлиент.МеханизмыОчисткиРегламентированныхОтчетов(ЭтаФорма, "ОчиститьВесьОтчет");
	УстановитьДоступностьОбластей(ЭтаФорма, СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	СтруктураРеквизитовФормы.НомерТекущейСтраницы = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета;

КонецПроцедуры

&НаКлиенте
Процедура Очистить(ВыполняемоеОповещение = Неопределено) Экспорт
	
	РегламентированнаяОтчетностьКлиент.Очистить(ЭтаФорма, ВыполняемоеОповещение);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьПоказателиОтчетаЗаполняемыеИзИБНаСервере(ИмяСтраницы)
	
	РегламентированнаяОтчетностьКлиентСервер.ОчиститьПоказателиОтчетаЗаполняемыеИзИБ(ЭтаФорма, ИмяСтраницы);
		
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастроек(Команда)
	
	ОткрытьФормуВыбораСтраниц("ВыбратьДляНастройки");
	    
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораСтраниц(ВариантВыбора)
    Перем ТекущийРазделОтчетаСокрНаим;
	Перем НомерСтраницыРазделаОтчета;
	
	// Запоминаем текущий раздел, установленный в дереве разделов отчета.
	Если НЕ Элементы.РазделыОтчета.ТекущиеДанные = Неопределено Тогда
		ТекущийРазделОтчетаСокрНаим = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим;
		НомерСтраницыРазделаОтчета  = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета;
	КонецЕсли;
	
	мПараметры = Новый Структура;
	мПараметры.Вставить("ПроверкаСоотношений", Истина);
	мПараметры.Вставить("Автосохранение", Ложь);
	мПараметры.Вставить("ИмеетсяРеквизитДеревоВыбранныхСтраниц", Истина);
	
	Если СтруктураРеквизитовФормы.ДоступенМеханизмПечатиРеглОтчетностиСДвухмернымШтрихкодомPDF417 Тогда
		мПараметры.Вставить("РазрешитьВстроеннуюПечать", Истина);
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ФлажокОтклАвтоРасчет", СтруктураРеквизитовФормы.ФлажокОтклАвтоРасчет);
	ПараметрыФормы.Вставить("мПечатьБезШтрихкодаРазрешена", СтруктураРеквизитовФормы.мПечатьБезШтрихкодаРазрешена);
	ПараметрыФормы.Вставить("мСчетчикСтраниц", СтруктураРеквизитовФормы.мСчетчикСтраниц);
	ПараметрыФормы.Вставить("мАвтоВыборКодов", СтруктураРеквизитовФормы.мАвтоВыборКодов);
	ПараметрыФормы.Вставить("мПроверятьСоотношенияПриПечатиИВыгрузки", СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки);
	ПараметрыФормы.Вставить("ЕдиницаИзмерения", СтруктураРеквизитовФормы.ЕдиницаИзмерения);
	ПараметрыФормы.Вставить("ТочностьЕдиницыИзмерения", СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения);
	ПараметрыФормы.Вставить("мПараметры", мПараметры);
					
	ФормаНастройкиОтчета = РегламентированнаяОтчетностьКлиент.ПолучитьОбщуюФормуПоИмени("НастройкиОтчета", ПараметрыФормы, ЭтаФорма);
    
	мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Очистить();
    
	КопироватьДанныеФормы(мДеревоСтраницОтчета, ФормаНастройкиОтчета.Дерево);
	
	ЗначениеАвторасчета = СтруктураРеквизитовФормы.ФлажокОтклАвтоРасчет;
	ЗначениеЕдИзм       = СтруктураРеквизитовФормы.ЕдиницаИзмерения;
	ЗначениеЗпт         = СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения;
	
	ДополнительныеПараметры = Новый Структура("ЗначениеАвторасчета, ЗначениеЕдИзм, ЗначениеЗпт, НомерСтраницыРазделаОтчета, ТекущийРазделОтчетаСокрНаим", ЗначениеАвторасчета, ЗначениеЕдИзм, ЗначениеЗпт, НомерСтраницыРазделаОтчета, ТекущийРазделОтчетаСокрНаим);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьФормуВыбораСтраницЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ФормаНастройкиОтчета.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
	ФормаНастройкиОтчета.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ФормаНастройкиОтчета.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораСтраницЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	ЗначениеАвторасчета = ДополнительныеПараметры.ЗначениеАвторасчета;
	ЗначениеЕдИзм = ДополнительныеПараметры.ЗначениеЕдИзм;
	ЗначениеЗпт = ДополнительныеПараметры.ЗначениеЗпт;
	НомерСтраницыРазделаОтчета = ДополнительныеПараметры.НомерСтраницыРазделаОтчета;
	ТекущийРазделОтчетаСокрНаим = ДополнительныеПараметры.ТекущийРазделОтчетаСокрНаим;
	
	РегламентированнаяОтчетностьКлиентСервер.ПоказатьКнопкиПечати(ЭтаФорма);
	Модифицированность = Истина;
	
	флЗначенияИдентичны = Истина;
	
	Для Индекс = 0 По мДеревоСтраницОтчета.ПолучитьЭлементы().Количество() - 1 Цикл
		
		Если НЕ мДеревоСтраницОтчета.ПолучитьЭлементы()[Индекс].ПоказатьСтраницу = мДеревоВыбранныхСтраниц.ПолучитьЭлементы()[Индекс].ПоказатьСтраницу Тогда	
			флЗначенияИдентичны = Ложь;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеАвторасчета <> СтруктураРеквизитовФормы.ФлажокОтклАвтоРасчет Тогда
		
		#Если ВебКлиент Тогда
			ИзменитьТаблицуВариантовЗаполненияНаСервере();
		#Иначе
			РегламентированнаяОтчетностьКлиентСервер.ИзменитьТаблицуВариантовЗаполнения(ЭтаФорма, НЕ СтруктураРеквизитовФормы.ФлажокОтклАвтоРасчет);
		#КонецЕсли
		
		УстановитьДоступностьОбластей(ЭтаФорма, СтруктураРеквизитовФормы.НаимТекущегоРаздела);
		
	КонецЕсли;
	
	Если ЗначениеЕдИзм <> СтруктураРеквизитовФормы.ЕдиницаИзмерения
		ИЛИ ЗначениеЗпт <> СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения Тогда
		ПослеСменыЕдИзмеренияИТочности();
	КонецЕсли;
	
	// Управляем видимостью страниц основной панели формы
	РегламентированнаяОтчетностьКлиент.ПоказатьСтраницыОтчетаНаКлиенте(ЭтаФорма);
	
	Если НЕ флЗначенияИдентичны Тогда
		
		СформироватьДеревоРазделовОтчетаНаКлиенте();
		
		Если НЕ ТекущийРазделОтчетаСокрНаим = Неопределено Тогда
			
			// Пытаемся найти ранее запомненный раздел.
			НайденнаяСтрока = РегламентированнаяОтчетностьКлиентСервер.НайтиЭлементВДанныхФормыДерево(РазделыОтчета.ПолучитьЭлементы(), "КолонкаРазделыОтчетаСокрНаим", ТекущийРазделОтчетаСокрНаим);
			
			Если НЕ НайденнаяСтрока = Неопределено 
				И НЕ НомерСтраницыРазделаОтчета = Неопределено 
				И НайденнаяСтрока.ПолучитьЭлементы().Количество() > 0 Тогда
				
				НайденнаяСтрока = РегламентированнаяОтчетностьКлиентСервер.НайтиЭлементВДанныхФормыДерево(НайденнаяСтрока.ПолучитьЭлементы(), "КолонкаНомерСтраницыРазделаОтчета", НомерСтраницыРазделаОтчета);
				
			КонецЕсли;
			
			// В случае успешного поиска, устанавливаем курсор на найденный раздел.
			Если НЕ НайденнаяСтрока = Неопределено Тогда
				Элементы.РазделыОтчета.ТекущаяСтрока = НайденнаяСтрока.ПолучитьИдентификатор();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеСменыЕдИзмеренияИТочности()

	ПроверитьТочность();
	
	#Если ВебКлиент Тогда
		УстановитьФорматВыводаВПоляхВводаНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	#Иначе
		УстановитьФорматВыводаВПоляхВводаНаКлиенте(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	#КонецЕсли
	
	РасчетНаКлиенте(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	Модифицированность = Истина;
			
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьТочность()
	
	Если СтруктураРеквизитовФормы.ЕдиницаИзмерения = ПорядкиОкругленияОтчетности.ПеречислениеПорядкиОкругленияОтчетностиОкр1 Тогда

		Если СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения > 2 Тогда
									
			Сообщение = Новый СообщениеПользователю;

			Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1: при выводе сумм в рублях точность не может превышать 2 знака'"), ЭтаФорма.Заголовок);

			Сообщение.Сообщить();
			
			СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 2;
			
		КонецЕсли;

	ИначеЕсли СтруктураРеквизитовФормы.ЕдиницаИзмерения = ПорядкиОкругленияОтчетности.ПеречислениеПорядкиОкругленияОтчетностиОкр1000 Тогда

		Если СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения > 3 Тогда
			
			Сообщение = Новый СообщениеПользователю;

			Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1: при выводе сумм в тысячах рублей точность не может превышать 3 знака'"), ЭтаФорма.Заголовок);

			Сообщение.Сообщить();
			
			СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 3;
			
		КонецЕсли;

	ИначеЕсли СтруктураРеквизитовФормы.ЕдиницаИзмерения = ПорядкиОкругленияОтчетности.ПеречислениеПорядкиОкругленияОтчетностиОкр1000000 Тогда

		Если СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения > 6 Тогда
						
			Сообщение = Новый СообщениеПользователю;

			Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1: при выводе сумм в миллионах рублей точность не может превышать 6 знаков'"), ЭтаФорма.Заголовок);

			Сообщение.Сообщить();
			
			СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 6;
			
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ИзменитьТаблицуВариантовЗаполненияНаСервере()
	
	РегламентированнаяОтчетностьКлиентСервер.ИзменитьТаблицуВариантовЗаполнения(ЭтаФорма, НЕ СтруктураРеквизитовФормы.ФлажокОтклАвтоРасчет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьБланк(Команда)
	
	Отказ = Ложь;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Команда", Команда);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПоказатьБланкЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередПечатьюРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьБланкЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Команда = ДополнительныеПараметры.Команда;
		
	Печать(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(ВидПечати, НеИзФормыОтчета = Ложь) Экспорт
              	
	Состояние(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1. Формируется печатная форма...'"), ЭтаФорма.Заголовок), , , БиблиотекаКартинок.Печать);
	
	Если СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки <> Неопределено И СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки Тогда
    	РегламентированнаяОтчетностьКлиент.ПроверитьКонтрольныеСоотношения(ЭтаФорма, ОбработкаКС);
	КонецЕсли;
	
	Если НЕ ПечатьНаСервере(ВидПечати) Тогда
		Возврат;
	КонецЕсли;
	
	РегламентированнаяОтчетностьКлиент.ОткрытьФормуПредварительногоПросмотра(ЭтаФорма, ВидПечати, , СтруктураРеквизитовФормы.СписокПечатаемыхЛистов);
	
	СтруктураРеквизитовФормы.мРежимПечати = Ложь;
    
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере(ВидПечати)
	
	Если НЕ РегламентированнаяОтчетность.ПринтерДоступен() Тогда
		
		Сообщение = Новый СообщениеПользователю;

		Сообщение.Текст = НСтр("ru='Перед формированием печатных форм необходимо определить в системе принтер и задать его в качестве используемого по умолчанию!'");

		Сообщение.Сообщить();
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Если СтруктураРеквизитовФормы.ЕдиницаИзмерения <> ПорядкиОкругленияОтчетности.ПеречислениеПорядкиОкругленияОтчетностиОкр1 ИЛИ СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения <> 0 Тогда
		
		Сообщение = Новый СообщениеПользователю;

		Сообщение.Текст = НСтр("ru='Печать возможна только при установленной единице измерения ""в рублях"" и точности ""0"".'");

		Сообщение.Сообщить();

		Возврат Ложь;
		
	КонецЕсли;
			
	Если ТипЗнч(мДеревоВыбранныхСтраниц) <> Тип("ДанныеФормыДерево") Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	СтруктураРеквизитовФормы.мПечатныеФормы.Очистить();
	СтруктураРеквизитовФормы.мРежимПечати = Истина;
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела, Ложь, Ложь);
				
	сохрТаблДок = ТабличныйДокумент.ПолучитьОбласть();
	
	СтрПоля = "ПолеСверху, ПолеСправа, ПолеСнизу, ПолеСлева";
	ВремПоля = Новый Структура(СтрПоля);
	
	ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
	
	ВывестиМакетВТаблДокНаСервере("Титульный", 0);
	
	ОбщиеРеквизитыРазделов = ПолучитьОбщиеРеквизитыСТитульногоЛиста();
	
	Для Каждого СтрокаУровня1 Из мДеревоВыбранныхСтраниц.ПолучитьЭлементы() Цикл
		
		Если СтрокаУровня1.ВыводНаПечать = 0 Тогда
			Продолжить;
		КонецЕсли;

		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("НаименованиеЛиста",  СтрокаУровня1.Представление);
		СтруктураПараметров.Вставить("ОриентацияЛиста",    СтрокаУровня1.ОриентацияСтраницы);
		СтруктураПараметров.Вставить("ИмяСтраницы",        СтрокаУровня1.ИмяСтраницы);
		Структурапараметров.Вставить("ИмяОбластиТаблПоля", СтрокаУровня1.ИмяОбластиТабличногоПоля);
		СтруктураПараметров.Вставить("ВидПечати",          ВидПечати);

		Если НЕ мСтруктураМногостраничныхРазделов.Свойство(СтрокаУровня1.ИмяСтраницы) Тогда
			
			ВывестиМакетВТаблДокНаСервере(СтрокаУровня1.ИмяСтраницы, 0);
			ВывестиНаПечатьЛист(СтруктураПараметров, ОбщиеРеквизитыРазделов, СтрПоля);
			
		Иначе
			
			СтруктураПараметров.Вставить("ИмяСтраницыПанели", СтрокаУровня1.ИмяСтраницы);
			ВывестиНаПечатьДополнительныеСтраницы(СтруктураПараметров, ОбщиеРеквизитыРазделов);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(сохрТаблДок);
	ЗаполнитьЗначенияСвойств(ТабличныйДокумент, ВремПоля, СтрПоля);
	
	РегламентированнаяОтчетностьКлиентСервер.ПроставлениеНомеровЛистов(ЭтаФорма, , СтруктураРеквизитовФормы.СписокПечатаемыхЛистов);
	
	КопироватьДанныеФормы(мДеревоВыбранныхСтраниц, мДеревоСтраницОтчета);
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ВывестиНаПечатьДополнительныеСтраницы(СтруктураПараметровСтраницы, ОбщиеРеквизитыРазделов)
	
	Перем ИмяСтраницы;
	Перем ТаблицаСтраницРаздела;
	
	СтруктураПараметровСтраницы.Свойство("ИмяСтраницыПанели", ИмяСтраницы);
	
	Если Не мСтруктураМногостраничныхРазделов.Свойство(ИмяСтраницы, ТаблицаСтраницРаздела) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаСтраницРаздела = ЭтаФорма[ТаблицаСтраницРаздела];
	
	МассивПризнаковАктивности = Новый Массив;
	Для Каждого Страница Из ТаблицаСтраницРаздела Цикл
		ТекущийИндекс = ТаблицаСтраницРаздела.Индекс(Страница);
		МассивПризнаковАктивности.Добавить(ТаблицаСтраницРаздела[ТекущийИндекс].АктивнаяСтраница);
	КонецЦикла;
	
	Для Каждого Страница Из ТаблицаСтраницРаздела Цикл
		ТекущийИндекс = ТаблицаСтраницРаздела.Индекс(Страница);
		ВывестиМакетВТаблДокНаСервере(ИмяСтраницы, ТекущийИндекс + 1);
		ВывестиНаПечатьЛист(СтруктураПараметровСтраницы, ОбщиеРеквизитыРазделов);
	КонецЦикла;
	
	Для Каждого Страница Из ТаблицаСтраницРаздела Цикл
		ТекущийИндекс = ТаблицаСтраницРаздела.Индекс(Страница);
		ТаблицаСтраницРаздела[ТекущийИндекс].АктивнаяСтраница = МассивПризнаковАктивности[ТекущийИндекс];
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОбщиеРеквизитыСТитульногоЛиста()
	
	МассивИНН         = Новый Массив(12);
	МассивКПП         = Новый Массив(9);
	МассивДатаПодписи = Новый Массив(8);
					
	ИсходныйМакет = ТабличныйДокумент;
		
	Область = ИсходныйМакет.Области.Найти("ИНН1");
	
	Если НЕ Область = Неопределено Тогда
		
		СтрИНН = Область.Значение;
		
		Если СтрДлина(СтрИНН) = 10 Тогда
			СтрИНН = СтрИНН + "--";
		КонецЕсли;
								
		Для Ном = 1 По СтрДлина(СтрИНН) Цикл
			
			МассивИНН[Ном - 1] = Сред(СтрИНН, Ном, 1);
			
		КонецЦикла;
		
	КонецЕсли;
		
	Область = ИсходныйМакет.Области.Найти("КПП1");
	
	Если НЕ Область = Неопределено Тогда
		
		Для Ном = 1 По СтрДлина(Область.Значение) Цикл
			
			МассивКПП[Ном - 1] = Сред(Область.Значение, Ном, 1);
			
		КонецЦикла;
		
	КонецЕсли;
			
	Область = ИсходныйМакет.Области.Найти("ДатаПодписи");
	
	Если НЕ Область = Неопределено Тогда
		
		Если ТипЗнч(Область.Значение) = Тип("Строка") Тогда 
			СтрДатаПодписи = Лев(СтрЗаменить(Область.Значение, ".", ""), 8);
		ИначеЕсли ТипЗнч(Область.Значение) = Тип("Дата") Тогда 
			Если ЗначениеЗаполнено(Область.Значение) Тогда 
				СтрДатаПодписи = Лев(СтрЗаменить(Формат(Область.Значение, "ДФ = ""дд.ММ.гггг 'г.'"""), ".", ""), 8);
			Иначе
				СтрДатаПодписи = "        ";
			КонецЕсли;
		КонецЕсли;
		
		Для Ном = 1 По СтрДлина(СтрДатаПодписи) Цикл
			
			МассивДатаПодписи[Ном - 1] = Сред(СтрДатаПодписи, Ном, 1);
									
		КонецЦикла;
		
	КонецЕсли;
	
	ОбщиеРеквизитыРазделов = Новый Структура;
		
	ОбщиеРеквизитыРазделов.Вставить("ИНН", МассивИНН);
	ОбщиеРеквизитыРазделов.Вставить("КПП", МассивКПП);
	ОбщиеРеквизитыРазделов.Вставить("ДатаПодписи", МассивДатаПодписи);
		
	Возврат ОбщиеРеквизитыРазделов;
	
КонецФункции

&НаСервере
Процедура ВывестиНаПечатьЛист(Парам1, ОбщиеРеквизитыРазделов, СтрПоля = Неопределено)
    	
	СоответствиеРазделовМакетам = Новый Соответствие;
	СоответствиеРазделовМакетам.Вставить("Титульный",	"МЧБ_2012Кв1_Титульный");
	СоответствиеРазделовМакетам.Вставить("Раздел1",		"МЧБ_2012Кв1_Раздел1");
	СоответствиеРазделовМакетам.Вставить("Раздел2",		"МЧБ_2012Кв1_Раздел2");
	СоответствиеРазделовМакетам.Вставить("Раздел3",		"МЧБ_2012Кв1_Раздел3");
	
	МЧБРаздела = СоответствиеРазделовМакетам[Парам1.ИмяСтраницы];
		
	МакетМЧБ = ОбъектОтчета(ЭтаФорма.ИмяФормы).ПолучитьМакет(МЧБРаздела);
	МакетМЧБ.ПолеСверху = 5;
	МакетМЧБ.ПолеСправа = 5;
	МакетМЧБ.ПолеСнизу = 5;
	МакетМЧБ.ПолеСлева = 5;
	
	ВремПоля = Новый Структура(СтрПоля);
	
	ЗаполнитьМакетМЧБ(Парам1, МакетМЧБ, ОбщиеРеквизитыРазделов);
	
	ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(МакетМЧБ);
	ЗаполнитьЗначенияСвойств(ТабличныйДокумент, МакетМЧБ, СтрПоля, "Макет");
	
	РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, Парам1, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМакетМЧБ(ПараметрыПечати, МакетМЧБ, ОбщиеРеквизитыРазделов)
	
	Показатели = Новый ТаблицаЗначений;
	Показатели.Колонки.Добавить("Имя");
	Показатели.Колонки.Добавить("Значение");
	Показатели.Колонки.Добавить("ЗначениеМЧБ");
	
	Показатели.Индексы.Добавить("Имя");
	
	ИсходныйМакет = ТабличныйДокумент;
	Для Каждого Область Из ИсходныйМакет.Области Цикл
		Если Область.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник И Область.СодержитЗначение = Истина Тогда
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = Область.Имя;
			НовСтр.Значение = Область.Значение;
			НовСтр.ЗначениеМЧБ = ПолучитьЗначениеМЧБ(Область);
		КонецЕсли;
	КонецЦикла;
	
	НайденноеЗначение = Показатели.Найти("ИНН1", "Имя");
	
	Если НЕ НайденноеЗначение = Неопределено Тогда
		Показатели.Удалить(НайденноеЗначение);
	КонецЕсли;
		
	ИНН = "";
	Для Ном = 0 По 11 Цикл
		ИНН = ИНН + ОбщиеРеквизитыРазделов.ИНН[Ном];
	КонецЦикла;
	
	НовСтр = Показатели.Добавить();
	НовСтр.Имя = "ИНН1";
	НовСтр.Значение = ИНН;
	НовСтр.ЗначениеМЧБ = СокрЛП(ИНН);
	
	НайденноеЗначение = Показатели.Найти("КПП1", "Имя");
	
	Если НЕ НайденноеЗначение = Неопределено Тогда
		Показатели.Удалить(НайденноеЗначение);
	КонецЕсли;
		
	КПП = "";
	Для Ном = 0 По 8 Цикл
		КПП = КПП + ОбщиеРеквизитыРазделов.КПП[Ном];
	КонецЦикла;
	
	НовСтр = Показатели.Добавить();
	НовСтр.Имя = "КПП1";
	НовСтр.Значение = КПП;
	НовСтр.ЗначениеМЧБ = СокрЛП(КПП);
	
	НайденноеЗначение = Показатели.Найти("ДатаПодписи", "Имя");
		
	Если НЕ НайденноеЗначение = Неопределено Тогда
		Показатели.Удалить(НайденноеЗначение);
	КонецЕсли;
		
	ДатаПодписиСтр = "";
	Для Ном = 0 По 7 Цикл
		ДатаПодписиСтр = ДатаПодписиСтр + ОбщиеРеквизитыРазделов.ДатаПодписи[Ном];
	КонецЦикла;
	
	НовСтр = Показатели.Добавить();
	НовСтр.Имя = "ДатаПодписи";
	НовСтр.Значение = ДатаПодписиСтр;
	НовСтр.ЗначениеМЧБ = СокрЛП(ДатаПодписиСтр);
	
	// особая обработка ФИО на титульном листе
	Если ПараметрыПечати.ИмяСтраницы = "Титульный" Тогда
		
		ПокПодписант = Показатели.Найти("ОргПодписант", "Имя");
		Если ПокПодписант <> Неопределено Тогда
			
			ФИО = РегламентированнаяОтчетность.РазложитьФИО(ПокПодписант.Значение);
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "ПодписантФамилия";
			НовСтр.Значение = ФИО.Фамилия;
			НовСтр.ЗначениеМЧБ = ФИО.Фамилия;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "ПодписантИмя";
			НовСтр.Значение = ФИО.Имя;
			НовСтр.ЗначениеМЧБ = ФИО.Имя;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "ПодписантОтчество";
			НовСтр.Значение = ФИО.Отчество;
			НовСтр.ЗначениеМЧБ = ФИО.Отчество;
			
		КонецЕсли;
		
		// особая обработка ОКВЭД
		ПокОКВЭД = Показатели.Найти("ОКВЭД", "Имя");
		Если ПокОКВЭД <> Неопределено Тогда
			ОКВЭД = ПокОКВЭД.ЗначениеМЧБ;
			Если Сред(ОКВЭД, 2, 1) = "." Тогда
				ОКВЭД = Лев(ОКВЭД, 1) + " " + Сред(ОКВЭД, 2);
			КонецЕсли;
			Если Сред(ОКВЭД, 5, 1) = "." Тогда
				ОКВЭД = Лев(ОКВЭД, 4) + " " + Сред(ОКВЭД, 5);
			КонецЕсли;
			ПокОКВЭД.Значение = ОКВЭД;
			ПокОКВЭД.ЗначениеМЧБ = ОКВЭД;
		КонецЕсли;
		
	КонецЕсли;

	ИндексТочкиПоКорню=Новый Структура;
	Для каждого Область Из МакетМЧБ.Области Цикл
		Если Область.Текст="." Тогда
			ТекАдресЗначенияОбласти = АдресЗначенияОбласти(Область);
			Корень=ТекАдресЗначенияОбласти.Корень;
			ИндексТочкиЧислаНаМЧБ=ТекАдресЗначенияОбласти.ИндексЗнакоместа;
			ИндексТочкиПоКорню.Вставить(Корень,ИндексТочкиЧислаНаМЧБ);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Область Из МакетМЧБ.Области Цикл
		Если Область.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
			ИмяОбласти = Область.Имя;
			
			Если СтрЧислоВхождений(ИмяОбласти, "НомСтр") > 0
			 ИЛИ СтрЧислоВхождений(ИмяОбласти, "СоставленаНа") > 0 Тогда
				Продолжить;
			КонецЕсли;
					
			РезультатПоиска = Показатели.Найти(ИмяОбласти, "Имя");
			Если РезультатПоиска = Неопределено Тогда
				ТекАдресЗначенияОбласти = АдресЗначенияОбласти(Область);
				ЗначениеВыведено = Ложь;
				Если ТекАдресЗначенияОбласти.ИндексЗнакоместа <> 0 Тогда
					РезультатПоиска = Показатели.Найти(ТекАдресЗначенияОбласти.Корень, "Имя");
					Если РезультатПоиска <> Неопределено Тогда
						Если ТипЗнч(РезультатПоиска.Значение)=Тип("Число") Тогда
							//разделение числа на 2 части
							ЦелаяЧасть = Цел(РезультатПоиска.Значение);
							СтрЦелаяЧасть = Строка(Цел(РезультатПоиска.Значение));
							СтрДообнаяЧасть = Сред(Строка(РезультатПоиска.Значение - ЦелаяЧасть),3);
							//разделение областей показателя на 2 части
							
							ИндексТочкиЧислаНаМЧБ = Неопределено;
							Если ИндексТочкиПоКорню.Свойство(ТекАдресЗначенияОбласти.Корень,ИндексТочкиЧислаНаМЧБ) = Ложь Тогда
								//На МЧБ нет разделения на целую и дробную части
								ПрисвоитьЗначениеОбласти(Область, РезультатПоиска.ЗначениеМЧБ, ТекАдресЗначенияОбласти.ИндексЗнакоместа);
								ЗначениеВыведено = Истина;	
							Иначе
								//определяем какая часть выводится (Целая, дробная или точка)
								Если ТекАдресЗначенияОбласти.ИндексЗнакоместа<ИндексТочкиЧислаНаМЧБ Тогда
									//выводится целая часть
									ПрисвоитьЗначениеОбласти(Область, ?(РезультатПоиска.ЗначениеМЧБ = "-","-",СтрЦелаяЧасть), ТекАдресЗначенияОбласти.ИндексЗнакоместа);
									ЗначениеВыведено = Истина;	
								ИначеЕсли ТекАдресЗначенияОбласти.ИндексЗнакоместа > ИндексТочкиЧислаНаМЧБ Тогда
									//выводится дробная часть
									ПрисвоитьЗначениеОбласти(Область, СтрДообнаяЧасть, ТекАдресЗначенияОбласти.ИндексЗнакоместа - ИндексТочкиЧислаНаМЧБ);
									ЗначениеВыведено = Истина;
								Иначе
									//выводится точка
									//присваивать ничего не будем, но считаем, что область заполненяется корректно
									ЗначениеВыведено = Истина;
								КонецЕсли;
							КонецЕсли;
						Иначе
							ПрисвоитьЗначениеОбласти(Область, РезультатПоиска.ЗначениеМЧБ, ТекАдресЗначенияОбласти.ИндексЗнакоместа, ТипЗнч(РезультатПоиска.Значение) <> Тип("Строка") ИЛИ НЕ ЗначениеЗаполнено(РезультатПоиска.Значение));
							ЗначениеВыведено = Истина;		
						КонецЕсли;
					КонецЕсли;
										
				КонецЕсли;
				Если НЕ ЗначениеВыведено Тогда
										
					Сообщение = Новый СообщениеПользователю;

					Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Не удалось заполнить область ""%1""!'"), ИмяОбласти);

					Сообщение.Сообщить();

				КонецЕсли;
			Иначе
				ПрисвоитьЗначениеОбласти(Область, РезультатПоиска.ЗначениеМЧБ);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиНаПечатьЛистРаздела(СтруктураПараметровЛиста) Экспорт
		
	ПечатныеЛисты = Новый СписокЗначений;
	ПечатныеЛисты.Добавить(ВывестиНаПечатьЛистРазделаБезМногострочныхЧастей(СтруктураПараметровЛиста));
	СтруктураРеквизитовФормы.мПечатныеФормы.Добавить(ПечатныеЛисты[0].Значение, СтруктураПараметровЛиста.НаименованиеЛиста);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗначениеМЧБ(Область)
	
	ТипЗначения = ТипЗнч(Область.Значение);
	Если ТипЗначения = Тип("Число") Тогда
		ФорматОбласти = Область.Формат;
		СоотвСтрокаФормата = РазобратьСтрокуФормата(ФорматОбласти);
		СоотвСтрокаФормата.Вставить("ЧРД", ".");
		СоотвСтрокаФормата.Вставить("ЧГ", "");
		Результат = Формат(Область.Значение, СобратьСтрокуФормата(СоотвСтрокаФормата));
	ИначеЕсли ТипЗначения = Тип("Строка") Тогда
		Результат = СокрЛП(Область.Значение);
	ИначеЕсли ТипЗначения = Тип("Дата") Тогда
		Результат = Формат(Область.Значение, ?(ПустаяСтрока(Область.Формат), "ДФ=dd.MM.yyyy", Область.Формат));
	ИначеЕсли ТипЗначения = Тип("Булево") Тогда
		Результат = Формат(Область.Значение, Область.Формат);
	КонецЕсли;
	Возврат СокрЛП(Результат);
	
КонецФункции

&НаСервере
Функция АдресЗначенияОбласти(Область)
	
	Имя = Область.Имя;
	КореньИмениОбласти = Неопределено;
	СтрИндексЗнакоместа = "";
	ИндексЗнакоместа = 0;
	ДлинаИмени = СтрДлина(Имя);
	Для ИндексВхождения = 1 По ДлинаИмени Цикл
		СтрИндексЗнакоместа = Сред(Имя, ДлинаИмени - ИндексВхождения + 1);
		Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(СтрИндексЗнакоместа) Тогда
			КореньИмениОбласти = Лев(Имя, ДлинаИмени - ИндексВхождения);
			ИндексЗнакоместа = Число(СтрИндексЗнакоместа);
		Иначе
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Прав(КореньИмениОбласти, 1) = "_" Тогда
		КореньИмениОбласти = Лев(КореньИмениОбласти, СтрДлина(КореньИмениОбласти) - 1);
	КонецЕсли;
		
	Возврат Новый Структура("Корень, ИндексЗнакоместа", КореньИмениОбласти, ИндексЗнакоместа);
	
КонецФункции

&НаСервере
Процедура ПрисвоитьЗначениеОбласти(Область, Знач Значение, ИндексЗнакоместа = 0, Дополнять_ = Истина)
	
	Если ИндексЗнакоместа <> 0 Тогда
		Если СтрДлина(Значение) >= ИндексЗнакоместа Тогда
			Значение = Сред(Значение, ИндексЗнакоместа, 1);
		Иначе
			Значение = ?(Дополнять_, "-", "");
		КонецЕсли;
	ИначеЕсли НЕ ЗначениеЗаполнено(Значение) И Дополнять_ Тогда
		Значение = "-";
	КонецЕсли;
	
	Если Область.СодержитЗначение = Истина Тогда
		Область.Значение = ВРЕГ(Значение);
	Иначе
		Область.Текст = ВРЕГ(Значение);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВывестиНаПечатьЛистРазделаБезМногострочныхЧастей(СтруктураПараметровЛиста)
	Перем Ориентация;
	Перем ИмяТабличногоПоля;
	Перем ИмяОбластиТаблПоля;

	ТаблДок = ЭтаФорма[СтруктураПараметровЛиста.ИмяТабличногоПоля];
	
	ПечатнаяФорма = Новый ТабличныйДокумент;
	ПечатнаяФорма.ОтображатьЗаголовки = Ложь;
	ПечатнаяФорма.ОтображатьСетку     = Ложь;
	ПечатнаяФорма.ЧерноБелыйПросмотр  = Истина;
	ПечатнаяФорма.ЧерноБелаяПечать    = Истина;
	ПечатнаяФорма.Автомасштаб         = Истина;
	ПечатнаяФорма.ОриентацияСтраницы  = ?(СтруктураПараметровЛиста.ОриентацияЛиста = "Портрет", ОриентацияСтраницы.Портрет, ОриентацияСтраницы.Ландшафт);
	
	ЗаполнитьЗначенияСвойств(ПечатнаяФорма, ТаблДок, "ПолеСлева, ПолеСверху, ПолеСправа, ПолеСнизу");

	СписокВыводимыхНаПечатьОбластей = Новый СписокЗначений;
	Для каждого Область Из ТаблДок.Области Цикл
		Если Область.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Строки Тогда
			СписокВыводимыхНаПечатьОбластей.Добавить(Область.Верх, Область.Имя);
		КонецЕсли;
	КонецЦикла;
	
	// Сортируем список в порядке расположения областей в таблице (по верхней координате).
	СписокВыводимыхНаПечатьОбластей.СортироватьПоЗначению();

	// Выполняем цикл до тех пор, пока не закончатся области, выводимые на печать.
	Пока СписокВыводимыхНаПечатьОбластей.Количество() > 0 Цикл
		
		Если СтрЧислоВхождений(ВРег(СписокВыводимыхНаПечатьОбластей[0].Представление), "ПУСТАЯСТРОКА") = 0 Тогда
			ОбластьВыводимаяНаПечать = ТаблДок.ПолучитьОбласть(СписокВыводимыхНаПечатьОбластей[0].Представление);
			СписокВыводимыхНаПечатьОбластей.Удалить(0);
			ПечатнаяФорма.Вывести(ОбластьВыводимаяНаПечать);
			Продолжить;
		КонецЕсли;
		
		// Получаем области "ПустаяСтрока" и "Ограничители", одновременно удаляя их из списка.
		ОбластьПустаяСтрока = ТаблДок.ПолучитьОбласть(СписокВыводимыхНаПечатьОбластей[0].Представление);
		СписокВыводимыхНаПечатьОбластей.Удалить(0);
		ОбластьОграничители = ТаблДок.ПолучитьОбласть(СписокВыводимыхНаПечатьОбластей[0].Представление);
		СписокВыводимыхНаПечатьОбластей.Удалить(0);
		
		ВыводимыеОбласти = Новый Массив;
		ВыводимыеОбласти.Добавить(ОбластьПустаяСтрока);
		ВыводимыеОбласти.Добавить(ОбластьОграничители);
		
		Пока ПечатнаяФорма.ПроверитьВывод(ВыводимыеОбласти) Цикл
			ПечатнаяФорма.Вывести(ОбластьПустаяСтрока);
		КонецЦикла;
		
		ПечатнаяФорма.Вывести(ОбластьОграничители);
		ПечатнаяФорма.ВывестиГоризонтальныйРазделительСтраниц();
		
	КонецЦикла;
	
	Возврат ПечатнаяФорма;
	
КонецФункции

&НаСервере
Функция РазобратьСтрокуФормата(Знач СтрокаФормата)
	
	ЗначенияПараметров = Новый Соответствие;
	Пока СтрНайти(СтрокаФормата, ";") <> 0 Цикл
		ВхождениеРазделителя = СтрНайти(СтрокаФормата, ";");
		ДоРазделителя = Лев(СтрокаФормата, ВхождениеРазделителя - 1);
		ВхождениеРавно = СтрНайти(ДоРазделителя, "=");
		Если ВхождениеРавно <> 0 И ВхождениеРавно <> 1 Тогда
			ЗначенияПараметров.Вставить(Лев(ДоРазделителя, ВхождениеРавно - 1), Сред(ДоРазделителя, ВхождениеРавно + 1));
		КонецЕсли;
		СтрокаФормата = Сред(СтрокаФормата, ВхождениеРазделителя + 1);
	КонецЦикла;
	ВхождениеРавно = СтрНайти(СтрокаФормата, "=");
	Если ВхождениеРавно <> 0 И ВхождениеРавно <> 1 Тогда
		ЗначенияПараметров.Вставить(Лев(СтрокаФормата, ВхождениеРавно - 1), Сред(СтрокаФормата, ВхождениеРавно + 1));
	КонецЕсли;
	Возврат ЗначенияПараметров;
	
КонецФункции

&НаСервере
Функция СобратьСтрокуФормата(ПараметрыФормата)
	
	СтрокаФормата = "";
	Для Каждого Параметр Из ПараметрыФормата Цикл
		СтрокаФормата = СтрокаФормата + "; " + Параметр.Ключ + "=" + Параметр.Значение;
	КонецЦикла;
	Если НЕ ПустаяСтрока(СтрокаФормата) Тогда
		СтрокаФормата = Сред(СтрокаФормата, 3);
	КонецЕсли;
	Возврат СтрокаФормата;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьСДвухмернымШтрихкодомPDF417(Команда)
	
	РегламентированнаяОтчетностьКлиент.ВывестиМашиночитаемуюФорму(ЭтаФорма, Команда.Имя);
		
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыгрузитьЗавершение", ЭтотОбъект);

	Отказ = Ложь;
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередВыгрузкойРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ВыгрузитьОтчет();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОтчет() Экспорт
		
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыгрузитьОтчетЗавершение", ЭтотОбъект);
	
	Если Модифицированность Тогда
		СохранитьНаКлиенте(,ОписаниеОповещения);
	Иначе
		ВыполнитьОбработкуОповещения(ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОтчетЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ФормаВыгрузкиРеглОтчета = ПолучитьФорму("Документ.ВыгрузкаРегламентированныхОтчетов.Форма.ФормаДокумента", , ЭтаФорма);
	
	СпДокОсн = Новый СписокЗначений;
	СпДокОсн.Добавить(СтруктураРеквизитовФормы.мСохраненныйДок);
	
	ФормаВыгрузкиРеглОтчета.СформироватьИЗаписать(СпДокОсн);
	
КонецПроцедуры

&НаКлиенте
Функция УниверсальнаяВыгрузка(ТекстВыгрузки = Неопределено, ПроверятьБлокировки = Истина) Экспорт
	
	Перем ПараметрыВыгрузки;
	
	Если Модифицированность Тогда
		ТекстЗаголовка = ЗаголовокРегламентированногоОтчета(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
		
		ОргСтр = " (" + СтруктураРеквизитовФормы.Организация + ")";
		Если СтрНайти(ТекстЗаголовка, ОргСтр) = 0 Тогда
			ТекстЗаголовка = ТекстЗаголовка + ОргСтр;
		КонецЕсли;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Отчет """ + ТекстЗаголовка + """ не сохранен.";
		Сообщение.Сообщить();
		
		Возврат Ложь;
	КонецЕсли;
	
	Если Открыта() Тогда
		Если СтруктураРеквизитовФормы.ЕдиницаИзмерения <> ПорядкиОкругленияОтчетности.ПеречислениеПорядкиОкругленияОтчетностиОкр1 Тогда
			
			Сообщение = Новый СообщениеПользователю;

			Сообщение.Текст = НСтр("ru='Перед выгрузкой необходимо установить единицу измерения ""в рублях"".'");

			Сообщение.Сообщить();
			
			Возврат Ложь;
			
		КонецЕсли;
		Если СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения <> 0 Тогда
			
			Сообщение = Новый СообщениеПользователю;

			Сообщение.Текст = НСтр("ru='Перед выгрузкой необходимо установить точность ""0"".'");

			Сообщение.Сообщить();
			
			Возврат Ложь;
			
		КонецЕсли;
	КонецЕсли;
	Если СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки <> Неопределено И СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки Тогда
		РегламентированнаяОтчетностьКлиент.ПроверитьКонтрольныеСоотношения(ЭтаФорма, ОбработкаКС);
	КонецЕсли;
	Если НЕ УниверсальнаяВыгрузкаXMLНаСервере(ТекстВыгрузки, ПараметрыВыгрузки) Тогда
		Возврат Ложь;
	КонецЕсли;
	        	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция ЗаголовокРегламентированногоОтчета(ДатаНач, ДатаКон, Периодичность = Неопределено) Экспорт
		
	СтрПериодОтчета = ПредставлениеПериода( НачалоДня(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета), КонецДня(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета), "ФП = Истина" );
		
	Если СтрНайти(ЭтаФорма.Заголовок, СтрПериодОтчета) = 0 Тогда
		Возврат ЭтаФорма.Заголовок + " за " + СтрПериодОтчета;
	Иначе
		Возврат ЭтаФорма.Заголовок;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция УниверсальнаяВыгрузкаXMLНаСервере(ТекстВыгрузки, ПараметрыВыгрузки)
	
	СформироватьСтруктуруПоказателей();
	ПараметрыВыгрузки = СформироватьСтруктуруПараметров();
	ДеревоВыгрузки = ИзвлечьСтруктуруXML();
	
	Если НЕ ПроверитьВозможностьВыгрузки(ПараметрыВыгрузки, ДеревоВыгрузки) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЗаполнитьДанными(ДеревоВыгрузки, ПараметрыВыгрузки);
	Если НЕ РегламентированнаяОтчетность.ПроверитьДанные(ЭтаФорма, ДеревоВыгрузки) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТекстВыгрузки = ВыгрузитьДеревоВXML(ДеревоВыгрузки, ПараметрыВыгрузки);
		
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция СформироватьСтруктуруПоказателей()
	
	Перем ТаблицаМногостраничногоДокумента;
	
	СтруктураРеквизитовФормы.мДанныеОтчета = Новый Структура;
	
	СохрСтруктура = СтруктураРеквизитовФормы.мСохраненныйДок.ДанныеОтчета.Получить();
	ПоказателиОтчета = СохрСтруктура.ПоказателиОтчета;
	Для Каждого Раздел Из ПоказателиОтчета Цикл
		СтруктураРеквизитовФормы.мДанныеОтчета.Вставить(Раздел.Ключ, РегламентированнаяОтчетность.СвернутьДанныеТабличногоПоля(Раздел.Значение));
	КонецЦикла;
	
	СохрСтруктура.ДанныеМногостраничныхРазделов.Свойство("Раздел2", ТаблицаМногостраничногоДокумента);
	
	Если ТаблицаМногостраничногоДокумента.Колонки.Найти("ДанныеДопСтрок") = Неопределено Тогда
		
		ТаблицаМногостраничногоДокумента.Колонки.Добавить("ДанныеДопСтрок");
		
		СтруктураМногострочногоРаздела2_1 = ДанныеФормыВЗначение(ЭтаФорма[мСтруктураМногострочныхРазделов[СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_1]], Тип("ТаблицаЗначений"));
		СтруктураМногострочногоРаздела2_2 = ДанныеФормыВЗначение(ЭтаФорма[мСтруктураМногострочныхРазделов[СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_2]], Тип("ТаблицаЗначений"));
		
		Для Каждого Страница Из ТаблицаМногостраничногоДокумента Цикл
			
			ВосстановитьСведенияОПостановкеНаУчет(Страница);
			
			Если Страница.ДанныеДопСтрок = Неопределено Тогда
				
				ДанныеМСЧ = Новый Структура;
				ДанныеМСЧ.Вставить(СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_1, СтруктураМногострочногоРаздела2_1.Скопировать());
				ДанныеМСЧ.Вставить(СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_2, СтруктураМногострочногоРаздела2_2.Скопировать());
				Страница.ДанныеДопстрок = ДанныеМСЧ;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
		
	Для Каждого ЭлементСтруктуры Из СохрСтруктура.ДанныеМногостраничныхРазделов Цикл
		    		
		НайденноеЗначение = Неопределено;
		
		мСтруктураМногостраничныхРазделов.Свойство(ЭлементСтруктуры.Ключ, НайденноеЗначение);
		
		Если НЕ НайденноеЗначение = Неопределено Тогда
			
			НайденноеЗначение = ЭтаФорма[НайденноеЗначение];
			
			ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, НайденноеЗначение);
			
			Если НайденноеЗначение[0].Свойство("Данные") Тогда
				
				Для Каждого СтрокаТаблЗнач Из НайденноеЗначение Цикл
					
					Если ТипЗнч(СтрокаТаблЗнач.Данные) = Тип("СписокЗначений") Тогда
						
						СтрокаТаблЗнач.Данные.Очистить();
						СтрокаТаблЗнач.Данные.Добавить(ЭлементСтруктуры.Значение[НайденноеЗначение.Индекс(СтрокаТаблЗнач)].Данные);
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
			Если НайденноеЗначение[0].Свойство("ДанныеДопСтрок") Тогда
				
				Ном = 0;
				
				Для Каждого СтрокаТаблЗнач Из ЭлементСтруктуры.Значение Цикл
					
					Если ТипЗнч(СтрокаТаблЗнач.ДанныеДопСтрок) = Тип("Структура") Тогда
						
						СтруктураДопСтрок = Новый Структура;
						
						Для Каждого ЭлСтруктуры Из СтрокаТаблЗнач.ДанныеДопСтрок Цикл
							
							ТаблЗнач = ЭлСтруктуры.Значение;
							
							СтрокаТаблЗначДанныеДопСтрок = ЭтаФорма["Хранилище" + ЭлСтруктуры.Ключ].Добавить().Таблица;
							
							ЗначениеВДанныеФормы(ТаблЗнач, СтрокаТаблЗначДанныеДопСтрок);
							
							СтруктураДопСтрок.Вставить(ЭлСтруктуры.Ключ, СтрокаТаблЗначДанныеДопСтрок);
							
						КонецЦикла;
						
						НайденноеЗначение[Ном].ДанныеДопСтрок.Добавить(СтруктураДопСтрок, "ДанныеФормыКоллекцияТаблицаДопСтрокРаздела");
						
					КонецЕсли;
					
					Ном = Ном + 1;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
		      	
	Для Каждого Раздел Из мСтруктураМногостраничныхРазделов Цикл
		ТаблицаЛистовРаздела = ЭтаФорма[Раздел.Значение];
		Для Каждого Лист Из ТаблицаЛистовРаздела Цикл
			Лист.Данные[0].Значение = РегламентированнаяОтчетность.СвернутьДанныеТабличногоПоля(Лист.Данные[0].Значение);
		КонецЦикла;
		СтруктураРеквизитовФормы.мДанныеОтчета.Вставить(Раздел.Ключ, ЭтаФорма[Раздел.Значение]);
	КонецЦикла;
	
КонецФункции

&НаСервере
Функция СформироватьСтруктуруПараметров()
	
	Титульный = СтруктураРеквизитовФормы.мДанныеОтчета.ПолеТабличногоДокументаТитульный;
	
	ПараметрыВыгрузки = Новый Структура;
	ПараметрыВыгрузки.Вставить("ВерсПрог",		РегламентированнаяОтчетность.НазваниеИВерсияПрограммы());
	ПараметрыВыгрузки.Вставить("КНД",			"1152016");
	ПараметрыВыгрузки.Вставить("ДатаДок",		Формат(ТекущаяДатаСеанса(), "ДФ=дд.ММ.гггг"));
	ПараметрыВыгрузки.Вставить("ГодПериодОтч",	Формат(СтруктураРеквизитовФормы.мСохраненныйДок.ДатаОкончания, "ДФ=гггг"));
	ПараметрыВыгрузки.Вставить("ПериодОтч",		СокрЛП(Титульный.Период));
	ПараметрыВыгрузки.Вставить("КодИФНС",		СокрЛП(Титульный.КодИМНС));
	ПараметрыВыгрузки.Вставить("ВидДок",		Строка(СтруктураРеквизитовФормы.мСохраненныйДок.Вид));
	ПараметрыВыгрузки.Вставить("ПоМесту",		СокрЛП(Титульный.ПоМесту));
	ПараметрыВыгрузки.Вставить("ОКВЭДОрг",		СтрЗаменить(СокрЛП(СтрЗаменить(Титульный.ОКВЭД, ".", " ")), " ", "."));
	ПараметрыВыгрузки.Вставить("ТелОрг",		СокрЛП(Титульный.ТелОрганизации));
	ПараметрыВыгрузки.Вставить("НаимОрг",		СокрЛП(Титульный.НаимОрг));
	ПараметрыВыгрузки.Вставить("ИННОрг",		СокрЛП(СтруктураРеквизитовФормы.Организация.ИНН));
	ПараметрыВыгрузки.Вставить("КППОрг",		СокрЛП(Титульный.КПП1));
	ПараметрыВыгрузки.Вставить("КодИФНСПосредника", ?(СтруктураРеквизитовФормы.Организация.КрупнейшийНалогоплательщик,
		СокрЛП(СтруктураРеквизитовФормы.Организация.КодНалоговогоОрганаПолучателя), ""));
	
	ПараметрыВыгрузки.Вставить("ФормаРеорганизации", СокрЛП(Титульный.ФормаРеорганизации));
	ПараметрыВыгрузки.Вставить("РеорганизацияИНН", СокрЛП(Титульный.РеорганизацияИНН));
	ПараметрыВыгрузки.Вставить("РеорганизацияКПП", СокрЛП(Титульный.РеорганизацияКПП));
	
	ПараметрыВыгрузки.Вставить("ТипПодписанта",	СокрЛП(Титульный.ПрПодп));
	ПараметрыВыгрузки.Вставить("НаимОргПредставителя", СокрЛП(Титульный.ОргУп));
	ПараметрыВыгрузки.Вставить("НаимДокПредставителя", СокрЛП(Титульный.ДокУпПред));
	
	ФИОИП = РегламентированнаяОтчетность.РазложитьФИО(Титульный.НаимОрг);
	ПараметрыВыгрузки.Вставить("ФамилияИП",		ФИОИП.Фамилия);
	ПараметрыВыгрузки.Вставить("ИмяИП",			ФИОИП.Имя);
	ПараметрыВыгрузки.Вставить("ОтчествоИП",	ФИОИП.Отчество);
	
	ПараметрыВыгрузки.Вставить("ЭтоПБОЮЛ",		НЕ РегламентированнаяОтчетностьВызовСервера.ЭтоЮридическоеЛицо(СтруктураРеквизитовФормы.Организация));
	
	СведенияОбОрганизации = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(СтруктураРеквизитовФормы.Организация, ТекущаяДатаСеанса(), "ФИОБух, ТелБух");
	Если ПараметрыВыгрузки.ЭтоПБОЮЛ И ПустаяСтрока(СведенияОбОрганизации.ФИОБух) Тогда
		ПараметрыВыгрузки.Вставить("ДолжОтв",		"Индивидуальный предприниматель");
		ПараметрыВыгрузки.Вставить("ФамилияОтв",	ФИОИП.Фамилия);
		ПараметрыВыгрузки.Вставить("ИмяОтв",		ФИОИП.Имя);
		ПараметрыВыгрузки.Вставить("ОтчествоОтв",	ФИОИП.Отчество);
		ПараметрыВыгрузки.Вставить("ТелОтв",		?(ПараметрыВыгрузки.Свойство("ТелОрг"), ПараметрыВыгрузки.ТелОрг, ""));
	Иначе
		ФИОБух = РегламентированнаяОтчетность.РазложитьФИО(СведенияОбОрганизации.ФИОБух);
		ПараметрыВыгрузки.Вставить("ДолжОтв",		"Главный бухгалтер");
		ПараметрыВыгрузки.Вставить("ФамилияОтв",	ФИОБух.Фамилия);
		ПараметрыВыгрузки.Вставить("ИмяОтв",		ФИОБух.Имя);
		ПараметрыВыгрузки.Вставить("ОтчествоОтв",	ФИОБух.Отчество);
		ПараметрыВыгрузки.Вставить("ТелОтв",		СведенияОбОрганизации.ТелБух);
	КонецЕсли;
	
	ФИОПодписанта = РегламентированнаяОтчетность.РазложитьФИО(Титульный.ОргПодписант);
	ПараметрыВыгрузки.Вставить("ФамилияПодписанта",		ФИОПодписанта.Фамилия);
	ПараметрыВыгрузки.Вставить("ИмяПодписанта",			ФИОПодписанта.Имя);
	ПараметрыВыгрузки.Вставить("ОтчествоПодписанта",	ФИОПодписанта.Отчество);
	
	ПараметрыВыгрузки.Вставить("ИмяФайлаСхемы",				"NO_ENVD_1_029_00_05_03_01.xsd");
	ПараметрыВыгрузки.Вставить("ПрефиксИмениФайлаВыгрузки",	"NO_ENVD");
	
	ПараметрыВыгрузки.Вставить("ИмяКлючевогоУзлаСодержательнойЧасти", "ЕНВД");
	
	ПараметрыВыгрузки.Вставить("ИдФайл",		СформироватьИдФайл(ПараметрыВыгрузки));
	
	Возврат ПараметрыВыгрузки;
	
КонецФункции

&НаСервере
Функция ПроверитьВозможностьВыгрузки(ПараметрыВыгрузки, ДеревоВыгрузки)
	
	СтатусПроверки = Истина;
	
	ОКАТОРаздела1 = Новый ТаблицаЗначений;
	ОКАТОРаздела1.Колонки.Добавить("ОКАТО");
	ОКАТОРаздела1.Колонки.Добавить("НомерЛиста");
	ОКАТОРаздела1.Колонки.Добавить("НомерОКАТО");
	
	ОКАТОРаздела2 = Новый ТаблицаЗначений;
	ОКАТОРаздела2.Колонки.Добавить("ОКАТО");
	ОКАТОРаздела2.Колонки.Добавить("НомерЛиста");

	ВозможныеКодыПоМесту = Новый Массив;
	ВозможныеКодыПоМесту.Добавить("120");
	ВозможныеКодыПоМесту.Добавить("214");
    ВозможныеКодыПоМесту.Добавить("215");
	ВозможныеКодыПоМесту.Добавить("245");
	ВозможныеКодыПоМесту.Добавить("310");
	ВозможныеКодыПоМесту.Добавить("320");
	ВозможныеКодыПоМесту.Добавить("331");
	ВозможныеКодыПоМесту.Добавить("332");
	ВозможныеКодыПоМесту.Добавить("333");
	
	ВозможныеКодыПериода = Новый Массив;
	ВозможныеКодыПериода.Добавить("21");
	ВозможныеКодыПериода.Добавить("22");
	ВозможныеКодыПериода.Добавить("23");
	ВозможныеКодыПериода.Добавить("24");
	ВозможныеКодыПериода.Добавить("51");
	ВозможныеКодыПериода.Добавить("54");
	ВозможныеКодыПериода.Добавить("55");
	ВозможныеКодыПериода.Добавить("56");
	ВозможныеКодыПериода.Добавить("50");
	
	Титульный	= СтруктураРеквизитовФормы.мДанныеОтчета.ПолеТабличногоДокументаТитульный;
	Раздел1		= СтруктураРеквизитовФормы.мДанныеОтчета.Раздел1;
	Раздел2		= СтруктураРеквизитовФормы.мДанныеОтчета.Раздел2;
	
	// проверка показателей титульного листа
	Если ПустаяСтрока(ПараметрыВыгрузки.ИННОрг) Тогда
		РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма, "Не задан ИНН!", "Титульный", "ИНН1");
		СтатусПроверки = Ложь;
	КонецЕсли;
	Если НЕ ПараметрыВыгрузки.ЭтоПБОЮЛ И ПустаяСтрока(ПараметрыВыгрузки.КППОрг) Тогда
		РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма, "Не задан КПП организации!", "Титульный", "КПП1");
		СтатусПроверки = Ложь;
	КонецЕсли;
	Если ПустаяСтрока(ПараметрыВыгрузки.ПериодОтч) Тогда
		РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма, "На титульном листе не задан код отчетного периода!", "Титульный", "Период");
		СтатусПроверки = Ложь;
	ИначеЕсли ВозможныеКодыПериода.Найти(ПараметрыВыгрузки.ПериодОтч) = Неопределено Тогда
		РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма, "На титульном листе задан некорректный код отчетного периода!", "Титульный", "Период");
		СтатусПроверки = Ложь;
	КонецЕсли;
	Если ПустаяСтрока(ПараметрыВыгрузки.НаимОрг) Тогда
		РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма, "Не указан налогоплательщик!", "Титульный", "НаимОрг");
		СтатусПроверки = Ложь;
	КонецЕсли;
	Если ПустаяСтрока(ПараметрыВыгрузки.КодИФНС) Тогда
		РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма, "Не задан код налогового органа!", "Титульный", "КодИМНС");
		СтатусПроверки = Ложь;
	КонецЕсли;
	Если ПустаяСтрока(ПараметрыВыгрузки.ОКВЭДОрг) Тогда
		РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма, "На титульном листе не задано значение кода вида деятельности по ОКВЭД!", "Титульный", "ОКВЭД");
		СтатусПроверки = Ложь;
	ИначеЕсли НЕ РегламентированнаяОтчетностьКлиентСервер.ОКВЭДСоответствуетТребованиям(ПараметрыВыгрузки.ОКВЭДОрг) Тогда
		РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма, "На титульном листе задано некорректное значение кода вида деятельности по ОКВЭД! Допустимы значения, соответствующие следующим шаблонам: ""XX"", ""XX.X"", ""XX.XX"", ""XX.XX.X"", ""XX.XX.XX"" (X - любая цифра).", "Титульный", "ОКВЭД");
		СтатусПроверки = Ложь;
	КонецЕсли;
	Если ПустаяСтрока(ПараметрыВыгрузки.ПоМесту) Тогда
		РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма, "На титульном листе не задан код места нахождения (учета)!", "Титульный", "ПоМесту");
		СтатусПроверки = Ложь;
	ИначеЕсли ВозможныеКодыПоМесту.Найти(ПараметрыВыгрузки.ПоМесту) = Неопределено Тогда
		РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма, "На титульном листе задан некорректный код места нахождения (учета)!", "Титульный", "ПоМесту");
		СтатусПроверки = Ложь;
	КонецЕсли;
	Если Не ПустаяСтрока(ПараметрыВыгрузки.ФормаРеорганизации) И СтрНайти("1,2,3,5,6", ПараметрыВыгрузки.ФормаРеорганизации) > 0 Тогда
		Если ПустаяСтрока(ПараметрыВыгрузки.РеорганизацияИНН) Тогда
			РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма, "Не задан ИНН реорганизованной организации!", "Титульный", "РеорганизацияИНН");
			СтатусПроверки = Ложь;
		ИначеЕсли СтрДлина(ПараметрыВыгрузки.РеорганизацияИНН) <> 10 Тогда
			РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма, "Неверно задан ИНН реорганизованной организации!", "Титульный", "РеорганизацияИНН");
			СтатусПроверки = Ложь;
		КонецЕсли;
		
		Если ПустаяСтрока(ПараметрыВыгрузки.РеорганизацияКПП) Тогда
			РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма, "Не задан КПП реорганизованной организации!", "Титульный", "РеорганизацияКПП");
			СтатусПроверки = Ложь;
		ИначеЕсли СтрДлина(ПараметрыВыгрузки.РеорганизацияКПП) <> 9 Тогда
			РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма, "Неверно задан КПП реорганизованной организации!", "Титульный", "РеорганизацияКПП");
			СтатусПроверки = Ложь;
		КонецЕсли;
	КонецЕсли;
	Если НЕ ПараметрыВыгрузки.ЭтоПБОЮЛ Тогда
		Если ПустаяСтрока(ПараметрыВыгрузки.ФамилияПодписанта) Тогда
			РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма, "Не задана фамилия подписанта!", "Титульный", "ОргПодписант");
			СтатусПроверки = Ложь;
		КонецЕсли;
		Если ПустаяСтрока(ПараметрыВыгрузки.ИмяПодписанта) Тогда
			РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма, "Не задано имя подписанта!", "Титульный", "ОргПодписант");
			СтатусПроверки = Ложь;
		КонецЕсли;
		Если ПараметрыВыгрузки.ТипПодписанта = "2" И ПустаяСтрока(ПараметрыВыгрузки.НаимДокПредставителя) Тогда
			РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма, "Не задано наименование документа, удостоверяющего полномочия представителя!", "Титульный", "ДокУпПред");
			СтатусПроверки = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	// проверка раздела 1
	Для Каждого Лист Из Раздел1 Цикл

		ДанныеЛиста = Лист.Данные;
		ИндексЛиста = Раздел1.Индекс(Лист) + 1;
		ТекКБК = СокрЛП(ДанныеЛиста[0].Значение.П000010001003);
		ДлинаКБК = СтрДлина(ТекКБК);
		Если ДлинаКБК <> 20 Тогда
			РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма, "В разделе 1 на странице " + ИндексЛиста + " не" + ?(ДлинаКБК = 0, "", " верно") + " задан КБК!", "Раздел1", "П000010001003", ИндексЛиста);
			СтатусПроверки = Ложь;
		КонецЕсли;
		Для Инд = 1 По 8 Цикл
			ИмяПоляОКАТО = "П000010002003_" + Инд;
			ТекОКАТО = СокрЛП(ДанныеЛиста[0].Значение[ИмяПоляОКАТО]);
			ТекСумма = ДанныеЛиста[0].Значение["П000010003003_" + Инд];
			ДлинаОКАТО = СтрДлина(ТекОКАТО);
			Если (ДлинаОКАТО <> 0 И ДлинаОКАТО <> 11) ИЛИ (ДлинаОКАТО = 0 И ЗначениеСуммыЗаполнено(ТекСумма)) Тогда
				РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма, "В разделе 1 на странице " + ИндексЛиста + " не" + ?(ДлинаОКАТО = 0, "", " верно") + " задан код по ОКАТО!", "Раздел1", "П000010002003_" + Инд, ИндексЛиста);
				СтатусПроверки = Ложь;
			КонецЕсли;
			Если ЗначениеЗаполнено(ТекОКАТО) Тогда
				
				Если ОКАТОРаздела1.НайтиСтроки(Новый Структура("ОКАТО", ТекОКАТО)).Количество() <> 0 Тогда
					РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма, "В разделе 1 на странице " + ИндексЛиста + " задан неуникальный код по ОКАТО!", "Раздел1", ИмяПоляОКАТО, ИндексЛиста);
					СтатусПроверки = Ложь;
				КонецЕсли;
				
				НовСтр = ОКАТОРаздела1.Добавить();
				НовСтр.ОКАТО = ТекОКАТО;
				НовСтр.НомерЛиста = Раздел1.Индекс(Лист) + 1;
				НовСтр.НомерОКАТО = Инд;
			КонецЕсли;

		КонецЦикла;

	КонецЦикла;
	
	Если ОКАТОРаздела1.Количество() = 0 Тогда
		РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма, "Не задано ни одно из значений кода по ОКАТО в разделе 1!", "Раздел1", "П000010002003_1", 1);
		СтатусПроверки = Ложь;
	КонецЕсли;
	
	// проверка раздела 2
	Для Каждого Лист2 Из Раздел2 Цикл
		
		ДанныеЛиста2 = Лист2.Данные;
		НомерЛиста = Раздел2.Индекс(Лист2) + 1;
		
		Если	ЗначениеЗаполнено(ДанныеЛиста2[0].Значение.П000020001000)			ИЛИ ЗначениеЗаполнено(ДанныеЛиста2[0].Значение.П000020002001)
			ИЛИ	ЗначениеЗаполнено(ДанныеЛиста2[0].Значение.П000020002002)		ИЛИ ЗначениеЗаполнено(ДанныеЛиста2[0].Значение.П000020002003)
			ИЛИ	ЗначениеЗаполнено(ДанныеЛиста2[0].Значение.П000020002004)		ИЛИ ЗначениеЗаполнено(ДанныеЛиста2[0].Значение.П000020002005)
			ИЛИ	ЗначениеЗаполнено(ДанныеЛиста2[0].Значение.П000020002006)		ИЛИ ЗначениеЗаполнено(ДанныеЛиста2[0].Значение.П000020002007)
			ИЛИ	ЗначениеЗаполнено(ДанныеЛиста2[0].Значение.П000020002008)		ИЛИ ЗначениеЗаполнено(ДанныеЛиста2[0].Значение.П000020002009)
			ИЛИ	ЗначениеЗаполнено(ДанныеЛиста2[0].Значение.П000020003000)			ИЛИ ЗначениеСуммыЗаполнено(ДанныеЛиста2[0].Значение.П000020004003)
			ИЛИ	ЗначениеСуммыЗаполнено(ДанныеЛиста2[0].Значение.П000020005003)		ИЛИ ЗначениеСуммыЗаполнено(ДанныеЛиста2[0].Значение.П000020006003)
			ИЛИ	ЗначениеСуммыЗаполнено(ДанныеЛиста2[0].Значение.П000020007003)		ИЛИ ЗначениеСуммыЗаполнено(ДанныеЛиста2[0].Значение.П000020010003)
			ИЛИ ЗначениеСуммыЗаполнено(ДанныеЛиста2[0].Значение.П000020011003)		Тогда
			
			П000020001000 = СокрЛП(ДанныеЛиста2[0].Значение.П000020001000);
			ДлинаП000020001000 = СтрДлина(П000020001000);
			Если ДлинаП000020001000 <> 2 Тогда
				РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма, "На странице " + НомерЛиста + " раздела 2 не" + ?(ДлинаП000020001000 = 0, "", "верно") + " указано значение кода вида предпринимательской деятельности!", "Раздел2", "П000020001000", НомерЛиста);
				СтатусПроверки = Ложь;
			КонецЕсли;
			
			П000020002002 = СокрЛП(ДанныеЛиста2[0].Значение.П000020002002);
			ДлинаП000020002002 = СтрДлина(П000020002002);
			Если ДлинаП000020002002 <> 2 ИЛИ НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(П000020002002) Тогда
				РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма, "На странице " + НомерЛиста + " раздела 2 не" + ?(ДлинаП000020002002 = 0, "", "верно") + " указан код субъекта в адресе места осуществления предпринимательской деятельности!", "Раздел2", "П000020002002", НомерЛиста);
				СтатусПроверки = Ложь;
			КонецЕсли;
			
			ОКАТО = СокрЛП(ДанныеЛиста2[0].Значение.П000020003000);
			ДлинаОКАТО = СтрДлина(ОКАТО);
			Если ДлинаОКАТО <> 11 Тогда
				РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма, "На странице " + НомерЛиста + " раздела 2 не" + ?(ДлинаОКАТО = 0, "", "верно") + " указан код по ОКАТО!", "Раздел2", "П000020003000", НомерЛиста);
				СтатусПроверки = Ложь;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ОКАТО) Тогда
				НовСтр = ОКАТОРаздела2.Добавить();
				НовСтр.ОКАТО = ОКАТО;
				НовСтр.НомерЛиста = НомерЛиста;
			КонецЕсли;
			
			ТаблЗначРаздел2 = ДанныеФормыВЗначение(Раздел2, Тип("ТаблицаЗначений"));
			
			// Анализ дат постановки/снятия с учета.
			Если НЕ ТаблЗначРаздел2.Колонки.Найти("ДанныеДопСтрок") = Неопределено Тогда
				ОписаниеТиповДата = Новый ОписаниеТипов("Дата", , Новый КвалификаторыДаты(ЧастиДаты.Дата));
				
				ТаблицаПроверки = Новый ТаблицаЗначений;
				ТаблицаПроверки.Колонки.Добавить("ДатаСобытия", ОписаниеТиповДата);
				ТаблицаПроверки.Колонки.Добавить("ВидСобытия");
				
				ТаблицаПроверки.Индексы.Добавить("ДатаСобытия");
				
				ДатыПостановкиНаУчет = Лист2.ДанныеДопстрок[0].Значение[СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_1];
				Для Каждого ДатаПостановки Из ДатыПостановкиНаУчет Цикл
					ЗначениеДаты = ДатаПостановки["П000020003201"];
					Если ЗначениеЗаполнено(ЗначениеДаты) Тогда
						СтрокаПроверки = ТаблицаПроверки.Добавить();
						СтрокаПроверки.ДатаСобытия = ЗначениеДаты;
						СтрокаПроверки.ВидСобытия  = "Постановка";
						
						Если НЕ (НачалоДня(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) <= ЗначениеДаты И ЗначениеДаты <= КонецДня(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета)) Тогда
							НомерСтроки = СтрокаЧГ0(ДатыПостановкиНаУчет.Индекс(ДатаПостановки) + 1);
							РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма, "На странице " + НомерЛиста + " раздела 2 дата постановки на учет выходит за границы отчетного периода!", "Раздел2", "П000020003201_" + НомерСтроки, НомерЛиста);
							СтатусПроверки = Ложь;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				
				ДатыСнятияСУчета = Лист2.ДанныеДопстрок[0].Значение[СтруктураРеквизитовФормы.ИдМСЧ_Раздел2_2];
				Для Каждого ДатаСнятия Из ДатыСнятияСУчета Цикл
					ЗначениеДаты = ДатаСнятия["П000020003501"];
					Если ЗначениеЗаполнено(ЗначениеДаты) Тогда
						СтрокаПроверки = ТаблицаПроверки.Добавить();
						СтрокаПроверки.ДатаСобытия = ЗначениеДаты;
						СтрокаПроверки.ВидСобытия  = "Снятие";
						
						Если НЕ (НачалоДня(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) <= ЗначениеДаты И ЗначениеДаты <= КонецДня(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета)) Тогда
							НомерСтроки = СтрокаЧГ0(ДатыСнятияСУчета.Индекс(ДатаСнятия) + 1);
							РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма, "На странице " + НомерЛиста + " раздела 2 дата снятия с учета выходит за границы отчетного периода!", "Раздел2", "П000020003501_" + НомерСтроки, НомерЛиста);
							СтатусПроверки = Ложь;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				
				ТаблицаПроверки.Сортировать("ДатаСобытия");
				
				Если ТаблицаПроверки.Количество() > 1 Тогда
					ПредыдущееСобытие = ТаблицаПроверки[0].ВидСобытия;
					Для Инд = 1 По ТаблицаПроверки.Количество() - 1 Цикл
						ТекущееСобытие = ТаблицаПроверки[Инд].ВидСобытия;
						Если ПредыдущееСобытие = ТекущееСобытие Тогда
							РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма, "На странице " + НомерЛиста + " раздела 2 задана некорректная последовательность событий постановки/снятия с учета!", "Раздел2", "П000020003201_1", НомерЛиста);
							СтатусПроверки = Ложь;
							Прервать;
						КонецЕсли;
						ПредыдущееСобытие = ТекущееСобытие;
					КонецЦикла;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ОКАТОРаздела2.Количество() = 0 Тогда
		РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма, "Не задано ни одно из значений кода по ОКАТО в разделе 2!", "Раздел2", "П000020003000", 1);
		СтатусПроверки = Ложь;
	КонецЕсли;
	
	// проверка соответствия экземпляров раздела 1 экземплярам раздела 2
	Для Каждого ЕдОКАТОРаздела1 Из ОКАТОРаздела1 Цикл
		Если ОКАТОРаздела2.НайтиСтроки(Новый Структура("ОКАТО", ЕдОКАТОРаздела1.ОКАТО)).Количество() = 0 Тогда
			РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма, "Для значения кода по ОКАТО """ + ЕдОКАТОРаздела1.ОКАТО + """ на странице " + ЕдОКАТОРаздела1.НомерЛиста + " раздела 1 отсутствуют соответствующие экземпляры раздела 2!", "Раздел1", "П000010002003_" + ЕдОКАТОРаздела1.НомерОКАТО, ЕдОКАТОРаздела1.НомерЛиста);
			СтатусПроверки = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ЕдОКАТОРаздела2 Из ОКАТОРаздела2 Цикл
		Если ОКАТОРаздела1.НайтиСтроки(Новый Структура("ОКАТО", ЕдОКАТОРаздела2.ОКАТО)).Количество() = 0 Тогда
			РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма, "Для значения кода по ОКАТО """ + ЕдОКАТОРаздела2.ОКАТО + """ на странице " + ЕдОКАТОРаздела2.НомерЛиста + " раздела 2 отсутствуют соответствующие экземпляры раздела 1!", "Раздел2", "П000020003000", ЕдОКАТОРаздела2.НомерЛиста);
			СтатусПроверки = Ложь;
		КонецЕсли;

	КонецЦикла;
	
	Возврат СтатусПроверки;
	
КонецФункции

&НаСервере
Функция ИзвлечьСтруктуруXML()
	
	ДеревоСтруктуры = Новый ДеревоЗначений;
	ДеревоСтруктуры.Колонки.Добавить("Код");
	ДеревоСтруктуры.Колонки.Добавить("Тип");
	ДеревоСтруктуры.Колонки.Добавить("Формат");
	ДеревоСтруктуры.Колонки.Добавить("МинРазмерность");
	ДеревоСтруктуры.Колонки.Добавить("МаксРазмерность");
	ДеревоСтруктуры.Колонки.Добавить("Обязательность");
	ДеревоСтруктуры.Колонки.Добавить("Многостраничность");
	ДеревоСтруктуры.Колонки.Добавить("Многострочность");
	ДеревоСтруктуры.Колонки.Добавить("Раздел");
	ДеревоСтруктуры.Колонки.Добавить("Ключ");
	ДеревоСтруктуры.Колонки.Добавить("Условие");
	ДеревоСтруктуры.Колонки.Добавить("ЗначениеПоУмолчанию");
	ДеревоСтруктуры.Колонки.Добавить("Значение");
	ДеревоСтруктуры.Колонки.Добавить("Представление");
	ДеревоСтруктуры.Колонки.Добавить("Показатели");
	
	Макет = ОбъектОтчета(ЭтаФорма.ИмяФормы).ПолучитьМакет("СхемаВыгрузки503");
	ВысотаТаблицы = Макет.ВысотаТаблицы;
	
	УчтенныеГруппы = Новый Соответствие;
	
	Для Уровень = 0 По Макет.КоличествоУровнейГруппировокСтрок() - 1 Цикл
		Макет.ПоказатьУровеньГруппировокСтрок(Уровень);
		Для НомерСтроки = 2 По ВысотаТаблицы Цикл
			НомСтр = ВысотаТаблицы - НомерСтроки + 2;
			Если Макет.Область(НомСтр, 0, НомСтр, 0).Видимость И УчтенныеГруппы.Получить(НомСтр) = Неопределено Тогда
				
				РодительскийУзел = ДеревоСтруктуры;
				Если Уровень <> 0 Тогда
					Для Инд = 1 По НомСтр - 2 Цикл
						Узел = УчтенныеГруппы.Получить(НомСтр - Инд);
						Если Узел <> Неопределено Тогда
							РодительскийУзел = Узел;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
				НовСтр = РодительскийУзел.Строки.Вставить(0);
				НовСтр.Код = СокрЛП(Макет.Область(НомСтр, 1, НомСтр, 1).Текст);
				НовСтр.Раздел = СокрЛП(Макет.Область(НомСтр, 2, НомСтр, 2).Текст);
				НовСтр.Ключ = СокрЛП(Макет.Область(НомСтр, 3, НомСтр, 3).Текст);
				НовСтр.Тип = СокрЛП(Макет.Область(НомСтр, 4, НомСтр, 4).Текст);
				НовСтр.Формат = СокрЛП(Макет.Область(НомСтр, 5, НомСтр, 5).Текст);
				МинРазмерность = СокрЛП(Макет.Область(НомСтр, 6, НомСтр, 6).Текст);
				НовСтр.МинРазмерность = ?(ПустаяСтрока(МинРазмерность), ?(НовСтр.Формат = "N", 99999, 0), Число(МинРазмерность));
				МаксРазмерность = СокрЛП(Макет.Область(НомСтр, 7, НомСтр, 7).Текст);
				НовСтр.МаксРазмерность = ?(ПустаяСтрока(МаксРазмерность), 99999, Число(МаксРазмерность));
				НовСтр.Обязательность = СокрЛП(Макет.Область(НомСтр, 8, НомСтр, 8).Текст);
				НовСтр.Многостраничность = НЕ ПустаяСтрока(Макет.Область(НомСтр, 9, НомСтр, 9).Текст);
				НовСтр.Многострочность = НЕ ПустаяСтрока(Макет.Область(НомСтр, 10, НомСтр, 10).Текст);
				НовСтр.Условие = СокрЛП(Макет.Область(НомСтр, 11, НомСтр, 11).Текст);
				НовСтр.ЗначениеПоУмолчанию = СокрЛП(Макет.Область(НомСтр, 12, НомСтр, 12).Текст);
				НовСтр.Представление = СокрЛП(Макет.Область(НомСтр, 13, НомСтр, 13).Текст);
				
				УчтенныеГруппы.Вставить(НомСтр, НовСтр);
				
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ДеревоСтруктуры;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДанными(ДеревоВыгрузки, ПараметрыВыгрузки)
	
	ОбработатьУсловныеЭлементы(ПараметрыВыгрузки, ДеревоВыгрузки); // формируем точную структуру XML-макета
	ЗаполнитьДаннымиУзел(ПараметрыВыгрузки, ДеревоВыгрузки); // заполняем дерево данными
	ОтсечьНезаполненныеНеобязательныеУзлы(ДеревоВыгрузки);
			
КонецПроцедуры

&НаСервере
Функция ВыгрузитьДеревоВXML(ДеревоВыгрузки, ПараметрыВыгрузки)
	
	ПотокXML = РегламентированнаяОтчетность.СоздатьНовыйПотокXML("windows-1251"); // создаем новый поток для записи
	ЗаписатьУзелДереваВXML(ДеревоВыгрузки, ПотокXML, ПараметрыВыгрузки); // пишем дерево в поток
	ТекстДляЗаписи = ПотокXML.Закрыть(); // получаем текст XML
	Возврат ТекстДляЗаписи;
	
КонецФункции

&НаСервере
Функция СформироватьИдФайл(ПараметрыВыгрузки)
			
	Возврат ПараметрыВыгрузки.ПрефиксИмениФайлаВыгрузки
			+ "_" + ?(ЗначениеЗаполнено(ПараметрыВыгрузки.КодИФНСПосредника), ПараметрыВыгрузки.КодИФНСПосредника, ПараметрыВыгрузки.КодИФНС)
			+ "_" + ПараметрыВыгрузки.КодИФНС
			+ "_" + ?(ПараметрыВыгрузки.Свойство("ЭтоПБОЮЛ") И ПараметрыВыгрузки.ЭтоПБОЮЛ, СокрЛП(ПараметрыВыгрузки.ИННОрг), СокрЛП(ПараметрыВыгрузки.ИННОрг) + СокрЛП(ПараметрыВыгрузки.КППОрг))
			+ "_" + Формат(ТекущаяДатаСеанса(), "ДФ=ггггММдд")
			+ "_" + Строка(Новый УникальныйИдентификатор);
			
КонецФункции

&НаСервере
Процедура ОбработатьУсловныеЭлементы(Знач ПараметрыВыгрузки, Узел)
	
	Если ТипЗнч(Узел) <> Тип("ДеревоЗначений") Тогда
		Если Узел.Код = ПараметрыВыгрузки.ИмяКлючевогоУзлаСодержательнойЧасти Тогда
			Возврат;
		КонецЕсли;
		РегламентированнаяОтчетность.ДополнитьСтруктуруПараметровПрочиеОтчеты(СтруктураРеквизитовФормы.мДанныеОтчета, ПараметрыВыгрузки, Узел);
	КонецЕсли;
	КоличествоСтрок = Узел.Строки.Количество();
	Для Инд = 1 По КоличествоСтрок Цикл
		ТекСтр = Узел.Строки.Получить(КоличествоСтрок - Инд);
		Если НЕ ПустаяСтрока(ТекСтр.Условие) Тогда
			Если НЕ РегламентированнаяОтчетность.УсловиеВыполнено(ЭтаФорма, ПараметрыВыгрузки, ТекСтр.Условие) Тогда
				Узел.Строки.Удалить(ТекСтр);
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		ОбработатьУсловныеЭлементы(ПараметрыВыгрузки, ТекСтр);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДаннымиУзел(ПараметрыВыгрузки, Узел, НомерСтроки = Неопределено)
	
	Для Каждого Стр из Узел.Строки Цикл
		Если Стр.Тип = "С" ИЛИ Стр.Тип = "C" Тогда // учтем оба варианта: кириллицу и латиницу
			Если РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(ПараметрыВыгрузки, "ИмяКлючевогоУзлаСодержательнойЧасти") И Стр.Код = ПараметрыВыгрузки.ИмяКлючевогоУзлаСодержательнойЧасти Тогда
				ЗаполнитьСодержательнуюЧасть(Стр);
			Иначе
				ЗаполнитьДаннымиУзел(ПараметрыВыгрузки, Стр);
			КонецЕсли;
		Иначе
			Если ПустаяСтрока(Стр.ЗначениеПоУмолчанию) Тогда
				Если НЕ ПустаяСтрока(Стр.Ключ) И РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(ПараметрыВыгрузки, Стр.Ключ) Тогда
					ВывестиПоказательВXML(Стр, ПараметрыВыгрузки[Стр.Ключ]);
				Иначе
					Стр.Значение = "";
				КонецЕсли;
			ИначеЕсли Лев(Стр.ЗначениеПоУмолчанию, 1) = "&" Тогда
				Ключ = Сред(Стр.ЗначениеПоУмолчанию, 2);
				Если РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(ПараметрыВыгрузки, Ключ) Тогда
					ВывестиПоказательВXML(Стр, ПараметрыВыгрузки[Ключ]);
				КонецЕсли;
			Иначе
				Стр.Значение = Стр.ЗначениеПоУмолчанию;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОтсечьНезаполненныеНеобязательныеУзлы(Узел)
	
	КоличествоСтрок = Узел.Строки.Количество();
	Для Инд = 1 По КоличествоСтрок Цикл
		Стр = Узел.Строки.Получить(КоличествоСтрок - Инд);
		ОтсечьНезаполненныеНеобязательныеУзлы(Стр);
	КонецЦикла;
	
	Если ТипЗнч(Узел) <> Тип("ДеревоЗначений") Тогда
		Если (СтрНайти(Узел.Обязательность, "Н") <> 0 ИЛИ СтрНайти(Узел.Обязательность, "H") <> 0) И УзелПуст(Узел) Тогда // учтем оба варианта: кириллицу и латиницу
			РегламентированнаяОтчетность.УдалитьУзел(Узел);
		ИначеЕсли (СтрНайти(Узел.Обязательность, "М") <> 0 ИЛИ СтрНайти(Узел.Обязательность, "M") <> 0) // учтем оба варианта: кириллицу и латиницу
		И УзелПуст(Узел)
		И ?(СтрНайти(Узел.Обязательность, "О") <> 0 ИЛИ СтрНайти(Узел.Обязательность, "O") <> 0, РегламентированнаяОтчетность.ИмеютсяАналогичныеСоседниеУзлыКлюч(Узел), Истина) Тогда
			РегламентированнаяОтчетность.УдалитьУзел(Узел);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьУзелДереваВXML(СтрокаДерева, ПотокXML, ПараметрыВыгрузки) Экспорт
	
	Если ТипЗнч(СтрокаДерева) = Тип("ДеревоЗначений") Тогда
		ПотокXML.ЗаписатьНачалоЭлемента("Файл");
		ПотокXML.ЗаписатьАтрибут("xmlns:xsi", "http://www.w3.org/2001/XMLSchema-instance");
		Для каждого Стр Из СтрокаДерева.Строки Цикл
			ЗаписатьУзелДереваВXML(Стр, ПотокXML, ПараметрыВыгрузки);
		КонецЦикла;
		ПотокXML.ЗаписатьКонецЭлемента();
	Иначе
		Если СтрокаДерева.Тип = "А" ИЛИ СтрокаДерева.Тип = "A" Тогда 
			ПотокXML.ЗаписатьАтрибут(СтрокаДерева.Код, Строка(СтрокаДерева.Значение));
		Иначе
			ПотокXML.ЗаписатьНачалоЭлемента(СтрокаДерева.Код);
			Для каждого Лист из СтрокаДерева.Строки Цикл
				ЗаписатьУзелДереваВXML(Лист, ПотокXML, ПараметрыВыгрузки);
			КонецЦикла;
			ПотокXML.ЗаписатьТекст(Строка(СтрокаДерева.Значение));
			ПотокXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
	КонецЕсли;

КонецФункции

&НаСервере
Процедура ЗаполнитьСодержательнуюЧасть(УзелРодитель)
	
	Раздел1 = СтруктураРеквизитовФормы.мДанныеОтчета.Раздел1;
	Раздел2 = СтруктураРеквизитовФормы.мДанныеОтчета.Раздел2;
	Раздел3 = СтруктураРеквизитовФормы.мДанныеОтчета.ПолеТабличногоДокументаРаздел3;
	
	// выгружаем раздел 1 и в подчинении к нему - раздел 2
	УзелСумНалПУВД = ПолучитьПодчиненныйЭлемент(УзелРодитель, "СумНалПУВД");
	УзелСумПУВД = ПолучитьПодчиненныйЭлемент(УзелСумНалПУВД, "СумПУВД");

	ПоследнийКБК = Неопределено;

	Для Каждого ЛистРаздела1 Из Раздел1 Цикл
		
		ДанныеЛистаРаздела1 = ЛистРаздела1.Данные[0].Значение;
		
		КБК = СокрЛП(ДанныеЛистаРаздела1.П000010001003);
		Если НЕ ЗначениеЗаполнено(КБК) Тогда
			Продолжить;
		КонецЕсли;
		
		ЗадатьЗначениеЭлемента(УзелСумНалПУВД, "КБК", КБК);
		
		Для БлокРаздела1 = 1 По 8 Цикл
			
			ОКАТО	= СокрЛП(ДанныеЛистаРаздела1["П000010002003_" + БлокРаздела1]);
			НалПУ	= ДанныеЛистаРаздела1["П000010003003_" + БлокРаздела1];
			
			Если НЕ ЗначениеЗаполнено(ОКАТО) Тогда
				Продолжить;
			КонецЕсли;
			
			// выгружаем данные раздела 1
			УзелРаздел1 = СкопироватьУзел(УзелСумНалПУВД, УзелСумПУВД);

			ЗадатьЗначениеЭлемента(УзелРаздел1, "ОКАТО", ОКАТО);
			ЗадатьЗначениеЭлемента(УзелРаздел1, "НалПУ", НалПУ);
			
			// выгружаем соответствующие данные раздела 2
			УзелРасчНалВД = ПолучитьПодчиненныйЭлемент(УзелРаздел1, "РасчНалВД");

			Для Каждого ЛистРаздела2 Из Раздел2 Цикл
				
				ДанныеЛистаРаздела2 = ЛистРаздела2.Данные[0].Значение;
				Если ОКАТО <> СокрЛП(ДанныеЛистаРаздела2.П000020003000) Тогда

					Продолжить;
				КонецЕсли;
				
				УзелРаздел2 = СкопироватьУзел(УзелРаздел1, УзелРасчНалВД);
				ЗаполнитьДаннымиУзел(ДанныеЛистаРаздела2, УзелРаздел2);

			КонецЦикла;

		КонецЦикла;
		
	КонецЦикла;
	
	// выгружаем раздел 3
	УзелСумНалПУВД = ПолучитьПодчиненныйЭлемент(УзелРодитель, "СумНалПУ");
	ЗаполнитьДаннымиУзел(Раздел3, УзелСумНалПУВД);
	
КонецПроцедуры

&НаСервере
Функция ЗначениеСуммыЗаполнено(ЗначениеСуммы)
	
	Возврат (Окр(ЗначениеСуммы) <> 0)
	
КонецФункции

&НаСервере
Функция ВывестиПоказательВXML(Узел, ЗначениеПоказателя)
	
	МинШирина = Узел.МинРазмерность;
	МаксШирина = Узел.МаксРазмерность;
	
	Если Узел.Формат = "T" ИЛИ Узел.Формат = "Т" Тогда // учтем оба варианта: кириллицу и латиницу
		Узел.Значение = ?(МаксШирина < СтрДлина(СокрЛП(ЗначениеПоказателя)), СокрЛП(Лев(СокрЛП(ЗначениеПоказателя), МаксШирина)), СокрЛП(ЗначениеПоказателя));
	ИначеЕсли Узел.Формат = "N" Тогда
		СтрокаФормата = "ЧРД=.;ЧН=0;ЧГ=;";
		Если Узел.МаксРазмерность <> 0 И Узел.МаксРазмерность <> 99999 Тогда
			СтрокаФормата = СтрокаФормата + "ЧЦ=" + Формат(Узел.МаксРазмерность, "ЧГ=") + ";";
		КонецЕсли;
		Если Узел.МинРазмерность <> 99999 Тогда
			СтрокаФормата = СтрокаФормата + "ЧДЦ=" + Формат(Узел.МинРазмерность, "ЧГ=") + ";";
		КонецЕсли;
		Узел.Значение = СокрЛП(Формат(ЗначениеПоказателя, СтрокаФормата));
	ИначеЕсли Узел.Формат = "gYear" Тогда
		Если ТипЗнч(ЗначениеПоказателя) = Тип("Дата") Тогда
			Узел.Значение = СокрЛП(Формат(ЗначениеПоказателя, "ДФ=гггг"));
		Иначе
			Узел.Значение = Прав(СокрЛП(ЗначениеПоказателя), 4);
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция УзелПуст(Узел)
	
	ПустойУзел = ?(Узел.Формат = "N", Узел.Значение = "0" ИЛИ (НЕ ЗначениеЗаполнено(Узел.Значение)), НЕ ЗначениеЗаполнено(Узел.Значение));
	Для Каждого Стр из Узел.Строки Цикл
		Если НЕ УзелПуст(Стр) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат ПустойУзел;
	
КонецФункции

&НаСервере
Функция ПолучитьПодчиненныйЭлемент(Узел, КодЭлемента)
	
	Для Каждого Стр Из Узел.Строки Цикл
		Если Стр.Код = КодЭлемента Тогда
			Возврат Стр;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции 

&НаСервере
Функция СкопироватьУзел(Родитель, Узел)
	
	НовыйУзел = Родитель.Строки.Добавить();
	ЗаполнитьЗначенияСвойств(НовыйУзел, Узел, , "Родитель, Строки");
	Для Каждого Стр из Узел.Строки Цикл
		СкопироватьУзел(НовыйУзел, Стр);
	КонецЦикла;
	Возврат НовыйУзел;
	
КонецФункции 

&НаСервере
Процедура ЗадатьЗначениеЭлемента(Узел, КодЭлемента, Значение)
	
	ВывестиПоказательВXML(ПолучитьПодчиненныйЭлемент(Узел, КодЭлемента), Значение);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПроверитьВыгрузку(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПроверитьВыгрузкуЗавершение", ЭтотОбъект);

	Отказ = Ложь;
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередВыгрузкойРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
		
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВыгрузкуЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьВыгрузкуОтчета();
	
КонецПроцедуры
     
&НаКлиенте
Процедура ПроверитьВыгрузкуОтчета()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПроверитьВыгрузкуОтчетаЗавершение", ЭтотОбъект);
	
	Если Модифицированность Тогда
		СохранитьНаКлиенте(,ОписаниеОповещения);
	Иначе
		ВыполнитьОбработкуОповещения(ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВыгрузкуОтчетаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ФормаВыгрузкиРеглОтчета = ПолучитьФорму("Документ.ВыгрузкаРегламентированныхОтчетов.Форма.ФормаДокумента", , ЭтаФорма);
	
	СпДокОсн = Новый СписокЗначений;
	СпДокОсн.Добавить(СтруктураРеквизитовФормы.мСохраненныйДок);
	
	ФормаВыгрузкиРеглОтчета.Проверить(СпДокОсн);
	
КонецПроцедуры

&НаСервере
Функция ПроверитьПоказатели() Экспорт
	
	СформироватьСтруктуруПоказателей();
	ПараметрыВыгрузки = СформироватьСтруктуруПараметров();
	ДеревоВыгрузки = ИзвлечьСтруктуруXML();
	Если НЕ ПроверитьВозможностьВыгрузки(ПараметрыВыгрузки, ДеревоВыгрузки) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЗаполнитьДанными(ДеревоВыгрузки, ПараметрыВыгрузки);
	Если НЕ РегламентированнаяОтчетность.ПроверитьДанные(ЭтаФорма, ДеревоВыгрузки) Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура АктивизироватьЯчейку(Ячейка) Экспорт
	
	РегламентированнаяОтчетностьКлиент.АктивизироватьЯчейку(ЭтаФорма, Ячейка);
		
КонецПроцедуры

&НаСервере
Процедура УправлениеЛистамиНаСервере(ТипНП = Неопределено) Экспорт

	УправлениеЛистами(ТипНП);

КонецПроцедуры

&НаКлиенте
Процедура УправлениеЛистамиНаКлиенте(ТипНП = Неопределено) Экспорт

	УправлениеЛистами(ТипНП);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеЛистами(ТипНП = Неопределено)
    	
	Возврат;

КонецПроцедуры

&НаСервере
Процедура ОчисткаРегламентированногоОтчетаНаСервере(ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста, РежимОчистки, Многостраничность, КолВоСтраницВРазделе) Экспорт
	
	УдалятьсяВсеДопЭкземпляры = Ложь;
	
	Если СтрНайти(РежимОчистки, "ОчиститьТекущийРаздел") > 0 Тогда
		
		Если (Многостраничность) И (КолВоСтраницВРазделе > 1) Тогда
			
			ОчиститьПоказателиОтчетаЗаполняемыеИзИБНаСервере(ИмяСтраницы);
			
			УстановитьДоступностьОбластей(ЭтаФорма, ИмяСтраницы);
			
			УдалятьсяВсеДопЭкземпляры = Истина;
			
		Иначе
			
			ОчиститьТабличноеПолеНаСервере(ИмяСтраницы);
			
		КонецЕсли;
		
		СформироватьДеревоРазделовОтчетаНаСервере();
		
		СтруктураРеквизитовФормы.ВыводитьСтраницуВТаблДокНаСервере = Ложь;
		
	ИначеЕсли СтрНайти(РежимОчистки, "ОчиститьТекущийЭкземплярМногостраничногоРаздела") > 0 Тогда
		
		ОчиститьТабличноеПолеНаСервере(ИмяСтраницы);
		
	КонецЕсли;
	
	ЗаполнитьПоказателиЗначениямиПоУмолчанию(ИмяСтраницы);
	
	Если ИмяСтраницы = "Раздел2" Тогда
		РассчитатьДниОсуществленияДеятельности();
	КонецЕсли;
	
	Если ИмяСтраницы = "Титульный" Тогда
		Если Элементы.Найти("ДатаПодписи") = Неопределено Тогда
			Область = ТабличныйДокумент.Области.Найти("ДатаПодписи");
			Если НЕ Область = Неопределено Тогда
				Если ТипЗнч(Область.Значение) = Тип("Строка") Тогда
					ДатаПодписи = Лев(СтрЗаменить(Область.Значение, ".", ""), 8);
				ИначеЕсли ТипЗнч(Область.Значение) = Тип("Дата") Тогда
					Если ЗначениеЗаполнено(Область.Значение) Тогда
						ДатаПодписи = Лев(СтрЗаменить(Формат(Область.Значение, "ДФ = ""дд.ММ.гггг 'г.'"""), ".", ""), 8);
					Иначе
						ДатаПодписи = "        ";
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	РегламентированнаяОтчетностьКлиентСервер.ПослеОчисткиРегламентированногоОтчета(ЭтаФорма, ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста);
	
КонецПроцедуры 

&НаКлиенте
Процедура ОчисткаРегламентированногоОтчетаНаКлиенте(ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста, РежимОчистки, Многостраничность, КолВоСтраницВРазделе) Экспорт
	
	УдалятьсяВсеДопЭкземпляры = Ложь;
	
	Если СтрНайти(РежимОчистки, "ОчиститьТекущийРаздел") > 0 Тогда
		
		Если (Многостраничность) И (КолВоСтраницВРазделе > 1) Тогда

			РегламентированнаяОтчетностьКлиентСервер.ОчиститьПоказателиОтчетаЗаполняемыеИзИБ(ЭтаФорма, ИмяСтраницы);

			УдалятьсяВсеДопЭкземпляры = Истина;
			
		Иначе

			ОчиститьТабличноеПолеНаКлиенте("ПолеТабличногоДокумента" + ИмяСтраницы);

		КонецЕсли;
		
		СформироватьДеревоРазделовОтчетаНаКлиенте();
		
	ИначеЕсли СтрНайти(РежимОчистки, "ОчиститьТекущийЭкземплярМногостраничногоРаздела") > 0 Тогда
		
		ОчиститьТабличноеПолеНаКлиенте("ПолеТабличногоДокумента" + ИмяСтраницы);
		
	КонецЕсли;
	
	РегламентированнаяОтчетностьКлиентСервер.ПослеОчисткиРегламентированногоОтчета(ЭтаФорма, ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументВыбор(Элемент, Область, СтандартнаяОбработка)
	ОбработкаВыбораВПолеТабличногоДокумента(Элемент, Область, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРегионыНаСервере()
	
	РегламентированнаяОтчетность.ЗаполнитьРегионы(Регионы);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументПриИзмененииСодержимогоОбласти(Элемент, Область)
	
	Если СтрНайти(Область.Имя, "П000020003201") = 1 
	 ИЛИ СтрНайти(Область.Имя, "П000020003501") = 1 Тогда
		РассчитатьДниОсуществленияДеятельности();
	КонецЕсли;
	
	Если Область.Имя = "ДатаПодписи" Тогда 
		ДатаПодписи = Область.Значение;
		ЗаполнитьСведенияОбОрганизацииНаСервере(Истина);
		СтруктураРеквизитовФормы.мВПрограммеИзмененаОрганизация = Ложь;
		Модифицированность = Истина;
		Возврат;
	ИначеЕсли Область.Имя = "НомерКорректировки" Тогда 
		НомерКорректировки = Область.Значение;
		СтруктураРеквизитовФормы.ВидДокумента = ?(НомерКорректировки = 0, 0, 1);
		
		РегламентированнаяОтчетностьКлиентСервер.УстановитьЗначениеОКВЭД(ДатаПодписи,
																	 СтруктураРеквизитовФормы,
																	 ТабличныйДокумент.Области.ОКВЭД.Значение);
		
		Модифицированность = Истина;
		Возврат;
	КонецЕсли;
	
	ОбработкаИзмененияСодержимогоВПолеТабличногоДокумента(Элемент, Область);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьОписаниеТипаЧислаЕДляРаздела(ИмяРаздела = "")
	
	Результат = Новый Структура("ОписаниеТипа, Длина, Точность");
	
	Если ИмяРаздела = "Раздел1" Тогда
		Результат = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(17, 2));
	Иначе
	    Результат = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(17, 2));
	КонецЕсли; 

	Возврат Результат; 
КонецФункции

&НаСервере
Процедура ОчиститьНаСервере() Экспорт
	
	СтруктураДанныхРаздел3.Очистить();
			
	ТаблицаСтраницыРаздела1.Очистить();
	ТаблицаСтраницыРаздела2.Очистить();
		
	ИнициализацияМногостраничныхРазделов();
	
	ЗаполнитьПустыеСтруктурыДанных();
	
	Если НЕ СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Титульный"  Тогда
		ОчиститьТабличноеПолеНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	КонецЕсли;
		
	ВывестиМакетСтраницыВТабличныйДокументНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела, 1);
		
	СтруктураРеквизитовФормы.ВыводитьСтраницуВТаблДокНаСервере = Ложь;
	
	РегламентированнаяОтчетностьКлиентСервер.ОчиститьВариантыЗаполнения(ЭтаФорма);
		
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ СТЫКОВКИ С СЕРВИСОМ СДАЧИ ОТЧЕТНОСТИ ЧЕРЕЗ ПРЕДСТАВИТЕЛЯ

&НаКлиенте
Процедура ОтправитьЧерезПредставителя(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтправитьЧерезПредставителяЗавершение", ЭтотОбъект);

	Отказ = Ложь;
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередВыгрузкойРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЧерезПредставителяЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	РегламентированнаяОтчетностьКлиент.ПриНажатииНаКнопкуОтправкиЧерезПредставителяВРегламентированномОтчете(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВИнтернете(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПроверитьВИнтернетеЗавершение", ЭтотОбъект);

	Отказ = Ложь;
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередВыгрузкойРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
		
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВИнтернетеЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	РегламентированнаяОтчетностьКлиент.ПроверитьВИнтернете(ЭтаФорма);
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ МЕХАНИЗМА ПРОВЕРКИ КОНТРОЛЬНЫХ СООТНОШЕНИЙ

&НаКлиенте
Процедура Проверить(Команда)
	
	РегламентированнаяОтчетностьКлиент.ПроверитьКонтрольныеСоотношения(ЭтаФорма, ОбработкаКС);
	
КонецПроцедуры

&НаСервере
Функция ПроверитьКонтрольныеСоотношенияВОтчете() Экспорт
	
	СформироватьСтруктуруПоказателей();
			
	СтруктураРеквизитовФормы.ТекстДляЗаголовочнойЧасти = РегламентированнаяОтчетностьКлиентСервер.ПредставлениеДокументаРеглОтч(СтруктураРеквизитовФормы.мСохраненныйДок);
	
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("КоличествоНайденныхОшибок",    0);
	СтруктураРезультата.Вставить("КоличествоНайденныхБезОшибок", 0);
	СтруктураРезультата.Вставить("СтруктураОшибок", Неопределено);
	
	Если СписокРасшифровкиПоказателей = Неопределено Тогда 
		СписокРасшифровкиПоказателей = РегламентированнаяОтчетность.СоздатьСписокРасшифровкиПоказателей();
	Иначе
		СписокРасшифровкиПоказателей.Очистить();
	КонецЕсли;
	
	Если СписокРасшифровкиформулы = Неопределено Тогда 
		СписокРасшифровкиформулы = РегламентированнаяОтчетность.СоздатьСписокРасшифровкиформулы();
	Иначе
		СписокРасшифровкиформулы.Очистить();
	КонецЕсли;
	
	СчетчикФормулДляРасшифровок = 0;
	
	ПроверкаКС_1_1(СтруктураРезультата);
	ПроверкаКС_1_2(СтруктураРезультата);
	ПроверкаКС_1_3(СтруктураРезультата);
	ПроверкаКС_1_4(СтруктураРезультата);
	ПроверкаКС_1_5(СтруктураРезультата);
	ПроверкаКС_1_6(СтруктураРезультата);
	ПроверкаКС_1_7(СтруктураРезультата);
	ПроверкаКС_1_8(СтруктураРезультата);
	ПроверкаКС_1_9(СтруктураРезультата);
	ПроверкаКС_1_10(СтруктураРезультата);
	
	Если СписокРасшифровкиПоказателей.Количество() > 0 Тогда 
		СтруктураРезультата.Вставить("СписокРасшифровкиПоказателей", 
			ПоместитьВоВременноеХранилище(СписокРасшифровкиПоказателей, Новый УникальныйИдентификатор));
	КонецЕсли;
	
	Если СписокРасшифровкиформулы.Количество() > 0 Тогда 
		СтруктураРезультата.Вставить("СписокРасшифровкиформулы", 
			ПоместитьВоВременноеХранилище(СписокРасшифровкиформулы, Новый УникальныйИдентификатор));
	КонецЕсли;
	
	Возврат СтруктураРезультата;
	
КонецФункции

&НаСервере
Процедура ПроверкаКС_1_1(СтруктураРезультата)

	ОбщееЧислоОшибок = 0; // Счетчик учета ошибок.
	ОбщееЧислоБезОшибок = 0; // Счетчик учета проверенных соотношений, не являющиеся ошибками.

	СтруктураОшибок = Новый Структура;
	
	ТекстФормулы = "";
	
	СтруктураРаздела3 = СтруктураРеквизитовФормы.мДанныеОтчета.ПолеТабличногоДокументаРаздел3;
	
	// Добавляем расшифровку для строки 060.
	ОкрП000030006003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, СтруктураРаздела3.П000030006003);
	НазваниеПоказателя = "Раздел 3, строка 060";
	РегламентированнаяОтчетность.ЗарегистрироватьПоказательДляРасшифровки(СписокРасшифровкиПоказателей, "П000030006003",
		НазваниеПоказателя, ОкрП000030006003, "", СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка, "Раздел3", Неопределено, ,
		СчетчикФормулДляРасшифровок);
	
	// Добавляем расшифровку для строки 010.
	ОкрП000030001003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, СтруктураРаздела3.П000030001003);
	НазваниеПоказателя = "Раздел 3, строка 010";
	РегламентированнаяОтчетность.ЗарегистрироватьПоказательДляРасшифровки(СписокРасшифровкиПоказателей, "П000030001003",
		НазваниеПоказателя, ОкрП000030001003, "", СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка, "Раздел3", Неопределено, ,
		СчетчикФормулДляРасшифровок);
		
	СуммаНалогаДолжноБытьВсего = ОкрП000030006003;
	СуммаНалогаПоВсемОКАТО = 0;
	
	// Подсчитываем число заполненых ОКАТО
	КоличествоБлоков = 8;
	ВсегоБлоков = 0;
	ТекущийБлок = 0;
	
	НомерСтраницы = 1;
	
	Для каждого Страница Из СтруктураРеквизитовФормы.мДанныеОтчета.Раздел1 Цикл
		
		Для Индекс = 1 По КоличествоБлоков Цикл
			ИмяПоказателяОКАТО = "П000010002003_" + Индекс;
			КодОКАТО = СокрЛП(Страница.Данные[0].Значение[ИмяПоказателяОКАТО]);
			Если НЕ ПустаяСтрока(КодОКАТО) Тогда 
				ВсегоБлоков = ВсегоБлоков + 1;
			КонецЕсли;
		КонецЦикла;
		
		НомерСтраницы = НомерСтраницы + 1;
		
	КонецЦикла;
	
	НомерСтраницы = 1;
	
	Для каждого Страница Из СтруктураРеквизитовФормы.мДанныеОтчета.Раздел1 Цикл
				
		Для Индекс = 1 По 8 Цикл
			
			ОписаниеКС = "Сумма единого налога на вмененный доход, подлежащая уплате за налоговый период (строка 030 Раздел 1) по данному ОКАТО должна быть равна произведению суммы налога, подлежащей уплате (строка 060 Раздела 3) и результата деления суммы строк 100 всех Разделов 2 по данному ОКАТО и налоговой базы, исчисленной по всем ОКАТО (строка 010 Раздела 3)";
			СчетчикФормулДляРасшифровок = СчетчикФормулДляРасшифровок + 1;
			РегламентированнаяОтчетность.ЗарегистрироватьФормулуДляРасшифровки(СписокРасшифровкиФормулы, ОписаниеКС, 
				, СчетчикФормулДляРасшифровок);
			
			ИмяПоказателяОКАТО = "П000010002003_" + Индекс;
			КодОКАТО = СокрЛП(Страница.Данные[0].Значение[ИмяПоказателяОКАТО]);
			Если ПустаяСтрока(КодОКАТО) Тогда 
				Продолжить;
			КонецЕсли;
			
			ТекущийБлок = ТекущийБлок + 1;
			
			НазваниеПоказателяОКАТО = "Раздел 1, строка 020, страница № " + НомерСтраницы;
			РегламентированнаяОтчетность.ЗарегистрироватьПоказательДляРасшифровки(СписокРасшифровкиПоказателей, ИмяПоказателяОКАТО, НазваниеПоказателяОКАТО, КодОКАТО, "", СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка, "Раздел1", Неопределено, НомерСтраницы, СчетчикФормулДляРасшифровок);
			
			// Зарегистрируем левую часть соотношения.
			ИмяПоказателя = "П000010003003_" + Индекс;
			ЛеваяЧасть = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, Страница.Данные[0].Значение[ИмяПоказателя]);
			НазваниеПоказателя = "Раздел 1, строка 030, страница № " + НомерСтраницы;
			РегламентированнаяОтчетность.ЗарегистрироватьПоказательДляРасшифровки(СписокРасшифровкиПоказателей, ИмяПоказателя, НазваниеПоказателя, ЛеваяЧасть, "", СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка, "Раздел1", Неопределено, НомерСтраницы, СчетчикФормулДляРасшифровок);
			
			ЛеваяЧастьСтр = Формат(ЛеваяЧасть, "ЧРД=.;ЧН=0");
			
			// Зарегистрируем правую часть соотношения.
			
			СуммаР2Стр100 = 0;
			
			НомерСтраницыР2 = 1;
			
			Для каждого СтраницаР2 Из СтруктураРеквизитовФормы.мДанныеОтчета.Раздел2 Цикл
				
				НомерСтраницыР2 = НомерСтраницыР2 + 1;
				
				КодОКАТОНаСтранице = СокрЛП(СтраницаР2.Данные[0].Значение["П000020003000"]);
				Если ПустаяСтрока(КодОКАТОНаСтранице) ИЛИ КодОКАТО <> КодОКАТОНаСтранице Тогда 
					Продолжить;
				КонецЕсли;
				
				ЗначениеПоказателя = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, СтраницаР2.Данные[0].Значение.П000020010003);
				СуммаР2Стр100 = СуммаР2Стр100 + ЗначениеПоказателя;
				НазваниеПоказателя = "Раздел 2, строка 100, страница № " + НомерСтраницыР2;
				РегламентированнаяОтчетность.ЗарегистрироватьПоказательДляРасшифровки(СписокРасшифровкиПоказателей, "П000020010003", НазваниеПоказателя, ЗначениеПоказателя, "", СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка, "Раздел2", Неопределено, НомерСтраницыР2, СчетчикФормулДляРасшифровок);
				
				
			КонецЦикла;
			СуммаР2Стр100Стр = Формат(СуммаР2Стр100, "ЧРД=.;ЧН=0");
			
			Если ТекущийБлок = ВсегоБлоков Тогда 
				// Крайний ОКАТО, значит правая часть КС 
				ПраваяЧасть = СуммаНалогаДолжноБытьВсего - СуммаНалогаПоВсемОКАТО;
			Иначе
				// Очередной ОКАТО, вычисляем по формуле КС
				ПраваяЧасть = ?(ОкрП000030001003 = 0, 0, РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, ОкрП000030006003 * СуммаР2Стр100 / ОкрП000030001003));
				СуммаНалогаПоВсемОКАТО = СуммаНалогаПоВсемОКАТО + ПраваяЧасть;
			КонецЕсли;
			
			Если ЛеваяЧасть = ПраваяЧасть Тогда 
				ЭтоОшибка = Ложь;
				ОбщееЧислоБезОшибок = ОбщееЧислоБезОшибок + 1;
			Иначе
				ЭтоОшибка = Истина;
				ОбщееЧислоОшибок = ОбщееЧислоОшибок + 1;
			КонецЕсли;
			
			ПраваяЧастьСтр = Формат(ПраваяЧасть, "ЧРД=.;ЧН=0");
			
			Расшифровка = ЛеваяЧастьСтр + " = " + ОкрП000030006003 + " * " + СуммаР2Стр100Стр + " / "+ ОкрП000030001003
			+ " Итог [" + ПраваяЧастьСтр + "]";
			
			ТекстовоеПредставлениеФормулы = ?(ПустаяСтрока(ТекстФормулы), "", ТекстФормулы + ". ") + ОписаниеКС;
			СтруктураОшибок.Вставить("Описание" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), "Нарушено соотношение показателей. Возможна арифметическая ошибка в декларации.");
			СтруктураОшибок.Вставить("Расшифровка" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), Расшифровка);
			СтруктураОшибок.Вставить("НомерФормулыРасшифровки" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), СчетчикФормулДляРасшифровок);
			СтруктураОшибок.Вставить("ЭтоОшибка" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), ЭтоОшибка);
			СтруктураОшибок.Вставить("ТекстовоеПредставлениеФормулы" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), ТекстовоеПредставлениеФормулы);
			
		КонецЦикла;
		
		НомерСтраницы = НомерСтраницы + 1;
		
	КонецЦикла;
	
	СтруктураРезультата.Вставить("КоличествоНайденныхОшибок", ОбщееЧислоОшибок);
	СтруктураРезультата.Вставить("КоличествоНайденныхБезОшибок", ОбщееЧислоБезОшибок);
	СтруктураРезультата.Вставить("СтруктураОшибок", СтруктураОшибок);
	
КонецПроцедуры

&НаСервере
Процедура ПроверкаКС_1_2(СтруктураРезультата)

	ОбщееЧислоОшибок = СтруктураРезультата.КоличествоНайденныхОшибок; // Счетчик учета ошибок.
	ОбщееЧислоБезОшибок = СтруктураРезультата.КоличествоНайденныхБезОшибок; // Счетчик учета проверенных соотношений, не являющиеся ошибками.
	СтруктураОшибок = СтруктураРезультата.СтруктураОшибок;
	
	ИмяРаздела = "Раздел2";
	НазваниеСписка = "Списки2012Кв1";
	НазваниеОбласти = "ВидыУслуг";
	ТекстПроверяемоеСоотношение = "Коды оказываемых услуг по ОКУН (строка 015 Раздела 2) должны соответствовать кодам из Справочника ""Коды услуг ОКУН, в отношении которых может применяться система налогообложения в виде ЕНВД.""";
	ТекстВЗаголовкеКРасшифровке = "Коды оказываемых услуг по ОКУН";
	ПустоеЗначениеЯвляетсяОшибкой = "0";
	
	ВозможныеЗначения = ПолучитьВозможныеЗначения(НазваниеСписка, НазваниеОбласти);

	НомерСтраницы = 1;
	
	// РАЗДЕЛ МНОГОСТРАНИЧНЫЙ
	Для каждого Страница Из СтруктураРеквизитовФормы.мДанныеОтчета[ИмяРаздела] Цикл
		// Регистрируем формулу для каждого экземпляра листа.
		СчетчикФормулДляРасшифровок = СчетчикФормулДляРасшифровок + 1;
		РегламентированнаяОтчетность.ЗарегистрироватьФормулуДляРасшифровки(СписокРасшифровкиФормулы, ТекстПроверяемоеСоотношение,
			, СчетчикФормулДляРасшифровок);
			
		КоличествоСтрокМнЧ = 6;
		КоличествоГраф = 6;
		Показатель = "П00002000150";
		Для Графа = 1 По КоличествоГраф Цикл
			Для Инд = 1 По КоличествоСтрокМнЧ Цикл
				ИндГрафы = Формат(Графа, "ЧГ=0");
				ИндСтр = Формат(Инд, "ЧГ=0");
				Значение = СокрЛП(Страница.Данные[0].Значение[Показатель + Графа + "_" + ИндСтр]);
				Если ПустаяСтрока(Значение) Тогда
					Продолжить;
				КонецЕсли;
				
				СчетчикФормулДляРасшифровок = СчетчикФормулДляРасшифровок + 1;
				РегламентированнаяОтчетность.ЗарегистрироватьФормулуДляРасшифровки(СписокРасшифровкиФормулы, ТекстПроверяемоеСоотношение,
					, СчетчикФормулДляРасшифровок);
				
				ПоказательДляРасш = Показатель + ИндГрафы + "_" + ИндСтр;
				ТекстВЗаголовкеКРасшифровке1 = ТекстВЗаголовкеКРасшифровке + ", страница № " + НомерСтраницы + ", строка № " + Строка(ИндСтр) + ", графа № " + Строка(ИндГрафы);
				ОбработатьРезультатПроверкиВСписке(СписокРасшифровкиПоказателей, ПоказательДляРасш, ТекстВЗаголовкеКРасшифровке1,
					Значение, СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка, ИмяРаздела, ВозможныеЗначения, ОбщееЧислоОшибок,
					ОбщееЧислоБЕЗОшибок, СтруктураОшибок, ТекстПроверяемоеСоотношение, ПустоеЗначениеЯвляетсяОшибкой, НомерСтраницы,
					СчетчикФормулДляРасшифровок);
				
			КонецЦикла;
		КонецЦикла;
		
		НомерСтраницы = НомерСтраницы + 1;
		
	КонецЦикла;
	
	Если ОбщееЧислоОшибок + ОбщееЧислоБезОшибок > 0 Тогда
		СтруктураРезультата.Вставить("КоличествоНайденныхОшибок", ОбщееЧислоОшибок);
		СтруктураРезультата.Вставить("КоличествоНайденныхБезОшибок", ОбщееЧислоБезОшибок);
		СтруктураРезультата.Вставить("СтруктураОшибок", СтруктураОшибок);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПроверкаКС_1_3(СтруктураРезультата)

	ОбщееЧислоОшибок = СтруктураРезультата.КоличествоНайденныхОшибок; // Счетчик учета ошибок.
	ОбщееЧислоБезОшибок = СтруктураРезультата.КоличествоНайденныхБезОшибок; // Счетчик учета проверенных соотношений, не являющиеся ошибками.
	СтруктураОшибок = СтруктураРезультата.СтруктураОшибок;
	
	ИмяРаздела = "Раздел2";
	НазваниеСписка = "Списки2012Кв1";
	НазваниеОбласти = "КодыВидовДеятельности";
	ТекстПроверяемоеСоотношение = "Значение базовой доходности на единицу физического показателя (строка 040 Раздела 2) должно соответствовать значению из Справочника ""Коды видов предпринимательской деятельности и значения базовой доходности на единицу физического показателя""";
	ТекстВЗаголовкеКРасшифровке = "Значение базовой доходности на единицу физического показателя";
	ПустоеЗначениеЯвляетсяОшибкой = "0";
		
	ВозможныеЗначения = ПолучитьВозможныеЗначения(НазваниеСписка, НазваниеОбласти);

	НомерСтраницы = 1;
	
	// РАЗДЕЛ МНОГОСТРАНИЧНЫЙ
	Для каждого Страница Из СтруктураРеквизитовФормы.мДанныеОтчета[ИмяРаздела] Цикл
		
		// Регистрируем формулу для каждого экземпляра листа.
		СчетчикФормулДляРасшифровок = СчетчикФормулДляРасшифровок + 1;
		РегламентированнаяОтчетность.ЗарегистрироватьФормулуДляРасшифровки(СписокРасшифровкиФормулы, ТекстПроверяемоеСоотношение, 
			, СчетчикФормулДляРасшифровок);
		
		// Код вида предпринимательской деятельности (код стр. 010)
		Показатель = "П000020001000";
		КодСтр010 = СокрЛП(Страница.Данные[0].Значение[Показатель]);
		
		СчетчикФормулДляРасшифровок = СчетчикФормулДляРасшифровок + 1;
		РегламентированнаяОтчетность.ЗарегистрироватьФормулуДляРасшифровки(СписокРасшифровкиФормулы, ТекстПроверяемоеСоотношение, 
			, СчетчикФормулДляРасшифровок);
			
		ПоказательДляРасш = "П000020004003";
		ТекстВЗаголовкеКРасшифровке1 = "Раздел 2, строка 040, страница № " + НомерСтраницы;
		Значение = Новый Структура("Код, Значение", КодСтр010, Страница.Данные[0].Значение[ПоказательДляРасш]);
		
		ОбработатьРезультатПроверкиВСписке_1_3(СписокРасшифровкиПоказателей, ПоказательДляРасш, ТекстВЗаголовкеКРасшифровке1,
			Значение, СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка, ИмяРаздела, ВозможныеЗначения, ОбщееЧислоОшибок,
			ОбщееЧислоБЕЗОшибок, СтруктураОшибок, ТекстПроверяемоеСоотношение, ПустоеЗначениеЯвляетсяОшибкой, НомерСтраницы,
			СчетчикФормулДляРасшифровок);
		
		НомерСтраницы = НомерСтраницы + 1;
		
	КонецЦикла;
    	
	Если ОбщееЧислоОшибок + ОбщееЧислоБезОшибок > 0 Тогда
		СтруктураРезультата.Вставить("КоличествоНайденныхОшибок", ОбщееЧислоОшибок);
		СтруктураРезультата.Вставить("КоличествоНайденныхБезОшибок", ОбщееЧислоБезОшибок);
		СтруктураРезультата.Вставить("СтруктураОшибок", СтруктураОшибок);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПроверкаКС_1_4(СтруктураРезультата)

	ОбщееЧислоОшибок = СтруктураРезультата.КоличествоНайденныхОшибок; // Счетчик учета ошибок.
	ОбщееЧислоБезОшибок = СтруктураРезультата.КоличествоНайденныхБезОшибок; // Счетчик учета проверенных соотношений, не являющиеся ошибками.
	СтруктураОшибок = СтруктураРезультата.СтруктураОшибок;
	
	ТекстФормулы = "";
	
	НомерСтраницы = 1;
	
	Для каждого Страница Из СтруктураРеквизитовФормы.мДанныеОтчета.Раздел2 Цикл
				
		ОписаниеКС = "Сумма налоговой базы по ЕНВД (строка 100 Раздела 2) должна быть равна произведению базовой доходности с учетом корректирующих коэффициентов и суммы величин физических показателей за отчетный период (строка 040 * строка 080 * строка 090 * (строка 050 + строка 060 + строка 070)) по одноименному ОКАТО (строка 030)";
		
		СчетчикФормулДляРасшифровок = СчетчикФормулДляРасшифровок + 1;
		РегламентированнаяОтчетность.ЗарегистрироватьФормулуДляРасшифровки(СписокРасшифровкиФормулы, ОписаниеКС, 
			, СчетчикФормулДляРасшифровок);
		
		// Зарегистрируем левую часть соотношения.
		СуммаР2Стр100 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, Страница.Данные[0].Значение.П000020010003);
		НазваниеПоказателя = "Раздел 2, строка 100, страница № " + НомерСтраницы;
		РегламентированнаяОтчетность.ЗарегистрироватьПоказательДляРасшифровки(СписокРасшифровкиПоказателей, "П000020010003",
			НазваниеПоказателя, СуммаР2Стр100, "", СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка, "Раздел2", Неопределено,
			НомерСтраницы, СчетчикФормулДляРасшифровок);
		СуммаР2Стр100Стр = Формат(СуммаР2Стр100, "ЧРД=.;ЧН=0");
		
		// Зарегистрируем правую часть соотношения.
		СуммаР2Стр040 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, Страница.Данные[0].Значение.П000020004003);
		НазваниеПоказателя = "Раздел 2, строка 040, страница № " + НомерСтраницы;
		РегламентированнаяОтчетность.ЗарегистрироватьПоказательДляРасшифровки(СписокРасшифровкиПоказателей, "П000020004003",
			НазваниеПоказателя, СуммаР2Стр040, "", СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка, "Раздел2", Неопределено,
			НомерСтраницы, СчетчикФормулДляРасшифровок);
		СуммаР2Стр040Стр = Формат(СуммаР2Стр040, "ЧРД=.;ЧН=0");
		
		СуммаР2Стр080 = Страница.Данные[0].Значение.П000020008003; // коэффициенты не округляем
		НазваниеПоказателя = "Раздел 2, строка 080, страница № " + НомерСтраницы;
		РегламентированнаяОтчетность.ЗарегистрироватьПоказательДляРасшифровки(СписокРасшифровкиПоказателей, "П000020008003",
			НазваниеПоказателя, СуммаР2Стр080, "", СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка, "Раздел2", Неопределено,
			НомерСтраницы, СчетчикФормулДляРасшифровок);
		СуммаР2Стр080Стр = Формат(СуммаР2Стр080, "ЧРД=.;ЧН=0");
		
		СуммаР2Стр090 = Страница.Данные[0].Значение.П000020009003; // коэффициенты не округляем
		НазваниеПоказателя = "Раздел 2, строка 090, страница № " + НомерСтраницы;
		РегламентированнаяОтчетность.ЗарегистрироватьПоказательДляРасшифровки(СписокРасшифровкиПоказателей, "П000020009003",
			НазваниеПоказателя, СуммаР2Стр090, "", СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка, "Раздел2", Неопределено,
			НомерСтраницы, СчетчикФормулДляРасшифровок);
		СуммаР2Стр090Стр = Формат(СуммаР2Стр090, "ЧРД=.;ЧН=0");
		
		СуммаР2Стр050 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, Страница.Данные[0].Значение.П000020005003);
		НазваниеПоказателя = "Раздел 2, строка 050, страница № " + НомерСтраницы;
		РегламентированнаяОтчетность.ЗарегистрироватьПоказательДляРасшифровки(СписокРасшифровкиПоказателей, "П000020005003",
			НазваниеПоказателя, СуммаР2Стр050, "", СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка, "Раздел2", Неопределено,
			НомерСтраницы, СчетчикФормулДляРасшифровок);
		СуммаР2Стр050Стр = Формат(СуммаР2Стр050, "ЧРД=.;ЧН=0");
		
		СуммаР2Стр060 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, Страница.Данные[0].Значение.П000020006003);
		НазваниеПоказателя = "Раздел 2, строка 060, страница № " + НомерСтраницы;
		РегламентированнаяОтчетность.ЗарегистрироватьПоказательДляРасшифровки(СписокРасшифровкиПоказателей, "П000020006003",
			НазваниеПоказателя, СуммаР2Стр060, "", СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка, "Раздел2", Неопределено,
			НомерСтраницы, СчетчикФормулДляРасшифровок);
		СуммаР2Стр060Стр = Формат(СуммаР2Стр060, "ЧРД=.;ЧН=0");
		
		СуммаР2Стр070 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, Страница.Данные[0].Значение.П000020007003);
		НазваниеПоказателя = "Раздел 2, строка 070, страница № " + НомерСтраницы;
		РегламентированнаяОтчетность.ЗарегистрироватьПоказательДляРасшифровки(СписокРасшифровкиПоказателей, "П000020007003",
			НазваниеПоказателя, СуммаР2Стр070, "", СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка, "Раздел2", Неопределено,
			НомерСтраницы, СчетчикФормулДляРасшифровок);
		СуммаР2Стр070Стр = Формат(СуммаР2Стр070, "ЧРД=.;ЧН=0");
		
		ЛеваяЧасть = СуммаР2Стр100;
		ЛеваяЧастьСтр = СуммаР2Стр100Стр;
		
		ПраваяЧасть = (СуммаР2Стр040 * СуммаР2Стр080 * СуммаР2Стр090) * (СуммаР2Стр050 + СуммаР2Стр060 + СуммаР2Стр070);
		ПраваяЧасть = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, ПраваяЧасть);
		ПраваяЧастьСтр = Формат(ПраваяЧасть, "ЧРД=.;ЧН=0");
		
		Если ЛеваяЧасть = ПраваяЧасть Тогда 
			ЭтоОшибка = Ложь;
			ОбщееЧислоБезОшибок = ОбщееЧислоБезОшибок + 1;
		Иначе
			ЭтоОшибка = Истина;
			ОбщееЧислоОшибок = ОбщееЧислоОшибок + 1;
		КонецЕсли;
		
		Расшифровка = ЛеваяЧастьСтр + " = " + СуммаР2Стр040Стр + " * " + СуммаР2Стр080Стр + " * "+ СуммаР2Стр090Стр + " * ("
		+ СуммаР2Стр050Стр + " + " + СуммаР2Стр060Стр + " + " + СуммаР2Стр070Стр + ") Итог [" + ПраваяЧастьСтр + "]";
		
		ТекстОписания = "Неправильно исчислена налоговая база за налоговый период.";
		Если ЭтоОшибка Тогда 
			ТекстОписания = ТекстОписания
			+ Символы.ПС 
			+ "Исключение: Данное контрольное соотношение не применяется, если в течение квартала были произведены постановка или снятие с учета в налоговом органе."
		КонецЕсли;
			
		ТекстовоеПредставлениеФормулы = ?(ПустаяСтрока(ТекстФормулы), "", ТекстФормулы + ". ") + ОписаниеКС;
		СтруктураОшибок.Вставить("Описание" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), ТекстОписания);
		СтруктураОшибок.Вставить("Нарушение" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), "п.п. 2, 4 ст.346.29 НК РФ");
		СтруктураОшибок.Вставить("Расшифровка" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), Расшифровка);
		СтруктураОшибок.Вставить("НомерФормулыРасшифровки" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), СчетчикФормулДляРасшифровок);
		СтруктураОшибок.Вставить("ЭтоОшибка" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), ЭтоОшибка);
		СтруктураОшибок.Вставить("ТекстовоеПредставлениеФормулы" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), ТекстовоеПредставлениеФормулы);
		
		НомерСтраницы = НомерСтраницы + 1;
		
	КонецЦикла;
	
	Если ОбщееЧислоОшибок + ОбщееЧислоБезОшибок > 0 Тогда
		СтруктураРезультата.Вставить("КоличествоНайденныхОшибок", ОбщееЧислоОшибок);
		СтруктураРезультата.Вставить("КоличествоНайденныхБезОшибок", ОбщееЧислоБезОшибок);
		СтруктураРезультата.Вставить("СтруктураОшибок", СтруктураОшибок);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПроверкаКС_1_5(СтруктураРезультата)
	
	ОбщееЧислоОшибок = СтруктураРезультата.КоличествоНайденныхОшибок; // Счетчик учета ошибок.
	ОбщееЧислоБезОшибок = СтруктураРезультата.КоличествоНайденныхБезОшибок; // Счетчик учета проверенных соотношений, не являющиеся ошибками.
	СтруктураОшибок = СтруктураРезультата.СтруктураОшибок;
	
	ТекстФормулы = "";
	
	НомерСтраницы = 1;
	
	Для каждого Страница Из СтруктураРеквизитовФормы.мДанныеОтчета.Раздел2 Цикл
				
		ОписаниеКС = "Сумма исчисленного единого налога на вмененный доход (строка 110 Раздела 2) должна быть равна произведению налоговой базы (строка 100 Раздела 2) и налоговой ставки 15% по одноименному ОКАТО.";
		СчетчикФормулДляРасшифровок = СчетчикФормулДляРасшифровок + 1;
		РегламентированнаяОтчетность.ЗарегистрироватьФормулуДляРасшифровки(СписокРасшифровкиФормулы, ОписаниеКС, 
			, СчетчикФормулДляРасшифровок);
		
		// Зарегистрируем левую часть соотношения.
		СуммаР2Стр110 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, Страница.Данные[0].Значение.П000020011003);
		НазваниеПоказателя = "Раздел 2, строка 110, страница № " + НомерСтраницы;
		РегламентированнаяОтчетность.ЗарегистрироватьПоказательДляРасшифровки(СписокРасшифровкиПоказателей, "П000020011003",
			НазваниеПоказателя, СуммаР2Стр110, "", СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка, "Раздел2", Неопределено,
			НомерСтраницы, СчетчикФормулДляРасшифровок);
		СуммаР2Стр110Стр = Формат(СуммаР2Стр110, "ЧРД=.;ЧН=0");
		
		// Зарегистрируем правую часть соотношения.
		СуммаР2Стр100 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, Страница.Данные[0].Значение.П000020010003);
		НазваниеПоказателя = "Раздел 2, строка 100, страница № " + НомерСтраницы;
		РегламентированнаяОтчетность.ЗарегистрироватьПоказательДляРасшифровки(СписокРасшифровкиПоказателей, "П000020010003",
			НазваниеПоказателя, СуммаР2Стр100, "", СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка, "Раздел2", Неопределено,
			НомерСтраницы, СчетчикФормулДляРасшифровок);
		СуммаР2Стр100Стр = Формат(СуммаР2Стр100, "ЧРД=.;ЧН=0");
		
		ЛеваяЧасть = СуммаР2Стр110;
		ЛеваяЧастьСтр = СуммаР2Стр110Стр;
		
		ПраваяЧасть = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, 15 * СуммаР2Стр100 / 100);
		ПраваяЧастьСтр = Формат(ПраваяЧасть, "ЧРД=.;ЧН=0");
		
		Если ЛеваяЧасть = ПраваяЧасть Тогда 
			ЭтоОшибка = Ложь;
			ОбщееЧислоБезОшибок = ОбщееЧислоБезОшибок + 1;
		Иначе
			ЭтоОшибка = Истина;
			ОбщееЧислоОшибок = ОбщееЧислоОшибок + 1;
		КонецЕсли;
		
		Расшифровка = ЛеваяЧастьСтр + " = 15 * " + СуммаР2Стр100Стр + " / 100 Итог [" + ПраваяЧастьСтр + "]";
		
		ТекстовоеПредставлениеФормулы = ?(ПустаяСтрока(ТекстФормулы), "", ТекстФормулы + ". ") + ОписаниеКС;
		СтруктураОшибок.Вставить("Описание" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), "Неправильное исчисление суммы ЕНВД за налоговый период.");
		СтруктураОшибок.Вставить("Нарушение" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), "п.п. 2, 4 ст.346.29 и ст.246,31 НК РФ");
		СтруктураОшибок.Вставить("Расшифровка" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), Расшифровка);
		СтруктураОшибок.Вставить("НомерФормулыРасшифровки" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), СчетчикФормулДляРасшифровок);
		СтруктураОшибок.Вставить("ЭтоОшибка" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), ЭтоОшибка);
		СтруктураОшибок.Вставить("ТекстовоеПредставлениеФормулы" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), ТекстовоеПредставлениеФормулы);
		
		НомерСтраницы = НомерСтраницы + 1;
		
	КонецЦикла;
	
	Если ОбщееЧислоОшибок + ОбщееЧислоБезОшибок > 0 Тогда
		СтруктураРезультата.Вставить("КоличествоНайденныхОшибок", ОбщееЧислоОшибок);
		СтруктураРезультата.Вставить("КоличествоНайденныхБезОшибок", ОбщееЧислоБезОшибок);
		СтруктураРезультата.Вставить("СтруктураОшибок", СтруктураОшибок);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверкаКС_1_6(СтруктураРезультата)

	ОбщееЧислоОшибок = СтруктураРезультата.КоличествоНайденныхОшибок; // Счетчик учета ошибок.
	ОбщееЧислоБезОшибок = СтруктураРезультата.КоличествоНайденныхБезОшибок; // Счетчик учета проверенных соотношений, не являющиеся ошибками.
	СтруктураОшибок = СтруктураРезультата.СтруктураОшибок;
	
	ТекстФормулы = "";
	
	ОписаниеКС = "Налоговая база, исчисленная по всем ОКАТО (строка 010 Раздел 3) должна быть равна сумме строк 100 всех заполненных Разделов 2.";
	СчетчикФормулДляРасшифровок = СчетчикФормулДляРасшифровок + 1;
	РегламентированнаяОтчетность.ЗарегистрироватьФормулуДляРасшифровки(СписокРасшифровкиФормулы, ОписаниеКС, 
		, СчетчикФормулДляРасшифровок);
		
	// Зарегистрируем левую часть соотношения.
	// Добавляем расшифровку для строки 010.
	СтруктураРаздела3 = СтруктураРеквизитовФормы.мДанныеОтчета.ПолеТабличногоДокументаРаздел3;
	ЗначениеР3Стр010 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, СтруктураРаздела3.П000030001003);
	ЗначениеР3Стр010Стр = Формат(ЗначениеР3Стр010, "ЧРД=.;ЧН=0");
	
	НазваниеПоказателя = "Раздел 3, строка 010";
	РегламентированнаяОтчетность.ЗарегистрироватьПоказательДляРасшифровки(СписокРасшифровкиПоказателей, "П000030001003",
		НазваниеПоказателя, ЗначениеР3Стр010, "", СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка, "Раздел3", Неопределено,
		, СчетчикФормулДляРасшифровок);
	// Зарегистрируем правую часть соотношения.
	СуммаР2Стр100 = 0;
	
	НомерСтраницы = 1;
	
	Для каждого Страница Из СтруктураРеквизитовФормы.мДанныеОтчета.Раздел2 Цикл
		
		ЗначениеПоказателя = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, Страница.Данные[0].Значение.П000020010003);
		СуммаР2Стр100 = СуммаР2Стр100 + ЗначениеПоказателя;
		НазваниеПоказателя = "Раздел 2, строка 100, страница № " + НомерСтраницы;
		РегламентированнаяОтчетность.ЗарегистрироватьПоказательДляРасшифровки(СписокРасшифровкиПоказателей, "П000020010003",
			НазваниеПоказателя, СуммаР2Стр100, "", СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка, "Раздел2", Неопределено,
			Строка(НомерСтраницы), СчетчикФормулДляРасшифровок);
		НомерСтраницы = НомерСтраницы + 1;
		
	КонецЦикла;
	СуммаР2Стр100Стр = Формат(СуммаР2Стр100, "ЧРД=.;ЧН=0");
	
	ЛеваяЧасть = ЗначениеР3Стр010;
	ЛеваяЧастьСтр = ЗначениеР3Стр010Стр;
	
	ПраваяЧасть = СуммаР2Стр100;
	ПраваяЧастьСтр = СуммаР2Стр100Стр;
	
	Если ЛеваяЧасть = ПраваяЧасть Тогда 
		ЭтоОшибка = Ложь;
		ОбщееЧислоБезОшибок = ОбщееЧислоБезОшибок + 1;
	Иначе
		ЭтоОшибка = Истина;
		ОбщееЧислоОшибок = ОбщееЧислоОшибок + 1;
	КонецЕсли;
	
	Расшифровка = ЛеваяЧастьСтр + " = " + ПраваяЧастьСтр;
	
	ТекстовоеПредставлениеФормулы = ?(ПустаяСтрока(ТекстФормулы), "", ТекстФормулы + ". ") + ОписаниеКС;
	СтруктураОшибок.Вставить("Описание" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), "Нарушено соотношение показателей. Возможна арифметическая ошибка в декларации.");
	СтруктураОшибок.Вставить("Расшифровка" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), Расшифровка);
	СтруктураОшибок.Вставить("НомерФормулыРасшифровки" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), СчетчикФормулДляРасшифровок);
	СтруктураОшибок.Вставить("ЭтоОшибка" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), ЭтоОшибка);
	СтруктураОшибок.Вставить("ТекстовоеПредставлениеФормулы" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), ТекстовоеПредставлениеФормулы);
	
	Если ОбщееЧислоОшибок + ОбщееЧислоБезОшибок > 0 Тогда
		СтруктураРезультата.Вставить("КоличествоНайденныхОшибок", ОбщееЧислоОшибок);
		СтруктураРезультата.Вставить("КоличествоНайденныхБезОшибок", ОбщееЧислоБезОшибок);
		СтруктураРезультата.Вставить("СтруктураОшибок", СтруктураОшибок);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПроверкаКС_1_7(СтруктураРезультата)

	ОбщееЧислоОшибок = СтруктураРезультата.КоличествоНайденныхОшибок; // Счетчик учета ошибок.
	ОбщееЧислоБезОшибок = СтруктураРезультата.КоличествоНайденныхБезОшибок; // Счетчик учета проверенных соотношений, не являющиеся ошибками.
	СтруктураОшибок = СтруктураРезультата.СтруктураОшибок;
	
	ТекстФормулы = "";
	
	ОписаниеКС = "Сумма исчисленная единого налога на вмененный доход (строка 020 Раздел 3) должна быть равна сумме строк 110 всех заполненных Разделов 2.";
	СчетчикФормулДляРасшифровок = СчетчикФормулДляРасшифровок + 1;
	РегламентированнаяОтчетность.ЗарегистрироватьФормулуДляРасшифровки(СписокРасшифровкиФормулы, ОписаниеКС, 
		, СчетчикФормулДляРасшифровок);
	
	// Зарегистрируем левую часть соотношения.
	// Добавляем расшифровку для строки 020.
	СтруктураРаздела3 = СтруктураРеквизитовФормы.мДанныеОтчета.ПолеТабличногоДокументаРаздел3;
	ЗначениеР3Стр020 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, СтруктураРаздела3.П000030002003);
	ЗначениеР3Стр020Стр = Формат(ЗначениеР3Стр020, "ЧРД=.;ЧН=0");
	НазваниеПоказателя = "Раздел 3, строка 020";
	РегламентированнаяОтчетность.ЗарегистрироватьПоказательДляРасшифровки(СписокРасшифровкиПоказателей, "П000030002003", НазваниеПоказателя, ЗначениеР3Стр020, "", СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка, "Раздел3", Неопределено, , СчетчикФормулДляРасшифровок);
	
	// Зарегистрируем правую часть соотношения.
	СуммаР2Стр110 = 0;
	
	НомерСтраницы = 1;
	Для каждого Страница Из СтруктураРеквизитовФормы.мДанныеОтчета.Раздел2 Цикл
		
		НомерСтраницы = НомерСтраницы + 1;
		ЗначениеПоказателя = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, Страница.Данные[0].Значение.П000020011003);
		СуммаР2Стр110 = СуммаР2Стр110 + ЗначениеПоказателя;
		НазваниеПоказателя = "Раздел 2, строка 110, страница № " + НомерСтраницы;
		РегламентированнаяОтчетность.ЗарегистрироватьПоказательДляРасшифровки(СписокРасшифровкиПоказателей, "П000020011003", НазваниеПоказателя, СуммаР2Стр110, "", СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка, "Раздел2", Неопределено, НомерСтраницы, СчетчикФормулДляРасшифровок);
		
	КонецЦикла;
	СуммаР2Стр110Стр = Формат(СуммаР2Стр110, "ЧРД=.;ЧН=0");
	
	ЛеваяЧасть = ЗначениеР3Стр020;
	ЛеваяЧастьСтр = ЗначениеР3Стр020Стр;
	
	ПраваяЧасть = СуммаР2Стр110;
	ПраваяЧастьСтр = СуммаР2Стр110Стр;
	
	Если ЛеваяЧасть = ПраваяЧасть Тогда 
		ЭтоОшибка = Ложь;
		ОбщееЧислоБезОшибок = ОбщееЧислоБезОшибок + 1;
	Иначе
		ЭтоОшибка = Истина;
		ОбщееЧислоОшибок = ОбщееЧислоОшибок + 1;
	КонецЕсли;
	
	Расшифровка = ЛеваяЧастьСтр + " = " + ПраваяЧастьСтр;
	
	ТекстовоеПредставлениеФормулы = ?(ПустаяСтрока(ТекстФормулы), "", ТекстФормулы + ". ") + ОписаниеКС;
	СтруктураОшибок.Вставить("Описание" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), "Нарушено соотношение показателей. Возможна арифметическая ошибка в декларации.");
	СтруктураОшибок.Вставить("Расшифровка" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), Расшифровка);
	СтруктураОшибок.Вставить("НомерФормулыРасшифровки" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), СчетчикФормулДляРасшифровок);
	СтруктураОшибок.Вставить("ЭтоОшибка" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), ЭтоОшибка);
	СтруктураОшибок.Вставить("ТекстовоеПредставлениеФормулы" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), ТекстовоеПредставлениеФормулы);

	Если ОбщееЧислоОшибок + ОбщееЧислоБезОшибок > 0 Тогда
		СтруктураРезультата.Вставить("КоличествоНайденныхОшибок", ОбщееЧислоОшибок);
		СтруктураРезультата.Вставить("КоличествоНайденныхБезОшибок", ОбщееЧислоБезОшибок);
		СтруктураРезультата.Вставить("СтруктураОшибок", СтруктураОшибок);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПроверкаКС_1_8(СтруктураРезультата)

	ОбщееЧислоОшибок = СтруктураРезультата.КоличествоНайденныхОшибок; // Счетчик учета ошибок.
	ОбщееЧислоБезОшибок = СтруктураРезультата.КоличествоНайденныхБезОшибок; // Счетчик учета проверенных соотношений, не являющиеся ошибками.
	СтруктураОшибок = СтруктураРезультата.СтруктураОшибок;
	
	ТекстФормулы = "";
	
	ОписаниеКС = "Общая сумма страховых взносов и пособий по временной нетрудоспособности (строка 050 Раздела 3) должна быть равна сумме строк 030 и 040 Раздела 3 при условии, что сумма строк 030 и 040 Раздела 3 меньше либо равна половине величины, отраженной в строке 020 Раздела 3";
	СчетчикФормулДляРасшифровок = СчетчикФормулДляРасшифровок + 1;
	РегламентированнаяОтчетность.ЗарегистрироватьФормулуДляРасшифровки(СписокРасшифровкиФормулы, ОписаниеКС, 
		, СчетчикФормулДляРасшифровок);
	
	
	СтруктураРаздела3 = СтруктураРеквизитовФормы.мДанныеОтчета.ПолеТабличногоДокументаРаздел3;
	
	// Зарегистрируем левую часть условия.
	// Добавляем расшифровку для строки 030.
	ЗначениеР3Стр030 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, СтруктураРаздела3.П000030003003);
	ЗначениеР3Стр030Стр = Формат(ЗначениеР3Стр030, "ЧРД=.;ЧН=0");
	НазваниеПоказателя = "Раздел 3, строка 030";
	РегламентированнаяОтчетность.ЗарегистрироватьПоказательДляРасшифровки(СписокРасшифровкиПоказателей, "П000030003003", НазваниеПоказателя, ЗначениеР3Стр030, "", СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка, "Раздел3", Неопределено, , СчетчикФормулДляРасшифровок);
	
	// Добавляем расшифровку для строки 040.
	ЗначениеР3Стр040 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, СтруктураРаздела3.П000030004003);
	ЗначениеР3Стр040Стр = Формат(ЗначениеР3Стр040, "ЧРД=.;ЧН=0");
	НазваниеПоказателя = "Раздел 3, строка 040";
	РегламентированнаяОтчетность.ЗарегистрироватьПоказательДляРасшифровки(СписокРасшифровкиПоказателей, "П000030004003", НазваниеПоказателя, ЗначениеР3Стр040, "", СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка, "Раздел3", Неопределено, , СчетчикФормулДляРасшифровок);
		
	// Зарегистрируем правую часть условия.
	// Добавляем расшифровку для строки 020.
	ЗначениеР3Стр020 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, СтруктураРаздела3.П000030002003);
	ЗначениеР3Стр020Стр = Формат(ЗначениеР3Стр020, "ЧРД=.;ЧН=0");
	НазваниеПоказателя = "Раздел 3, строка 020";
	РегламентированнаяОтчетность.ЗарегистрироватьПоказательДляРасшифровки(СписокРасшифровкиПоказателей, "П000030002003", НазваниеПоказателя, ЗначениеР3Стр020, "", СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка, "Раздел3", Неопределено, , СчетчикФормулДляРасшифровок);
		
	ЛеваяЧастьУсловия = ЗначениеР3Стр030 + ЗначениеР3Стр040;
	ЛеваяЧастьУсловияСтр = Формат(ЛеваяЧастьУсловия, "ЧРД=.;ЧН=0");
	
	ПраваяЧастьУсловия = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, 50 * ЗначениеР3Стр020 / 100);
	ПраваяЧастьУсловияСтр = Формат(ПраваяЧастьУсловия, "ЧРД=.;ЧН=0");;
	
	// Зарегистрируем левую часть соотношения.
	// Добавляем расшифровку для строки 050.
	ЗначениеР3Стр050 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, СтруктураРаздела3.П000030005003);
	ЗначениеР3Стр050Стр = Формат(ЗначениеР3Стр050, "ЧРД=.;ЧН=0");
	НазваниеПоказателя = "Раздел 3, строка 050";
	РегламентированнаяОтчетность.ЗарегистрироватьПоказательДляРасшифровки(СписокРасшифровкиПоказателей, "П000030005003", НазваниеПоказателя, ЗначениеР3Стр050, "", СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка, "Раздел3", Неопределено, , СчетчикФормулДляРасшифровок);
	
	// Зарегистрируем правую часть соотношения.
	// Добавляем расшифровку для строки 030.
	ЗначениеР3Стр030 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, СтруктураРаздела3.П000030003003);
	ЗначениеР3Стр030Стр = Формат(ЗначениеР3Стр030, "ЧРД=.;ЧН=0");
	НазваниеПоказателя = "Раздел 3, строка 030";
	РегламентированнаяОтчетность.ЗарегистрироватьПоказательДляРасшифровки(СписокРасшифровкиПоказателей, "П000030003003", НазваниеПоказателя, ЗначениеР3Стр030, "", СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка, "Раздел3", Неопределено, , СчетчикФормулДляРасшифровок);
	
	// Добавляем расшифровку для строки 040.
	ЗначениеР3Стр040 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, СтруктураРаздела3.П000030004003);
	ЗначениеР3Стр040Стр = Формат(ЗначениеР3Стр040, "ЧРД=.;ЧН=0");
	НазваниеПоказателя = "Раздел 3, строка 040";
	РегламентированнаяОтчетность.ЗарегистрироватьПоказательДляРасшифровки(СписокРасшифровкиПоказателей, "П000030004003", НазваниеПоказателя, ЗначениеР3Стр040, "", СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка, "Раздел3", Неопределено, , СчетчикФормулДляРасшифровок);
	
	ЛеваяЧасть = ЗначениеР3Стр050;
	ЛеваяЧастьСтр = ЗначениеР3Стр050Стр;
	
	ПраваяЧасть = ЗначениеР3Стр030 + ЗначениеР3Стр040;
	ПраваяЧастьСтр = Формат(ПраваяЧасть, "ЧРД=.;ЧН=0");
	
	Если НЕ (ЛеваяЧастьУсловия <= ПраваяЧастьУсловия) 
		ИЛИ ((ЛеваяЧастьУсловия <= ПраваяЧастьУсловия) И (ЛеваяЧасть = ПраваяЧасть)) Тогда 
		ЭтоОшибка = Ложь;
		ОбщееЧислоБезОшибок = ОбщееЧислоБезОшибок + 1;
	Иначе
		ЭтоОшибка = Истина;
		ОбщееЧислоОшибок = ОбщееЧислоОшибок + 1;
	КонецЕсли;
	
	Расшифровка = ЛеваяЧастьСтр + " = " + ПраваяЧастьСтр + ", когда (" + ЗначениеР3Стр030Стр + " + " + ЗначениеР3Стр040Стр
	+ ") Итог [" + ЛеваяЧастьУсловияСтр + "] <= (50 * " + ЗначениеР3Стр020Стр + " / 100) Итог [" + ПраваяЧастьУсловияСтр + "]";
	
	ТекстОписания = "Необоснованное уменьшение суммы ЕНВД, исчисленной за налоговый период.";
	Если ЭтоОшибка Тогда 
		ТекстОписания = ТекстОписания
		+ Символы.ПС 
		+ "Исключение: Данное контрольное соотношение не распространяется на Индивидуальных предпринимателей, которые не используют труд наемных работников."
	КонецЕсли;
	
	ТекстовоеПредставлениеФормулы = ?(ПустаяСтрока(ТекстФормулы), "", ТекстФормулы + ". ") + ОписаниеКС;
	СтруктураОшибок.Вставить("Описание" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), ТекстОписания);
	СтруктураОшибок.Вставить("Нарушение" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), "п. 2 ст.346.32 НК РФ");
	СтруктураОшибок.Вставить("Расшифровка" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), Расшифровка);
	СтруктураОшибок.Вставить("НомерФормулыРасшифровки" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), СчетчикФормулДляРасшифровок);
	СтруктураОшибок.Вставить("ЭтоОшибка" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), ЭтоОшибка);
	СтруктураОшибок.Вставить("ТекстовоеПредставлениеФормулы" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), ТекстовоеПредставлениеФормулы);
	
	Если ОбщееЧислоОшибок + ОбщееЧислоБезОшибок > 0 Тогда
		СтруктураРезультата.Вставить("КоличествоНайденныхОшибок", ОбщееЧислоОшибок);
		СтруктураРезультата.Вставить("КоличествоНайденныхБезОшибок", ОбщееЧислоБезОшибок);
		СтруктураРезультата.Вставить("СтруктураОшибок", СтруктураОшибок);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПроверкаКС_1_9(СтруктураРезультата)

	ОбщееЧислоОшибок = СтруктураРезультата.КоличествоНайденныхОшибок; // Счетчик учета ошибок.
	ОбщееЧислоБезОшибок = СтруктураРезультата.КоличествоНайденныхБезОшибок; // Счетчик учета проверенных соотношений, не являющиеся ошибками.
	СтруктураОшибок = СтруктураРезультата.СтруктураОшибок;
	
	ТекстФормулы = "";
	
	ОписаниеКС = "Общая сумма страховых взносов и пособий по временной нетрудоспособности (строка 050 Раздела 3) должна быть равна половине величины, отраженной в строке 020 Раздела 3, если сумма строк 030 и 040 Раздела 3 больше половины величины, отраженной в строке 020 Раздела 3";
	СчетчикФормулДляРасшифровок = СчетчикФормулДляРасшифровок + 1;
	РегламентированнаяОтчетность.ЗарегистрироватьФормулуДляРасшифровки(СписокРасшифровкиФормулы, ОписаниеКС, 
		, СчетчикФормулДляРасшифровок);
	
	СтруктураРаздела3 = СтруктураРеквизитовФормы.мДанныеОтчета.ПолеТабличногоДокументаРаздел3;
	
	// Зарегистрируем левую часть условия.
	// Добавляем расшифровку для строки 030.
	ЗначениеР3Стр030 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, СтруктураРаздела3.П000030003003);
	ЗначениеР3Стр030Стр = Формат(ЗначениеР3Стр030, "ЧРД=.;ЧН=0");
	НазваниеПоказателя = "Раздел 3, строка 030";
	РегламентированнаяОтчетность.ЗарегистрироватьПоказательДляРасшифровки(СписокРасшифровкиПоказателей, "П000030003003", НазваниеПоказателя, ЗначениеР3Стр030, "", СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка, "Раздел3", Неопределено, , СчетчикФормулДляРасшифровок);
	
	// Добавляем расшифровку для строки 040.
	ЗначениеР3Стр040 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, СтруктураРаздела3.П000030004003);
	ЗначениеР3Стр040Стр = Формат(ЗначениеР3Стр040, "ЧРД=.;ЧН=0");
	НазваниеПоказателя = "Раздел 3, строка 040";
	РегламентированнаяОтчетность.ЗарегистрироватьПоказательДляРасшифровки(СписокРасшифровкиПоказателей, "П000030004003", НазваниеПоказателя, ЗначениеР3Стр040, "", СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка, "Раздел3", Неопределено, , СчетчикФормулДляРасшифровок);
	
	// Зарегистрируем правую часть условия.
	// Добавляем расшифровку для строки 020.
	ЗначениеР3Стр020 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, СтруктураРаздела3.П000030002003);
	ЗначениеР3Стр020Стр = Формат(ЗначениеР3Стр020, "ЧРД=.;ЧН=0");
	НазваниеПоказателя = "Раздел 3, строка 020";
	РегламентированнаяОтчетность.ЗарегистрироватьПоказательДляРасшифровки(СписокРасшифровкиПоказателей, "П000030002003", НазваниеПоказателя, ЗначениеР3Стр020, "", СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка, "Раздел3", Неопределено, , СчетчикФормулДляРасшифровок);
	
	ЛеваяЧастьУсловия = ЗначениеР3Стр030 + ЗначениеР3Стр040;
	ЛеваяЧастьУсловияСтр = Формат(ЛеваяЧастьУсловия, "ЧРД=.;ЧН=0");
	
	// Расчет правой части условия (и соотношения) аналогично расчету строки 050 раздела 3 
	ПраваяЧастьУсловия = Мин(ЗначениеР3Стр030 + ЗначениеР3Стр040, Цел(0.5 * ЗначениеР3Стр020));
	ПраваяЧастьУсловияСтр = Формат(ПраваяЧастьУсловия, "ЧРД=.;ЧН=0");;
	
	// Зарегистрируем левую часть соотношения.
	// Добавляем расшифровку для строки 050.
	ЗначениеР3Стр050 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, СтруктураРаздела3.П000030005003);
	ЗначениеР3Стр050Стр = Формат(ЗначениеР3Стр050, "ЧРД=.;ЧН=0");
	НазваниеПоказателя = "Раздел 3, строка 050";
	РегламентированнаяОтчетность.ЗарегистрироватьПоказательДляРасшифровки(СписокРасшифровкиПоказателей, "П000030005003", НазваниеПоказателя, ЗначениеР3Стр050, "", СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка, "Раздел3", Неопределено, , СчетчикФормулДляРасшифровок);
	
	// Зарегистрируем правую часть соотношения.
	// Добавляем расшифровку для строки 030.
	ЗначениеР3Стр030 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, СтруктураРаздела3.П000030003003);
	ЗначениеР3Стр030Стр = Формат(ЗначениеР3Стр030, "ЧРД=.;ЧН=0");
	НазваниеПоказателя = "Раздел 3, строка 030";
	РегламентированнаяОтчетность.ЗарегистрироватьПоказательДляРасшифровки(СписокРасшифровкиПоказателей, "П000030003003", НазваниеПоказателя, ЗначениеР3Стр030, "", СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка, "Раздел3", Неопределено, , СчетчикФормулДляРасшифровок);
	
	// Добавляем расшифровку для строки 040.
	ЗначениеР3Стр040 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, СтруктураРаздела3.П000030004003);
	ЗначениеР3Стр040Стр = Формат(ЗначениеР3Стр040, "ЧРД=.;ЧН=0");
	НазваниеПоказателя = "Раздел 3, строка 040";
	РегламентированнаяОтчетность.ЗарегистрироватьПоказательДляРасшифровки(СписокРасшифровкиПоказателей, "П000030004003", НазваниеПоказателя, ЗначениеР3Стр040, "", СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка, "Раздел3", Неопределено, , СчетчикФормулДляРасшифровок);
	
	ЛеваяЧасть = ЗначениеР3Стр050;
	ЛеваяЧастьСтр = ЗначениеР3Стр050Стр;
	
	ПраваяЧасть = ПраваяЧастьУсловия;
	ПраваяЧастьСтр = ПраваяЧастьУсловияСтр;
	
	Если НЕ (ЛеваяЧастьУсловия > ПраваяЧастьУсловия) 
		ИЛИ ((ЛеваяЧастьУсловия > ПраваяЧастьУсловия) И (ЛеваяЧасть = ПраваяЧасть)) Тогда 
		ЭтоОшибка = Ложь;
		ОбщееЧислоБезОшибок = ОбщееЧислоБезОшибок + 1;
	Иначе
		ЭтоОшибка = Истина;
		ОбщееЧислоОшибок = ОбщееЧислоОшибок + 1;
	КонецЕсли;
	
	Расшифровка = ЛеваяЧастьСтр + " = (50 * " + ЗначениеР3Стр020Стр + " / 100) Итог [" + ПраваяЧастьСтр + "]"
	+ ", когда (" + ЗначениеР3Стр030Стр + " + " + ЗначениеР3Стр040Стр + ") Итог [" + ЛеваяЧастьУсловияСтр + "] > (50 * "
	+ ЗначениеР3Стр020Стр + " / 100) Итог [" + ПраваяЧастьУсловияСтр + "]";
	
	ТекстОписания = "Необоснованное уменьшение суммы ЕНВД, исчисленной за налоговый период.";
	Если ЭтоОшибка Тогда 
		ТекстОписания = ТекстОписания
		+ Символы.ПС 
		+ "Исключение: Данное контрольное соотношение не распространяется на Индивидуальных предпринимателей, которые не используют труд наемных работников."
	КонецЕсли;
	ТекстовоеПредставлениеФормулы = ?(ПустаяСтрока(ТекстФормулы), "", ТекстФормулы + ". ") + ОписаниеКС;
	СтруктураОшибок.Вставить("Описание" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), ТекстОписания);
	СтруктураОшибок.Вставить("Нарушение" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), "п. 2 ст.346.32 НК РФ");
	СтруктураОшибок.Вставить("Расшифровка" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), Расшифровка);
	СтруктураОшибок.Вставить("НомерФормулыРасшифровки" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), СчетчикФормулДляРасшифровок);
	СтруктураОшибок.Вставить("ЭтоОшибка" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), ЭтоОшибка);
	СтруктураОшибок.Вставить("ТекстовоеПредставлениеФормулы" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), ТекстовоеПредставлениеФормулы);
	
	Если ОбщееЧислоОшибок + ОбщееЧислоБезОшибок > 0 Тогда
		СтруктураРезультата.Вставить("КоличествоНайденныхОшибок", ОбщееЧислоОшибок);
		СтруктураРезультата.Вставить("КоличествоНайденныхБезОшибок", ОбщееЧислоБезОшибок);
		СтруктураРезультата.Вставить("СтруктураОшибок", СтруктураОшибок);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПроверкаКС_1_10(СтруктураРезультата)

	ОбщееЧислоОшибок = СтруктураРезультата.КоличествоНайденныхОшибок; // Счетчик учета ошибок.
	ОбщееЧислоБезОшибок = СтруктураРезультата.КоличествоНайденныхБезОшибок; // Счетчик учета проверенных соотношений, не являющиеся ошибками.
	СтруктураОшибок = СтруктураРезультата.СтруктураОшибок;
	
	ТекстФормулы = "";
	
	ОписаниеКС = "Сумма единого налога на вмененный доход, подлежащий к уплате (строка 060 Раздела 3) должна быть равна сумме исчисленного единого налога на вмененный доход (строка 020 Раздела 3) за минусом общей суммы страховых взносов и пособий по временной нетрудоспособности (строка 050 Раздела 3).";
	СчетчикФормулДляРасшифровок = СчетчикФормулДляРасшифровок + 1;
	РегламентированнаяОтчетность.ЗарегистрироватьФормулуДляРасшифровки(СписокРасшифровкиФормулы, ОписаниеКС, 
		, СчетчикФормулДляРасшифровок);
	
	СтруктураРаздела3 = СтруктураРеквизитовФормы.мДанныеОтчета.ПолеТабличногоДокументаРаздел3;
	
	// Зарегистрируем левую часть соотношения.
	// Добавляем расшифровку для строки 060.
	ЗначениеР3Стр060 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, СтруктураРаздела3.П000030006003);
	ЗначениеР3Стр060Стр = Формат(ЗначениеР3Стр060, "ЧРД=.;ЧН=0");
	НазваниеПоказателя = "Раздел 3, строка 060";
	РегламентированнаяОтчетность.ЗарегистрироватьПоказательДляРасшифровки(СписокРасшифровкиПоказателей, "П000030006003", НазваниеПоказателя, ЗначениеР3Стр060, "", СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка, "Раздел3", Неопределено, , СчетчикФормулДляРасшифровок);
	
	// Зарегистрируем правую часть соотношения.
	// Добавляем расшифровку для строки 020.
	ЗначениеР3Стр020 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, СтруктураРаздела3.П000030002003);
	ЗначениеР3Стр020Стр = Формат(ЗначениеР3Стр020, "ЧРД=.;ЧН=0");
	НазваниеПоказателя = "Раздел 3, строка 020";
	РегламентированнаяОтчетность.ЗарегистрироватьПоказательДляРасшифровки(СписокРасшифровкиПоказателей, "П000030002003", НазваниеПоказателя, ЗначениеР3Стр020, "", СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка, "Раздел3", Неопределено, , СчетчикФормулДляРасшифровок);
	
	
	// Добавляем расшифровку для строки 050.
	ЗначениеР3Стр050 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, СтруктураРаздела3.П000030005003);
	ЗначениеР3Стр050Стр = Формат(ЗначениеР3Стр050, "ЧРД=.;ЧН=0");
	НазваниеПоказателя = "Раздел 3, строка 050";
	РегламентированнаяОтчетность.ЗарегистрироватьПоказательДляРасшифровки(СписокРасшифровкиПоказателей, "П000030005003", НазваниеПоказателя, ЗначениеР3Стр050, "", СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка, "Раздел3", Неопределено, , СчетчикФормулДляРасшифровок);
	
	ЛеваяЧасть = ЗначениеР3Стр060;
	ЛеваяЧастьСтр = ЗначениеР3Стр060Стр;
	
	ПраваяЧасть = ЗначениеР3Стр020 - ЗначениеР3Стр050;
	ПраваяЧастьСтр = Формат(ПраваяЧасть, "ЧРД=.;ЧН=0");
	
	Если ЛеваяЧасть = ПраваяЧасть Тогда 
		ЭтоОшибка = Ложь;
		ОбщееЧислоБезОшибок = ОбщееЧислоБезОшибок + 1;
	Иначе
		ЭтоОшибка = Истина;
		ОбщееЧислоОшибок = ОбщееЧислоОшибок + 1;
	КонецЕсли;
	
	Расшифровка = ЛеваяЧастьСтр + " = " + ЗначениеР3Стр020Стр + " - " + ЗначениеР3Стр050Стр + " Итог [" + ПраваяЧастьСтр + "]";
	
	ТекстовоеПредставлениеФормулы = ?(ПустаяСтрока(ТекстФормулы), "", ТекстФормулы + ". ") + ОписаниеКС;
	СтруктураОшибок.Вставить("Описание" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), "Нарушено соотношение показателей. Возможна арифметическая ошибка в декларации.");
	СтруктураОшибок.Вставить("Расшифровка" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), Расшифровка);
	СтруктураОшибок.Вставить("НомерФормулыРасшифровки" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), СчетчикФормулДляРасшифровок);
	СтруктураОшибок.Вставить("ЭтоОшибка" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), ЭтоОшибка);
	СтруктураОшибок.Вставить("ТекстовоеПредставлениеФормулы" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), ТекстовоеПредставлениеФормулы);
	
	Если ОбщееЧислоОшибок + ОбщееЧислоБезОшибок > 0 Тогда
		СтруктураРезультата.Вставить("КоличествоНайденныхОшибок", ОбщееЧислоОшибок);
		СтруктураРезультата.Вставить("КоличествоНайденныхБезОшибок", ОбщееЧислоБезОшибок);
		СтруктураРезультата.Вставить("СтруктураОшибок", СтруктураОшибок);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатПроверкиВСписке(СписокРасшифровкиПоказателей, ПоказательДляРасш, ТекстВЗаголовкеКРасшифровке, Знач Значение, СсылкаНаРО, ИмяРаздела, ВозможныеЗначения, ОбщееЧислоОшибок, ОбщееЧислоБЕЗОшибок, СтруктураОшибок, ТекстПроверяемоеСоотношение, ПустоеЗначениеЯвляетсяОшибкой, НомерСтраницыЭкз = Неопределено, СчетчикФормулДляРасшифровок)
	
	// Для случаев, если код на многостраничном разделе, здесь анализируем на его пустоту.
	Если ПустаяСтрока(Значение) Тогда
		Значение = "";
	КонецЕсли;
	
	РегламентированнаяОтчетность.ЗарегистрироватьПоказательДляРасшифровки(СписокРасшифровкиПоказателей, ПоказательДляРасш,
		ТекстВЗаголовкеКРасшифровке, Значение, "", СсылкаНаРО, ИмяРаздела, Неопределено, НомерСтраницыЭкз,
		СчетчикФормулДляРасшифровок);
	
	// Непосредственно проверяем на ошибку
	Если (ПустоеЗначениеЯвляетсяОшибкой = "1") И (ПустаяСтрока(Значение)) Тогда
		НайденнаяСтр = Неопределено
	Иначе
		НайденнаяСтр = ВозможныеЗначения.Найти(Значение, "Код");
	КонецЕсли;
	Если НайденнаяСтр = Неопределено Тогда
		ОбщееЧислоОшибок = ОбщееЧислоОшибок + 1;
		ЭтоОшибка = Истина;
	Иначе
		ОбщееЧислоБезОшибок = ОбщееЧислоБезОшибок + 1;
		ЭтоОшибка = Ложь;
	КонецЕсли;

	Если ПустаяСтрока(Значение) Тогда
		Расшифровка = "Пустое значение";
	Иначе
		Расшифровка = "Указанное значение " + Значение;
	КонецЕсли;
	СтруктураОшибок.Вставить("Описание" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), "Неправомерное применение системы налогообложения в виде ЕНВД");
	СтруктураОшибок.Вставить("Нарушение" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), "Ст. 346.27 НК РФ");
	СтруктураОшибок.Вставить("Расшифровка" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), Расшифровка);
	СтруктураОшибок.Вставить("НомерФормулыРасшифровки" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), СчетчикФормулДляРасшифровок);
	СтруктураОшибок.Вставить("ЭтоОшибка" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), ЭтоОшибка);
	СтруктураОшибок.Вставить("ТекстовоеПредставлениеФормулы" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), ТекстПроверяемоеСоотношение);

КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатПроверкиВСписке_1_3(СписокРасшифровкиПоказателей, ПоказательДляРасш, ТекстВЗаголовкеКРасшифровке, Знач КодЗначение, СсылкаНаРО, ИмяРаздела, ВозможныеЗначения, ОбщееЧислоОшибок, ОбщееЧислоБЕЗОшибок, СтруктураОшибок, ТекстПроверяемоеСоотношение, ПустоеЗначениеЯвляетсяОшибкой, НомерСтраницыЭкз = Неопределено, СчетчикФормулДляРасшифровок)
	// Для случаев, если код на многостраничном разделе, здесь анализируем на его пустоту.
	Код = "";
	Значение = "";
	
	Если ТипЗнч(КодЗначение) = Тип("Структура") Тогда 
		КодЗначение.Свойство("Код", Код);
		КодЗначение.Свойство("Значение", Значение);
	КонецЕсли;
	
	РегламентированнаяОтчетность.ЗарегистрироватьПоказательДляРасшифровки(СписокРасшифровкиПоказателей, ПоказательДляРасш,
		ТекстВЗаголовкеКРасшифровке, Значение, "", СсылкаНаРО, ИмяРаздела, Неопределено, НомерСтраницыЭкз,
		СчетчикФормулДляРасшифровок);
	ЛеваяЧасть = Значение;

	// Непосредственно проверяем на ошибку
	НайденнаяСтр = Неопределено;
	НайденнаяСтр = ВозможныеЗначения.Найти(Код, "Код");
	
	Если НайденнаяСтр = Неопределено Тогда
		ПраваяЧасть = 0;
	Иначе
		ПраваяЧасть = НайденнаяСтр.Значение;
	КонецЕсли;

	Если ЛеваяЧасть <> ПраваяЧасть Тогда 
		ОбщееЧислоОшибок = ОбщееЧислоОшибок + 1;
		ЭтоОшибка = Истина;
	Иначе
		ОбщееЧислоБезОшибок = ОбщееЧислоБезОшибок + 1;
		ЭтоОшибка = Ложь;
	КонецЕсли;

	Расшифровка = Формат(ЛеваяЧасть, "ЧРД=.;ЧН=0") + " = " + Формат(ПраваяЧасть, "ЧРД=.;ЧН=0");

	СтруктураОшибок.Вставить("Описание" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), "Неправильное применение значений базовой доходности на единицу физического показателя");
	СтруктураОшибок.Вставить("Расшифровка" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), Расшифровка);
	СтруктураОшибок.Вставить("НомерФормулыРасшифровки" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), СчетчикФормулДляРасшифровок);
	СтруктураОшибок.Вставить("ЭтоОшибка" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), ЭтоОшибка);
	СтруктураОшибок.Вставить("ТекстовоеПредставлениеФормулы" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), ТекстПроверяемоеСоотношение);

КонецПроцедуры

&НаСервере
Функция ПолучитьВозможныеЗначения(НазваниеСписка, НазваниеОбласти)
	
	ТаблРезультат = Новый ТаблицаЗначений;
	ТаблРезультат.Колонки.Добавить("Код");
	ТаблРезультат.Колонки.Добавить("Название");
	
	Если НазваниеОбласти = "КодыВидовДеятельности" Тогда 
		ТаблРезультат.Колонки.Добавить("Значение");
	КонецЕсли;
			
	Макет = ОбъектОтчета(ЭтаФорма.ИмяФормы).ПолучитьМакет(НазваниеСписка);
	ТекОбласть = Макет.Области.Найти(НазваниеОбласти);

	Для Ном = ТекОбласть.Верх По ТекОбласть.Низ Цикл
		// Перебираем строки макета.
		Код = СокрП(Макет.Область(Ном, 1).Текст);
		Название = СокрП(Макет.Область(Ном, 2).Текст);
		Если НазваниеОбласти = "КодыВидовДеятельности" Тогда 
			Значение = СокрП(Макет.Область(Ном, 4).Текст);
			Значение = ?(ЗначениеЗаполнено(Значение), Число(Значение), 0);
		КонецЕсли;
		Если Код = "###" Тогда
			Прервать;
		Иначе
			НовСтрока = ТаблРезультат.Добавить();
			НовСтрока.Код= Код;
			НовСтрока.Название = Название;
			Если НазваниеОбласти = "КодыВидовДеятельности" Тогда 
				НовСтрока.Значение = Значение;
			КонецЕсли;
		КонецЕсли;

	КонецЦикла;

	Возврат ТаблРезультат;

КонецФункции

#Область ПанельОтправкиВКонтролирующиеОрганы

&НаКлиенте
Процедура ОбновитьОтправку(Команда)
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОбновитьОтправкуИзПанелиОтправки(ЭтаФорма, "ФНС");
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаПротоколНажатие(Элемент)
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьПротоколИзПанелиОтправки(ЭтаФорма, "ФНС");
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНеотправленноеИзвещение(Команда)
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОтправитьНеотправленноеИзвещениеИзПанелиОтправки(ЭтаФорма, "ФНС");
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыОтправкиНажатие(Элемент)
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьСостояниеОтправкиИзПанелиОтправки(ЭтаФорма, "ФНС");
КонецПроцедуры

&НаКлиенте
Процедура КритическиеОшибкиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьКритическиеОшибкиИзПанелиОтправки(ЭтаФорма, "ФНС");
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОтправитьВКонтролирующийОрган(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПроверкаВозможностиВыгрузкиРегламентированногоОтчетаПередОтправкой", ЭтотОбъект);
	Отказ = Ложь;
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередОтправкойРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаВозможностиВыгрузкиРегламентированногоОтчетаПередОтправкой(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтправитьВКонтролирующийОрганЗавершение", ЭтотОбъект);
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередВыгрузкойРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВКонтролирующийОрганЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	РегламентированнаяОтчетностьКлиент.ПриНажатииНаКнопкуОтправкиВКонтролирующийОрган(ЭтаФорма, "ФНС");
	
КонецПроцедуры

&НаСервере
Функция ОбъектОтчета(ЭтаФормаИмя)
	
	Если мОбъектОтчета = Неопределено Тогда 
		мОбъектОтчета = РегламентированнаяОтчетностьВызовСервера.ОбъектОтчета(ЭтаФормаИмя);
	КонецЕсли;
	
	Возврат мОбъектОтчета;
	
КонецФункции

&НаКлиенте
Процедура  ЗаписатьИЗакрыть(Команда)
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	Оповещение = Новый ОписаниеОповещения("ПослеСохраненияФормыЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	СохранитьНаКлиенте(, Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ПослеСохраненияФормыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	ДополнительныеПараметры.Форма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОткрытьПрисоединенныеФайлы(Команда)
	
	РегламентированнаяОтчетностьКлиент.СохранитьОтчетИОткрытьФормуПрисоединенныеФайлы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры