
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Логин = Параметры.Логин;
	Пароль = Параметры.Пароль;
	СохранитьПароль = Параметры.СохранитьПароль;
	
	Элементы.СсылкаНаРегистрацию.Заголовок = Параметры.Портал + "FtsPersonalCabinetWeb/Auth/Register";
	
	КонтекстЭДО = ДокументооборотСКОВызовСервера.ПолучитьОбработкуЭДО();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СсылкаНаРегистрациюНажатие(Элемент)
	
	СтандартнаяОбработка = Ложь;
	ПерейтиПоНавигационнойСсылке(Элементы.СсылкаНаРегистрацию.Заголовок);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Результат = Новый Структура("Логин, Пароль, СохранитьПароль");
	Результат.Логин = Логин;
	Результат.Пароль = Пароль;
	Результат.СохранитьПароль = СохранитьПароль;
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти
