
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Параметры.Заказ) Тогда
		ВызватьИсключение НСтр("ru='Не указан заказ'");
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("Заказ", Параметры.Заказ);
	
	ТолькоПросмотр = Истина;
	Заголовок = СтрШаблон(НСтр("ru='История изменения состояний заказа: ""%1""'"), Параметры.Заказ);
	
КонецПроцедуры

#КонецОбласти
