
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТекстСообщения = НСтр("ru = 'Внимание! Выполнение полного обмена может занять длительное время. Продолжить?'");
	
	Ответ = Неопределено;

	
	ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаКомандыЗавершение", ЭтотОбъект, Новый Структура("ПараметрКоманды", ПараметрКоманды)), ТекстСообщения, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандыЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    ПараметрКоманды = ДополнительныеПараметры.ПараметрКоманды;
    
    
    Ответ = Результат;
    
    Если Ответ = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;
    
    УзелОбмена = ПараметрКоманды;
    
    Если УзелОбмена = ОбменССайтомПовтИсп.ПолучитьЭтотУзелПланаОбмена("ОбменУправлениеНебольшойФирмойСайт") Тогда
        ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
        НСтр("ru = 'Узел соответствует этой информационной базе и не может использоваться в обмене с сайтом. Используйте другой узел обмена или создайте новый.'"));
        Возврат;
    КонецЕсли;
    
    Состояние(
    СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
    НСтр("ru = '%1 начат обмен данными с сайтом'"),
    Формат(ТекущаяДата(), "ДЛФ=DT"))
    ,,
    СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
    НСтр("ru = 'по узлу обмена ""%1""...'"),
    УзелОбмена));
    
    ОбменССайтом.ВыполнитьОбмен(УзелОбмена, НСтр("ru = 'Интерактивный обмен'"), Ложь);
    
    ПоказатьОповещениеПользователя(
    СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
    НСтр("ru = '%1 ""%2""'"),
    Формат(ТекущаяДата(), "ДЛФ=DT"),
    УзелОбмена) 
    ,,
    НСтр("ru = 'Обмен с сайтом завершен'"),
    БиблиотекаКартинок.Информация32);
    
    Оповестить("ЗавершенСеансОбменаССайтом");
    
КонецПроцедуры

