#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура СоздатьНовуюТаблицуРеквизитов(ДоступныеПоля)
	
	ДоступныеПоля = Новый ТаблицаЗначений;
	ДоступныеПоля.Колонки.Добавить("Использование");
	ДоступныеПоля.Колонки.Добавить("РеквизитНоменклатуры");
	ДоступныеПоля.Колонки.Добавить("РеквизитПредставление");
	ДоступныеПоля.Колонки.Добавить("ПараметрРасшифровки");
	ДоступныеПоля.Колонки.Добавить("Ширина");
	ДоступныеПоля.Колонки.Добавить("СлужебныйУправлениеВидимостью");
	
КонецПроцедуры

Процедура ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Использование, РеквизитНоменклатуры, РеквизитПредставление, ПараметрРасшифровки = "", Ширина, СлужебныйУправлениеВидимостью = Истина)
	
	НоваяСтрока							= ДоступныеПоля.Добавить();
	НоваяСтрока.Использование			= Использование;
	НоваяСтрока.РеквизитНоменклатуры	= РеквизитНоменклатуры;
	НоваяСтрока.РеквизитПредставление	= РеквизитПредставление;
	НоваяСтрока.ПараметрРасшифровки		= ПараметрРасшифровки;
	НоваяСтрока.Ширина					= Ширина;
	НоваяСтрока.СлужебныйУправлениеВидимостью = СлужебныйУправлениеВидимостью;
	
КонецПроцедуры

Процедура ДоступныеПоляНоменклатуры(ДоступныеПоля) Экспорт
	
	СоздатьНовуюТаблицуРеквизитов(ДоступныеПоля);
	
	ИспользованиеХарактеристик = ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики");
	
	ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Истина, "Картинка",				"Картинка",				"НоменклатураСсылка",			8);
	ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Истина, "Код",					"Код",					"НоменклатураСсылка",			11);
	ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Истина, "Артикул",				"Артикул",				"НоменклатураСсылка",			11);
	ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Истина, "Наименование",			"Наименование",			"НоменклатураСсылка",			30);
	ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Истина, "НаименованиеПолное",	"Полное наименование",	"НоменклатураСсылка",			30);
	ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Истина, "Комментарий",			"Описание",				"НоменклатураСсылка",			30);
	ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, ИспользованиеХарактеристик, "Характеристика", "Характеристика", "РасшифровкаХарактеристика", 14, ИспользованиеХарактеристик);
	ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Истина, "СтранаПроисхождения",	"Страна",				"НоменклатураСсылка",			7);
	ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Ложь,	"СвободныйОстаток",		"Свободный остаток",	"НоменклатураСсылка",			10);
	
КонецПроцедуры

#КонецЕсли