////////////////////////////////////////////////////////////////////////////////
// Подсистема "Отправка SMS"
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Открывает форму для отправки нового SMS.
//
// Параметры:
//   НомераПолучателей - Массив - номера получателей в формате +<КодСтраны><КодDEF><номер>(строкой);
//   Текст             - Строка - текст сообщения, длиной не более 1000 символов;
//   ДополнительныеПараметры - Структура - Дополнительные параметры отправки SMS.
//          * ИмяОтправителя     - Строка - Имя отправителя, которое будет отображаться вместо номера у получателей.
//          * ПеревестиВТранслит - Булево - Истина, если требуется переводить текст сообщения в транслит перед отправкой.
//   СтандартнаяОбработка - Булево -  Флаг необходимости выполнения стандартной обработки отправки SMS.
Процедура ПриОтправкеSMS(НомераПолучателей, Текст, ДополнительныеПараметры, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Текст", Текст);
	ПараметрыФормы.Вставить("Получатели", Новый Массив);
	
	Для Каждого НомерПолучателя Из НомераПолучателей Цикл
		ЗначениеПолучателя = Новый Структура;
		ЗначениеПолучателя.Вставить("Телефон", НомерПолучателя);
		Если ДополнительныеПараметры.Свойство("ИсточникКонтактнойИнформации")
			И ЗначениеЗаполнено(ДополнительныеПараметры.ИсточникКонтактнойИнформации) Тогда
			
			ЗначениеПолучателя.Вставить("ИсточникКонтактнойИнформации", ДополнительныеПараметры.ИсточникКонтактнойИнформации);
		КонецЕсли;
		
		ПараметрыФормы.Получатели.Добавить(ЗначениеПолучателя);
		
	КонецЦикла;
		
	ОткрытьФорму("Документ.Событие.Форма.ФормаСообщенияSMS", ПараметрыФормы);
	
КонецПроцедуры

// Определяет адрес страницы провайдера в сети Интернет.
//
// Параметры:
//  Провайдер - ПеречислениеСсылка.ПровайдерыSMS - поставщик услуги по отправке SMS.
//  АдресВИнтернете - Строка - адрес страницы провайдера в Интернете.
Процедура ПриПолученииАдресаПровайдераВИнтернете(Провайдер, АдресВИнтернете) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти
