////////////////////////////////////////////////////////////////////////////////
// Подсистема "Базовая функциональность электронного документооборота
//             с контролирующими органами  (служебный)". 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область ПолучитьСистемнуюИнформацию

Процедура ПолучитьСистемнуюИнформацию(ОповещениеОЗавершении, ВыводитьСообщения = Ложь) Экспорт
	
	Контекст = Новый Структура("ОповещениеОЗавершении", ОповещениеОЗавершении);
	Оповещение = Новый ОписаниеОповещения("ПолучитьСистемнуюИнформациюПослеСозданияКаталога", ЭтотОбъект, Контекст);
	
	ОперацииСФайламиЭДКОКлиент.СоздатьКаталогНаКлиенте(Оповещение);
	
КонецПроцедуры

Процедура ПолучитьСистемнуюИнформациюПослеСозданияКаталога(Результат, ВходящийКонтекст) Экспорт
	
	Если Результат.Выполнено Тогда
		ВходящийКонтекст.Вставить("ИмяКаталога", Результат.ИмяКаталога);
		Оповещение = Новый ОписаниеОповещения("ПолучитьСистемнуюИнформациюПослеСохраненияСкрипта", ЭтотОбъект, ВходящийКонтекст);
		
		ТекстСкрипта = 
		":: detect OS
		|@echo off
		|
		|set fileResult=""!directory!detectOS_result.txt""
		|
		|for /F ""tokens=1,2 delims=="" %%A in ('wmic os get Caption /Value') do (if ""%%A"" equ ""Caption"" set CaptionValue=%%B)
		|for /F ""tokens=1,2 delims=="" %%A in ('wmic os get Version /Value') do (if ""%%A"" equ ""Version"" set VersionValue=%%B)
		|for /F ""tokens=1,2 delims=="" %%A in ('wmic os get CSDVersion /Value') do (if ""%%A"" equ ""CSDVersion"" set CSDVersionValue=%%B)
		|
		|if ""%CSDVersionValue%"" equ """" (set CSDVersionValue=-)
		|
		|echo %CaptionValue% > %fileResult%
		|echo %VersionValue% >> %fileResult%
		|echo %CSDVersionValue% >> %fileResult%
		|
		|
		|set Bitness=64
		|if %PROCESSOR_ARCHITECTURE% == x86 (
		|  if not defined PROCESSOR_ARCHITEW6432 set Bitness=32
		|  )
		|echo %Bitness% >> %fileResult%";
		ТекстСкрипта = СтрЗаменить(ТекстСкрипта, "!directory!", ВходящийКонтекст.ИмяКаталога);
		ОперацииСФайламиЭДКОКлиент.ТекстВФайл(Оповещение, ТекстСкрипта, ВходящийКонтекст.ИмяКаталога + "detectOS.bat");
	Иначе
		ВыполнитьОбработкуОповещения(ВходящийКонтекст.ОповещениеОЗавершении, Результат);
	КонецЕсли;
		
КонецПроцедуры

Процедура ПолучитьСистемнуюИнформациюПослеСохраненияСкрипта(Результат, ВходящийКонтекст) Экспорт
	
	Если Результат.Выполнено Тогда
		Оповещение = Новый ОписаниеОповещения("ПолучитьСистемнуюИнформациюПослеВыполненияСкрипта", ЭтотОбъект, ВходящийКонтекст);
		
		ОперацииСФайламиЭДКОКлиент.ЗапуститьПриложениеНаКлиенте(Оповещение, Результат.ИмяФайла, Истина);
	Иначе
		ВыполнитьОбработкуОповещения(ВходящийКонтекст.ОповещениеОЗавершении, Результат);
	КонецЕсли;
		
КонецПроцедуры

Процедура ПолучитьСистемнуюИнформациюПослеВыполненияСкрипта(Результат, ВходящийКонтекст) Экспорт
	
	Если Результат.Выполнено И Результат.КодВозврата = 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ПолучитьСистемнуюИнформациюПослеЧтенияРезультатаВыполненияСкрипта", ЭтотОбъект, ВходящийКонтекст);
		
		ОперацииСФайламиЭДКОКлиент.ФайлВТекст(Оповещение, ВходящийКонтекст.ИмяКаталога + "detectOS_result.txt");
	Иначе
		ВыполнитьОбработкуОповещения(
			ВходящийКонтекст.ОповещениеОЗавершении, Новый Структура("Выполнено, ОписаниеОшибки", Ложь, ""));
	КонецЕсли;
		
КонецПроцедуры

Процедура ПолучитьСистемнуюИнформациюПослеЧтенияРезультатаВыполненияСкрипта(Результат, ВходящийКонтекст) Экспорт
	
	Если Результат.Выполнено Тогда
		Текст = СокрЛП(Результат.Текст);
		
		СистемнаяИнформация = Новый Структура("ИмяОС,ВерсияОС,РазрядностьОС", "", "", 0);
		
		// Определение версии ОС
		ВерсияСтрока = СтрПолучитьСтроку(Текст, 2);
		СоставляющиеВерсии = СтрРазделить(ВерсияСтрока, ".", Истина);
		СистемнаяИнформация.Вставить("ВерсияОС", СтрШаблон("%1.%2", СоставляющиеВерсии[0], СоставляющиеВерсии[1]));
		
		// Определение разрядности ОС		
		РазрядностьСтрока = СтрПолучитьСтроку(Текст, 4);
		Если ЗначениеЗаполнено(РазрядностьСтрока) И СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(СокрЛП(РазрядностьСтрока)) Тогда
			СистемнаяИнформация.Вставить("РазрядностьОС", Число(РазрядностьСтрока));
		КонецЕсли;
		
		// Определение имени ОС
		СистемнаяИнформация.Вставить("ИмяОС", ОпределитьИмяОС_Windows(СтрПолучитьСтроку(Текст, 1), СистемнаяИнформация.ВерсияОС));
		
		ОперацииСФайламиЭДКОКлиент.УдалитьФайлыНаКлиенте(, ВходящийКонтекст.ИмяКаталога);
		ВыполнитьОбработкуОповещения(ВходящийКонтекст.ОповещениеОЗавершении, Новый Структура("Выполнено, СистемнаяИнформация", Истина, СистемнаяИнформация));		
	Иначе
		ВыполнитьОбработкуОповещения(ВходящийКонтекст.ОповещениеОЗавершении, Результат);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти


#Область УстановитьViPNetCSP

Процедура УстановитьViPNetCSP(ОповещениеОЗавершении, ВладелецФормы) Экспорт
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Если СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86
		ИЛИ СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
		Контекст = Новый Структура;
		Контекст.Вставить("ОповещениеОЗавершении", ОповещениеОЗавершении);
		Оповещение = Новый ОписаниеОповещения("УстановитьViPNetCSPПослеВводаРегистрационныхДанных", ЭтотОбъект, Контекст);
		
		ОткрытьФорму(
			"Обработка.ДокументооборотСКонтролирующимиОрганами.Форма.УстановкаViPNetCSPРегистрационныеДанные",,
			ВладелецФормы,,,, Оповещение);
	Иначе
		ОписаниеОшибки = НСтр("ru = 'Установка ViPNet CSP возможно только на операционных системах семейства Windows.'");
		ПоказатьПредупреждение(, ОписаниеОшибки,, НСтр("ru = 'Установка ViPNet CSP'"));
		РезультатВыполнения = Новый Структура;
		РезультатВыполнения.Вставить("Выполнено", Ложь);
		РезультатВыполнения.Вставить("ОписаниеОшибки", ОписаниеОшибки);
		
		ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьViPNetCSPПослеВводаРегистрационныхДанных(Результат, ВходящийКонтекст) Экспорт
	
	Если ЗначениеЗаполнено(Результат) И ТипЗнч(Результат) = Тип("Структура") Тогда
		ВходящийКонтекст.Вставить("РегистрационныеДанные", Результат);
		Оповещение = Новый ОписаниеОповещения(
			"УстановитьViPNetCSPПослеСозданияВременногоКаталога", ЭтотОбъект, ВходящийКонтекст);
		ОперацииСФайламиЭДКОКлиент.СоздатьКаталогНаКлиенте(Оповещение);
	Иначе
		Результат = Новый Структура("Выполнено", Ложь);
		ВыполнитьОбработкуОповещения(ВходящийКонтекст.ОповещениеОЗавершении, Результат);
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьViPNetCSPПослеСозданияВременногоКаталога(Результат, ВходящийКонтекст) Экспорт
	
	Если Результат.Выполнено Тогда
		ВходящийКонтекст.Вставить("ВременныйКаталог", Результат.ИмяКаталога);

		Оповещение = Новый ОписаниеОповещения(
			"УстановитьViPNetCSPПослеПолученияИнформацииОбОперационнойСистеме", ЭтотОбъект, ВходящийКонтекст);
		ПолучитьСистемнуюИнформацию(Оповещение);	
	Иначе
		Результат = Новый Структура("Выполнено", Ложь);
		ВыполнитьОбработкуОповещения(ВходящийКонтекст.ОповещениеОЗавершении, Результат);
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьViPNetCSPПослеПолученияИнформацииОбОперационнойСистеме(Результат, ВходящийКонтекст) Экспорт
	
	Если Результат.Выполнено Тогда
		Если Результат.СистемнаяИнформация.ВерсияОС = "10.0" Тогда // Windows 10, Windows Server 2016
			ОписаниеОшибки = СтрШаблон(
								НСтр("ru = 'Работа ViPNet CSP на операционной системе %1 не поддерживается.'"),
								Результат.СистемнаяИнформация.ИмяОС);
			ПоказатьПредупреждение(, ОписаниеОшибки);
			
			РезультатВыполнения = Новый Структура;
			РезультатВыполнения.Вставить("Выполнено", Ложь);
			РезультатВыполнения.Вставить("ОписаниеОшибки", ОписаниеОшибки);
			ВыполнитьОбработкуОповещения(ВходящийКонтекст.ОповещениеОЗавершении, РезультатВыполнения);
			Возврат;
		КонецЕсли;
		ВходящийКонтекст.РегистрационныеДанные.Вставить("Разрядность", Результат.СистемнаяИнформация.РазрядностьОС);	
		
		ПараметрыДистрибутива = ОбщегоНазначенияЭДКОСлужебныйВызовСервера.ПолучитьСерийныйНомерДистрибутиваViPNetCSP(ВходящийКонтекст.РегистрационныеДанные);
		
		Если Не ЗначениеЗаполнено(ПараметрыДистрибутива) Тогда
			ОписаниеОшибки = НСтр("ru = 'Сервис временно недоступен. Обратитесь в службу поддержки или повторите попытку позже.'");
			ПоказатьПредупреждение(, ОписаниеОшибки);
			РезультатВыполнения = Новый Структура;
			РезультатВыполнения.Вставить("Выполнено", Ложь);
			РезультатВыполнения.Вставить("ОписаниеОшибки", ОписаниеОшибки);
			ВыполнитьОбработкуОповещения(ВходящийКонтекст.ОповещениеОЗавершении, РезультатВыполнения);
			Возврат;
		КонецЕсли;
		
		ВходящийКонтекст.Вставить("Дистрибутив", ПараметрыДистрибутива.Дистрибутив);
		ВходящийКонтекст.Вставить("СерийныйНомер", ПараметрыДистрибутива.СерийныйНомер);
		ВходящийКонтекст.Вставить("Версия", ПараметрыДистрибутива.Версия);
		ВходящийКонтекст.Вставить("КонтрольнаяСумма", ПараметрыДистрибутива.КонтрольнаяСумма);
		
		Оповещение = Новый ОписаниеОповещения("УстановитьViPNetCSPПослеСкачиванияДистрибутива", ЭтотОбъект, ВходящийКонтекст);
		
		Параметры = Новый Структура("ПоясняющийТекст", НСтр("ru = 'Выполняется загрузка программы...'"));
		ОперацииСФайламиЭДКОКлиент.СкачатьФайлНаСервереВФоне(Оповещение, ПараметрыДистрибутива.Дистрибутив, Параметры);
	Иначе
		РезультатВыполнения = Новый Структура;
		РезультатВыполнения.Вставить("Выполнено", Ложь);
		РезультатВыполнения.Вставить("ОписаниеОшибки", Результат.ОписаниеОшибки);
		ВыполнитьОбработкуОповещения(ВходящийКонтекст.ОповещениеОЗавершении, Результат);
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьViPNetCSPПослеСкачиванияДистрибутива(Результат, ВходящийКонтекст) Экспорт
	
	Если Результат.Выполнено Тогда
		ВходящийКонтекст.Вставить("Дистрибутив", Результат.АдресФайла);
		
		РаспакованныеФайлы = ОперацииСФайламиЭДКОСлужебныйВызовСервера.РаспаковатьАрхив(Результат.АдресФайла);
		АдресДистрибутива = "";
		Для Каждого РаспакованныйФайл Из РаспакованныеФайлы Цикл
			Если СтрЗаканчиваетсяНа(РаспакованныйФайл.Имя, ".exe") Тогда
				АдресДистрибутива = РаспакованныйФайл.Хранение;
				Прервать;	
			КонецЕсли;
		КонецЦикла;
		
		ИмяФайла = ВходящийКонтекст.ВременныйКаталог + "Setup.exe";
		Оповещение = Новый ОписаниеОповещения("УстановитьViPNetCSPПослеПолученияФайла", ЭтотОбъект, ВходящийКонтекст);
		ОперацииСФайламиЭДКОКлиент.ДанныеССервераВФайл(Оповещение, АдресДистрибутива, ИмяФайла);
	Иначе
		РезультатВыполнения = Новый Структура;
		РезультатВыполнения.Вставить("Выполнено", Ложь);
		РезультатВыполнения.Вставить("ОписаниеОшибки", Результат.ОписаниеОшибки);
		
		ВыполнитьОбработкуОповещения(ВходящийКонтекст.ОповещениеОЗавершении, РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьViPNetCSPПослеПолученияФайла(Результат, ВходящийКонтекст) Экспорт
	
	Если Результат.Выполнено Тогда
		ТекстФайла = "Serial Number: %1
		              |E-mail: %2
		              |User name: %3
		              |Company: %4";

		ТекстФайла = СтрШаблон(
			ТекстФайла,
			ВходящийКонтекст.СерийныйНомер,
			ВходящийКонтекст.РегистрационныеДанные.ЭлектроннаяПочта,
			ВходящийКонтекст.РегистрационныеДанные.КонтактноеЛицо,
			"");
			
		Оповещение = Новый ОписаниеОповещения(
			"УстановитьViPNetCSPПослеСохраненияФайлаСРегистрационнымиДанными", ЭтотОбъект, ВходящийКонтекст);
		ОперацииСФайламиЭДКОКлиент.ТекстВФайл(Оповещение, ТекстФайла, ВходящийКонтекст.ВременныйКаталог + "cspreg.txt");
	Иначе
		РезультатВыполнения = Новый Структура;
		РезультатВыполнения.Вставить("Выполнено", Ложь);
		РезультатВыполнения.Вставить("ОписаниеОшибки", Результат.ОписаниеОшибки);
		
		ВыполнитьОбработкуОповещения(ВходящийКонтекст.ОповещениеОЗавершении, РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры
			  
Процедура УстановитьViPNetCSPПослеСохраненияФайлаСРегистрационнымиДанными(Результат, ВходящийКонтекст) Экспорт
	
	Если Результат.Выполнено Тогда
		Оповещение = Новый ОписаниеОповещения(
			"УстановитьViPNetCSPПослеПолученияПодтвержденияНаУстановку", ЭтотОбъект, ВходящийКонтекст);
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Дистрибутив", ВходящийКонтекст.ВременныйКаталог + "Setup.exe");
		ПараметрыФормы.Вставить("КонтрольнаяСумма", ВходящийКонтекст.КонтрольнаяСумма);
		ПараметрыФормы.Вставить("Версия", ВходящийКонтекст.Версия);
		
		Если ВходящийКонтекст.РегистрационныеДанные.ВыполнятьКонтрольЦелостности Тогда
			ОткрытьФорму(
				"Обработка.ДокументооборотСКонтролирующимиОрганами.Форма.УстановкаViPNetCSPИнформацияОДистрибутиве",
				ПараметрыФормы,,,,, Оповещение);
		Иначе
			УстановитьViPNetCSPПослеПолученияПодтвержденияНаУстановку(Истина, ВходящийКонтекст);
		КонецЕсли;
	Иначе
		РезультатВыполнения = Новый Структура;
		РезультатВыполнения.Вставить("Выполнено", Ложь);
		РезультатВыполнения.Вставить("ОписаниеОшибки", Результат.ОписаниеОшибки);
		
		ВыполнитьОбработкуОповещения(ВходящийКонтекст.ОповещениеОЗавершении, РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьViPNetCSPПослеПолученияПодтвержденияНаУстановку(Результат, ВходящийКонтекст) Экспорт
	
	Если Результат = Истина Тогда
		Оповещение = Новый ОписаниеОповещения("УстановитьViPNetCSPПослеСохраненияСкрипта", ЭтотОбъект, ВходящийКонтекст);
		
		ТекстСкрипта =		
		":: workaround problem autoenrollment
		|@echo off
		|
		|set AppDataDir=%ALLUSERSPROFILE%
		|if not defined PROGRAMDATA set AppDataDir=%AppDataDir%\Application Data
		|
		|set ViPNet_CSP_dir=%AppDataDir%\InfoTeCS\ViPNet CSP\
		|if not exist ""%ViPNet_CSP_dir%\."" mkdir ""%ViPNet_CSP_dir%""
		|
		|""!setup.exe!"" /qf";
		ТекстСкрипта = СтрЗаменить(ТекстСкрипта, "!setup.exe!", ВходящийКонтекст.ВременныйКаталог + "Setup.exe");
		ОперацииСФайламиЭДКОКлиент.ТекстВФайл(Оповещение, ТекстСкрипта, ВходящийКонтекст.ВременныйКаталог + "Setup.bat");
	Иначе
		РезультатВыполнения = Новый Структура;
		РезультатВыполнения.Вставить("Выполнено", Ложь);
		РезультатВыполнения.Вставить("ОписаниеОшибки", НСтр("ru = 'Пользователь отклонил установку ViPNet CSP'"));
		
		ВыполнитьОбработкуОповещения(ВходящийКонтекст.ОповещениеОЗавершении, РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьViPNetCSPПослеСохраненияСкрипта(Результат, ВходящийКонтекст) Экспорт
	
	Если Результат.Выполнено Тогда
		Оповещение = Новый ОписаниеОповещения("УстановитьViPNetCSPПослеЗавершенияУстановки", ЭтотОбъект, ВходящийКонтекст);
		ОперацииСФайламиЭДКОКлиент.ЗапуститьПриложениеНаКлиенте(
			Оповещение, ВходящийКонтекст.ВременныйКаталог + "Setup.bat", Истина);
	Иначе
		РезультатВыполнения = Новый Структура;
		РезультатВыполнения.Вставить("Выполнено", Ложь);
		РезультатВыполнения.Вставить("ОписаниеОшибки", НСтр("ru = 'Ошибка при установке ViPNet CSP'"));
		
		ВыполнитьОбработкуОповещения(ВходящийКонтекст.ОповещениеОЗавершении, РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьViPNetCSPПослеЗавершенияУстановки(Результат, ВходящийКонтекст) Экспорт
	
	Если Результат.Выполнено Тогда
		Если ЗначениеЗаполнено(Результат.КодВозврата) Тогда
			РезультатВыполнения = Новый Структура;
			РезультатВыполнения.Вставить("Выполнено", Ложь);
			РезультатВыполнения.Вставить("ОписаниеОшибки", НСтр("ru = 'Установка ViPNet CSP не выполнена'"));
			
			ВыполнитьОбработкуОповещения(ВходящийКонтекст.ОповещениеОЗавершении, РезультатВыполнения);
		Иначе
			РегистрационныеДанные = Новый Структура;
			РегистрационныеДанные.Вставить("КонтактноеЛицо", ВходящийКонтекст.РегистрационныеДанные.КонтактноеЛицо);
			РегистрационныеДанные.Вставить("ЭлектроннаяПочта", ВходящийКонтекст.РегистрационныеДанные.ЭлектроннаяПочта);
			РегистрационныеДанные.Вставить("СерийныйНомер", ВходящийКонтекст.СерийныйНомер);
			РегистрационныеДанные.Вставить("Версия", ВходящийКонтекст.Версия);
			
			РезультатВыполнения = Новый Структура;
			РезультатВыполнения.Вставить("РегистрационныеДанные", РегистрационныеДанные);
			РезультатВыполнения.Вставить("Выполнено", Истина);
			
			ВыполнитьОбработкуОповещения(ВходящийКонтекст.ОповещениеОЗавершении, РезультатВыполнения);
		КонецЕсли;
	Иначе
		РезультатВыполнения = Новый Структура;
		РезультатВыполнения.Вставить("Выполнено", Ложь);
		РезультатВыполнения.Вставить("ОписаниеОшибки", НСтр("ru = 'Установка ViPNet CSP не выполнена'"));
		
		ВыполнитьОбработкуОповещения(ВходящийКонтекст.ОповещениеОЗавершении, РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СообщитьПользователюОКонфликтеКриптопровайдеров

Процедура СообщитьПользователюОКонфликтеКриптопровайдеров() Экспорт
	
	Оповещение = Новый ОписаниеОповещения("СообщитьПользователюОКонфликтеКриптопровайдеровПослеПолученияКриптопровайдеров", ЭтотОбъект);
	КриптографияЭДКОКлиент.ПолучитьКриптопровайдеры(Оповещение, Ложь, Ложь);		
	
КонецПроцедуры

Процедура СообщитьПользователюОКонфликтеКриптопровайдеровПослеПолученияКриптопровайдеров(Результат, ВходящийКонтекст) Экспорт
	
	Если Результат.Выполнено Тогда
		УстановленныеКриптопровайдерыГОСТ = Новый Массив;
		
		УстановленCryptoPro = Ложь;
		УстановленSignalCOM = Ложь;
		УстановленViPNet = Ложь;
		УстановленЛИССИ = Ложь;
		
		Для Каждого Криптопровайдер Из Результат.Криптопровайдеры Цикл
			Если Криптопровайдер.Имя = КриптографияЭДКОКлиентСервер.КриптопровайдерViPNet().Имя Тогда
				УстановленViPNet = Истина;
				УстановленныеКриптопровайдерыГОСТ.Добавить(КриптографияЭДКОКлиентСервер.КриптопровайдерViPNet());
			КонецЕсли;
			Если Криптопровайдер.Имя = КриптографияЭДКОКлиентСервер.КриптопровайдерCryptoPro().Имя Тогда
				УстановленCryptoPro = Истина;
				УстановленныеКриптопровайдерыГОСТ.Добавить(КриптографияЭДКОКлиентСервер.КриптопровайдерCryptoPro());
			КонецЕсли;
			Если Криптопровайдер.Имя = КриптографияЭДКОКлиентСервер.КриптопровайдерSignalCOM().Имя Тогда
				УстановленSignalCOM = Истина;
				УстановленныеКриптопровайдерыГОСТ.Добавить(КриптографияЭДКОКлиентСервер.КриптопровайдерSignalCOM());
			КонецЕсли;
			Если Криптопровайдер.Имя = КриптографияЭДКОКлиентСервер.КриптопровайдерЛИССИ().Имя Тогда
				УстановленЛИССИ = Истина;
				УстановленныеКриптопровайдерыГОСТ.Добавить(КриптографияЭДКОКлиентСервер.КриптопровайдерЛИССИ());
			КонецЕсли;
		КонецЦикла;
		
		Если УстановленViPNet И (УстановленSignalCOM ИЛИ УстановленCryptoPro ИЛИ УстановленЛИССИ)
			ИЛИ УстановленCryptoPro И (УстановленSignalCOM ИЛИ УстановленViPNet ИЛИ УстановленЛИССИ) Тогда
			Контекст = Новый Структура;
			Контекст.Вставить("Криптопровайдеры", УстановленныеКриптопровайдерыГОСТ);
			Оповещение = Новый ОписаниеОповещения("СообщитьПользователюОКонфликтеКриптопровайдеровПослеПоискаСертификатов", ЭтотОбъект, Контекст);
			ПараметрыРаботыКлиентаПриЗапуске = СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиентаПриЗапуске();
			КриптографияЭДКОКлиент.НайтиСертификаты(Оповещение, ПараметрыРаботыКлиентаПриЗапуске.ДоступныеЛокальныеСертификатыПользователя);	
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

Процедура СообщитьПользователюОКонфликтеКриптопровайдеровПослеПоискаСертификатов(Результат, ВходящийКонтекст) Экспорт
	
	Если Результат.Выполнено И Результат.Сертификаты.Количество() > 0 Тогда
		Сертификаты = Новый Массив;
		Для Каждого НайденныйСертификат Из Результат.Сертификаты Цикл
			Если НайденныйСертификат.ДействителенС < ОбщегоНазначенияКлиент.ДатаСеанса() И НайденныйСертификат.ДействителенПо > ОбщегоНазначенияКлиент.ДатаСеанса() Тогда
				Сертификаты.Добавить(НайденныйСертификат);
			КонецЕсли;
		КонецЦикла;
		Если ЗначениеЗаполнено(Сертификаты) Тогда
			
			Контекст = Новый Структура;
			Контекст.Вставить("Сертификаты", Сертификаты);
			Контекст.Вставить("ТекущийСертификат", 0);
			Контекст.Вставить("Криптопровайдеры", ВходящийКонтекст.Криптопровайдеры);
			
			СообщитьПользователюОКонфликтеКриптопровайдеровВыгрузитьСертификаты(Контекст);
		КонецЕсли; 
	КонецЕсли;
		
КонецПроцедуры

Процедура СообщитьПользователюОКонфликтеКриптопровайдеровВыгрузитьСертификаты(Контекст)
	
	Если Контекст.Сертификаты.Количество() > Контекст.ТекущийСертификат Тогда
		Оповещение = Новый ОписаниеОповещения("СообщитьПользователюОКонфликтеКриптопровайдеровПослеВыгрузкиСертификата", ЭтотОбъект, Контекст);
		КриптографияЭДКОКлиент.ЭкспортироватьСертификатВBase64(Оповещение, Контекст.Сертификаты[Контекст.ТекущийСертификат]);			
	Иначе
		Сертификаты = КриптографияЭДКОСлужебныйВызовСервера.ИзвлечьИнформациюОКриптопровайдереПоСертификату(Контекст.Сертификаты);
		
		ПоказатьПредупреждениеОКонфликтеКриптопровайдеров(Сертификаты, Контекст.Криптопровайдеры);
	КонецЕсли;
		
КонецПроцедуры

Процедура СообщитьПользователюОКонфликтеКриптопровайдеровПослеВыгрузкиСертификата(Результат, ВходящийКонтекст) Экспорт 
	
	Если Результат.Выполнено Тогда
		Сертификат = Новый Структура(ВходящийКонтекст.Сертификаты[ВходящийКонтекст.ТекущийСертификат]);
		Сертификат.Вставить("Сертификат", Base64Значение(Результат.СтрокаBase64));
		ВходящийКонтекст.Сертификаты[ВходящийКонтекст.ТекущийСертификат] = Сертификат;
	КонецЕсли;
	ВходящийКонтекст.ТекущийСертификат = ВходящийКонтекст.ТекущийСертификат + 1;
	СообщитьПользователюОКонфликтеКриптопровайдеровВыгрузитьСертификаты(ВходящийКонтекст);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОпределитьИмяОС_Windows(СтрокаОС, ВерсияОС)
	
	ИмяОС = "Unknown";
	
	Если ВерсияОС = "5.2" Тогда
		Если СтрНайти(СтрокаОС, "Windows XP Professional x64") Тогда 
			ИмяОС = "Windows XP Professional x64";
		ИначеЕсли СтрНайти(СтрокаОС, "Windows Server 2003") Тогда
			ИмяОС = "Windows Server 2003";
		ИначеЕсли СтрНайти(СтрокаОС, "Windows Server 2003 R2") Тогда
			ИмяОС = "Windows Server 2003 R2";
		КонецЕсли;
	Иначе
		ВерсииWindowsСерверные = Новый Соответствие;
		ВерсииWindowsСерверные.Вставить("6.0", "Windows Server 2008");
		ВерсииWindowsСерверные.Вставить("6.1", "Windows Server 2008 R2");
		ВерсииWindowsСерверные.Вставить("6.2", "Windows Server 2012");
		ВерсииWindowsСерверные.Вставить("6.3", "Windows Server 2012 R2");
		ВерсииWindowsСерверные.Вставить("10.0", "Windows Server 2016");
		
		ВерсииWindowsКлиентские = Новый Соответствие;
		ВерсииWindowsКлиентские.Вставить("5.1", "Windows XP");
		ВерсииWindowsКлиентские.Вставить("6.0", "Windows Vista");
		ВерсииWindowsКлиентские.Вставить("6.1", "Windows 7");
		ВерсииWindowsКлиентские.Вставить("6.2", "Windows 8");
		ВерсииWindowsКлиентские.Вставить("6.3", "Windows 8.1");
		ВерсииWindowsКлиентские.Вставить("10.0", "Windows 10");
		
		Если СтрНайти(СтрокаОС, "Server") Тогда
			Если ВерсииWindowsСерверные.Получить(ВерсияОС) <> Неопределено Тогда	
				ИмяОС = ВерсииWindowsСерверные.Получить(ВерсияОС);
			КонецЕсли;
		Иначе
			Если ВерсииWindowsКлиентские.Получить(ВерсияОС) <> Неопределено Тогда	
				ИмяОС = ВерсииWindowsКлиентские.Получить(ВерсияОС);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ИмяОС;

КонецФункции

Процедура ПоказатьПредупреждениеОКонфликтеКриптопровайдеров(Сертификаты, Криптопровайдеры)
	
	ПараметрыФормы = Новый Структура("Сертификаты,Криптопровайдеры", Сертификаты, Криптопровайдеры);
	ОткрытьФорму("ОбщаяФорма.ПредупреждениеОКонфликтеКриптопровайдеров", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти



