#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Задача.ВидЗадачи = Перечисления.ВидыЗадачСобытийКалендаря.ЗаполнениеДанных Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ДатаДокументаОбработкиСобытия"));
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Наименование = ""+ Задача + " (%1)";
	Наименование = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Наименование, ПредставлениеПериода(ДатаНачалаСобытия, КонецДня(ДатаОкончанияСобытия), "ФП=Истина"));
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ЭтотОбъект.ПометкаУдаления Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ЗаписиКалендаряПодготовкиОтчетности.Ссылка,
		|	ЗаписиКалендаряПодготовкиОтчетности.СобытиеКалендаря
		|ИЗ
		|	Справочник.ЗаписиКалендаряПодготовкиОтчетности КАК ЗаписиКалендаряПодготовкиОтчетности
		|ГДЕ
		|	ЗаписиКалендаряПодготовкиОтчетности.СобытиеКалендаря = &Задача");
		Запрос.УстановитьПараметр("Задача", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаписьКалендаря = Выборка.Ссылка.ПолучитьОбъект();
			ЗаписьКалендаря.УстановитьПометкуУдаления(Истина);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры


#КонецОбласти

#КонецЕсли