
&НаКлиенте
Процедура Подключить(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораИзМеню", ЭтотОбъект);
	СписокПользователей = ПолучитьСписокПользователей();
	
	Если СписокПользователей.Количество() > 1 Тогда
		ПоказатьВыборИзМеню(Оповещение, СписокПользователей);
	Иначе
		ОткрытьФорму("ПланОбмена.МобильноеПриложение.Форма.ФормаПодключения");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораИзМеню(ВыбранныйЭлемент, Параметры) Экспорт
	
	Если ВыбранныйЭлемент <> Неопределено И ЗначениеЗаполнено(ВыбранныйЭлемент.Значение) Тогда
		ОткрытьФорму("ПланОбмена.МобильноеПриложение.Форма.ФормаПодключения", Новый Структура("Пользователь", ВыбранныйЭлемент.Значение));
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьСписокПользователей()
	
	УстановитьПривилегированныйРежим(Истина);
	
	СписокПользователей = Новый СписокЗначений();
	
	ВыборкаПользователей = Справочники.Пользователи.Выбрать();
	
	Пока ВыборкаПользователей.Следующий() Цикл
		Если ВыборкаПользователей.Наименование <> "<Не указан>"
			И НЕ ВыборкаПользователей.Служебный
			И НЕ ВыборкаПользователей.Недействителен Тогда
			
			СтруктураВозврата = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ВыборкаПользователей.ИдентификаторПользователяИБ);
			
			Если СтруктураВозврата <> Неопределено Тогда
				Логин = СтруктураВозврата.Имя;
				СписокПользователей.Добавить(Логин, Логин,,БиблиотекаКартинок.Пользователь);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СписокПользователей;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "НастройкаМобильногоПриложенияГотово" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	
КонецПроцедуры
