#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ИдентификаторСессии = Параметры.ИдентификаторСессии;
	
	Если НЕ ЗначениеЗаполнено(Параметры.Телефон) Тогда
		Элементы.Телефон.Видимость = Ложь;
	КонецЕсли;
	Телефон = Параметры.Телефон;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	
	Если ПустаяСтрока(Пароль) Тогда
		ТекстСообщения = НСтр("ru = 'Для продолжения укажите одноразовый пароль.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Пароль");
		Возврат;
	КонецЕсли;
	
	Закрыть(Пароль);
	
КонецПроцедуры

#КонецОбласти
