
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Владелец) И 
		НЕ Объект.Владелец.ИспользоватьПартии Тогда
	
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Для номенклатуры не ведется учет по партиям!
							|Установите флаг ""Использовать партии"" в карточке номенклатуры'");
		Сообщение.Сообщить();
		Отказ = Истина;
		
	КонецЕсли;
	
	// Список доступных статусов.
	УстановитьСписокСтатусовПартий();
	
	ОтчетыУНФ.ПриСозданииНаСервереФормыСвязанногоОбъекта(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.Печать
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = УправлениеСвойствамиПереопределяемый.ЗаполнитьДополнительныеПараметры(Объект, "СтраницаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры // ОбработкаОповещения()

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры // ПриЧтенииНаСервере()

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Обработчик механизма "Свойства".
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры // ПередЗаписьюНаСервере()

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтаФорма, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры // ОбработкаПроверкиЗаполненияНаСервере()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура формирует список доступных статусов партий в зависимости от ФО и переданных параметров.
//
Процедура УстановитьСписокСтатусовПартий()
	
	Список = Элементы.Статус.СписокВыбора;
	Список.Очистить();
	
	ИспользованиеСтатусов = Новый Соответствие;
	ИспользованиеСтатусов.Вставить(Перечисления.СтатусыПартий.СобственныеЗапасы, Истина);
	ИспользованиеСтатусов.Вставить(Перечисления.СтатусыПартий.ТоварыНаКомиссии, Константы.ФункциональнаяОпцияПриемТоваровНаКомиссию.Получить());
	ИспользованиеСтатусов.Вставить(Перечисления.СтатусыПартий.ДавальческоеСырье, Константы.ФункциональнаяОпцияПереработкаДавальческогоСырья.Получить());
	ИспользованиеСтатусов.Вставить(Перечисления.СтатусыПартий.ОтветственноеХранение, Константы.ФункциональнаяОпцияПриемЗапасовНаОтветхранение.Получить());
	
	ОграничениеСтатусаПартий = Неопределено;
	Если НЕ Параметры.ЗначенияЗаполнения.Свойство("Статус", ОграничениеСтатусаПартий) Тогда
		Параметры.ДополнительныеПараметры.Свойство("ОграничениеСтатуса", ОграничениеСтатусаПартий);
	КонецЕсли;
	
	Если ОграничениеСтатусаПартий = Неопределено Тогда
		
		Для Каждого КлючИЗначение Из ИспользованиеСтатусов Цикл
			Если КлючИЗначение.Значение = Истина Тогда
				Список.Добавить(КлючИЗначение.Ключ);
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		Если (ТипЗнч(ОграничениеСтатусаПартий) = Тип("Массив") Или ТипЗнч(ОграничениеСтатусаПартий) = Тип("ФиксированныйМассив")) 
			И ОграничениеСтатусаПартий.Количество() > 0 Тогда
			
			Для Каждого Тип Из ОграничениеСтатусаПартий Цикл
				Если ИспользованиеСтатусов.Получить(Тип) <> Ложь Тогда
					Список.Добавить(Тип);
				КонецЕсли;
			КонецЦикла;
			
		ИначеЕсли ТипЗнч(ОграничениеСтатусаПартий) = Тип("ПеречислениеСсылка.СтатусыПартий") Тогда
			
			Если ИспользованиеСтатусов.Получить(ОграничениеСтатусаПартий) <> Ложь Тогда
				Список.Добавить(ОграничениеСтатусаПартий);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // УстановитьСписокСтатусовПартий()

#КонецОбласти

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
&НаКлиенте
Процедура Подключаемый_ВыполнитьНазначаемуюКоманду(Команда)
	Если НЕ ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьНазначаемуюКомандуНаКлиенте(ЭтаФорма, Команда.Имя) Тогда
		РезультатВыполнения = Неопределено;
		ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(Команда.Имя, РезультатВыполнения);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(ИмяЭлемента, РезультатВыполнения)
	ДополнительныеОтчетыИОбработки.ВыполнитьНазначаемуюКомандуНаСервере(ЭтаФорма, ИмяЭлемента, РезультатВыполнения);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_РедактироватьСоставСвойств(Команда)
	
	УправлениеСвойствамиКлиент.РедактироватьСоставСвойств(ЭтаФорма, Объект.Ссылка);
	
КонецПроцедуры // Подключаемый_РедактироватьСоставСвойств()

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма, РеквизитФормыВЗначение("Объект"));
	
КонецПроцедуры // ОбновитьЭлементыДополнительныхРеквизитов()

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти


