
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СтруктураПараметров = ПолучитьСтруктуруПараметров(ПараметрКоманды);
	ОткрытьФорму(
		"Справочник.Контрагенты.Форма.ФормаРедактированияСчетовУчета",
		СтруктураПараметров,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка
	);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруПараметров(ПараметрКоманды)
	
	СтруктураПараметров = Новый Структура(
		"СчетУчетаРасчетовСПокупателем, СчетУчетаАвансовПокупателя, СчетУчетаРасчетовСПоставщиком, СчетУчетаАвансовПоставщику, Ссылка",
		ПараметрКоманды.СчетУчетаРасчетовСПокупателем, ПараметрКоманды.СчетУчетаАвансовПокупателя, ПараметрКоманды.СчетУчетаРасчетовСПоставщиком, ПараметрКоманды.СчетУчетаАвансовПоставщику, ПараметрКоманды.Ссылка);
		
	Возврат СтруктураПараметров;
	
КонецФункции
