#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.Значение Тогда
		ПараметрыФункции = Новый Структура();
		УникальныйИдентификатор =Новый УникальныйИдентификатор("c38b4b34-6793-43ee-b541-0bd3158eacff");
		Результат = ДлительныеОперации.ЗапуститьВыполнениеВФоне(
			УникальныйИдентификатор,
			"РегламентированнаяОтчетностьУСН.УстановитьУчитыватьВНУВДокументах", 
			ПараметрыФункции, 
			НСтр("ru = 'Установка налогового учета для документов за текущий год'"));
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
