
Процедура АвтономнаяРаботаЗарегистрироватьИзменениеПередЗаписью(Источник, Отказ) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью("АвтономнаяРабота", Источник, Отказ);
	
КонецПроцедуры

Процедура АвтономнаяРаботаЗарегистрироватьИзменениеДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюДокумента("АвтономнаяРабота", Источник, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура АвтономнаяРаботаЗарегистрироватьИзменениеКонстантыПередЗаписью(Источник, Отказ) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюКонстанты("АвтономнаяРабота", Источник, Отказ);
	
КонецПроцедуры

Процедура АвтономнаяРаботаЗарегистрироватьИзменениеНабораЗаписейПередЗаписью(Источник, Отказ, Замещение) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюРегистра("АвтономнаяРабота", Источник, Отказ, Замещение);
	
КонецПроцедуры

Процедура АвтономнаяРаботаЗарегистрироватьУдалениеПередУдалением(Источник, Отказ) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередУдалением("АвтономнаяРабота", Источник, Отказ);
	
КонецПроцедуры


