#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура создает пустую временную таблицу изменения движений.
//
Процедура СоздатьПустуюВременнуюТаблицуИзменение(ДополнительныеСвойства) Экспорт
	
	Если НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
	 ИЛИ НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда	
		Возврат;		
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 0
	|	НДФЛРасчетыНалоговыхАгентовСБюджетом.НомерСтроки КАК НомерСтроки,
	|	НДФЛРасчетыНалоговыхАгентовСБюджетом.ВидДвижения КАК ВидДвижения,
	|	НДФЛРасчетыНалоговыхАгентовСБюджетом.Организация КАК Организация,
	|	НДФЛРасчетыНалоговыхАгентовСБюджетом.Сотрудник КАК Сотрудник,
	|	НДФЛРасчетыНалоговыхАгентовСБюджетом.ПериодРегистрации КАК ПериодРегистрации,
	|	НДФЛРасчетыНалоговыхАгентовСБюджетом.Сумма КАК СуммаПередЗаписью,
	|	НДФЛРасчетыНалоговыхАгентовСБюджетом.Сумма КАК СуммаИзменение,
	|	НДФЛРасчетыНалоговыхАгентовСБюджетом.Сумма КАК СуммаПриЗаписи
	|ПОМЕСТИТЬ ДвиженияНДФЛРасчетыНалоговыхАгентовСБюджетомИзменение
	|ИЗ
	|	РегистрНакопления.НДФЛРасчетыНалоговыхАгентовСБюджетом КАК НДФЛРасчетыНалоговыхАгентовСБюджетом");
	
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураВременныеТаблицы.Вставить("ДвиженияНДФЛРасчетыНалоговыхАгентовСБюджетомИзменение", Ложь);
	
КонецПроцедуры // СоздатьПустуюВременнуюТаблицуИзменение()

#КонецОбласти

#КонецЕсли