#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура создает пустую временную таблицу изменения движений.
//
Процедура СоздатьПустуюВременнуюТаблицуИзменение(ДополнительныеСвойства) Экспорт
	
	Если НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
	 ИЛИ НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 0
	|	КнигаУчетаДоходовИРасходов.НомерСтроки,
	|	КнигаУчетаДоходовИРасходов.Организация,
	|	КнигаУчетаДоходовИРасходов.ВидЗаписи,
	|	КнигаУчетаДоходовИРасходов.ДоходВсего КАК ДоходВсегоПередЗаписью,
	|	КнигаУчетаДоходовИРасходов.ДоходВсего КАК ДоходВсегоИзменение,
	|	КнигаУчетаДоходовИРасходов.ДоходВсего КАК ДоходВсегоПриЗаписи,
	|	КнигаУчетаДоходовИРасходов.ДоходБаза КАК ДоходБазаПередЗаписью,
	|	КнигаУчетаДоходовИРасходов.ДоходБаза КАК ДоходБазаИзменение,
	|	КнигаУчетаДоходовИРасходов.ДоходБаза КАК ДоходБазаПриЗаписи,
	|	КнигаУчетаДоходовИРасходов.РасходВсего КАК РасходВсегоПередЗаписью,
	|	КнигаУчетаДоходовИРасходов.РасходВсего КАК РасходВсегоИзменение,
	|	КнигаУчетаДоходовИРасходов.РасходВсего КАК РасходВсегоПриЗаписи,
	|	КнигаУчетаДоходовИРасходов.РасходБаза КАК РасходБазаПередЗаписью,
	|	КнигаУчетаДоходовИРасходов.РасходБаза КАК РасходБазаИзменение,
	|	КнигаУчетаДоходовИРасходов.РасходБаза КАК РасходБазаПриЗаписи
	|ПОМЕСТИТЬ ДвиженияКнигаУчетаДоходовИРасходовИзменение
	|ИЗ
	|	РегистрНакопления.КнигаУчетаДоходовИРасходов КАК КнигаУчетаДоходовИРасходов");
	
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураВременныеТаблицы.Вставить("ДвиженияКнигаУчетаДоходовИРасходовИзменение", Ложь);
	
КонецПроцедуры // СоздатьПустуюВременнуюТаблицуИзменение()

#КонецОбласти

#КонецЕсли