
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресДереваКонтрагентов = Параметры.АдресДереваКонтрагентов;
	
	Параметры.Свойство("ГруппаДоступа", Объект.ГруппаДоступа);
	
	Если ЗначениеЗаполнено(АдресДереваКонтрагентов) Тогда
		ДеревоКонтрагентов = ПолучитьИзВременногоХранилища(АдресДереваКонтрагентов);
		ЗначениеВРеквизитФормы(ДеревоКонтрагентов, "ТаблицаКонтрагентов");
		Заголовок = Параметры.Заголовок;
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Таблица контрагентов не содержит данных. Попробуйте обновить данные из файла с банковской выпиской.";
		Сообщение.Сообщить();
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик команды СоздатьКонтрагентов.
//
&НаКлиенте
Процедура СоздатьКонтрагентов(Команда)
	
	СоздатьНовогоКонтрагента();
	
	ОповеститьОВыборе(Новый Структура("БылиСозданыКонтрагенты", Истина));
	
КонецПроцедуры // СоздатьКонтрагентов()

// Процедура создает нового контрагента.
//
&НаСервере
Процедура СоздатьНовогоКонтрагента()
	
	Для каждого Элемент Из ТаблицаКонтрагентов.ПолучитьЭлементы() Цикл
		
		Если Элемент.Загружать Тогда
			РеквизитФормыВЗначение("Объект").СоздатьКонтрагента(Элемент).Пустая();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // СоздатьНовогоКонтрагента()

// Процедура - обработчик команды НеНайденныеРеквизитыЗагрузкаОтметитьВсе.
//
&НаКлиенте
Процедура НеНайденныеРеквизитыЗагрузкаОтметитьВсе(Команда)
	
	УстановитьФлаги(ТаблицаКонтрагентов.ПолучитьЭлементы(), "Загружать", Истина, Ложь);
	
КонецПроцедуры // НеНайденныеРеквизитыЗагрузкаОтметитьВсе()

// Процедура - обработчик команды НеНайденныеРеквизитыСнятьОтметкуУВсех.
//
&НаКлиенте
Процедура НеНайденныеРеквизитыСнятьОтметкуУВсех(Команда)
	
	УстановитьФлаги(ТаблицаКонтрагентов.ПолучитьЭлементы(), "Загружать", Ложь, Ложь);
	
КонецПроцедуры // НеНайденныеРеквизитыСнятьОтметкуУВсех()

// Процедура устанавливает флаги.
//
&НаКлиенте
Процедура УстановитьФлаги(Таблица, Поле, ЗначениеФлага, ЗаполнятьСуммы)
	
	Для каждого Строка Из Таблица Цикл
		Строка[Поле] = ЗначениеФлага;
	КонецЦикла;
	
КонецПроцедуры // УстановитьФлаги()

