#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура УстановитьЗначенияТарифовСтраховыхВзносов2011_2012()Экспорт
	
	Справочники.ВидыТарифовСтраховыхВзносов.ЗаполнитьСправочникВидыТарифовСтраховыхВзносов();
	Справочники.ВидыТарифовСтраховыхВзносов.ЗаполнитьКодыВидовТарифаСтраховыхВзносов_2012();
	
	НаборЗаписей = РегистрыСведений.ТарифыСтраховыхВзносов.СоздатьНаборЗаписей();
	
	ОбщийНалоговыйРежим = РегламентированнаяОтчетностьПереопределяемый.СсылкаНаОбъектПоИдентификатору("Справочник.ВидыТарифовСтраховыхВзносов", "ОбщийНалоговыйРежим");	
	
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20100101',ОбщийНалоговыйРежим,
			20.0,	6.0,	2.9,	1.1,	2.0);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС, ТФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20110101',ОбщийНалоговыйРежим,
			26.0,	6.0,	2.9,	3.1,	2.0);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС, ТФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20120101',ОбщийНалоговыйРежим,
			22.0,	6.0,	2.9,	5.1, 0);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20140101',ОбщийНалоговыйРежим,
			22.0,	0.0,	2.9,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20200101',ОбщийНалоговыйРежим,
			26.0,	0.0,	2.9,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС
	
	УпрощенныйНалоговыйРежим = РегламентированнаяОтчетностьПереопределяемый.СсылкаНаОбъектПоИдентификатору("Справочник.ВидыТарифовСтраховыхВзносов", "УпрощенныйНалоговыйРежим");	
	
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20100101',УпрощенныйНалоговыйРежим,
			14.0,	6.0,	0.0,	0.0,	0);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС, ТФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20110101',УпрощенныйНалоговыйРежим,
			26.0,	6.0,	2.9,	3.1,	2.0);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС, ТФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20120101',УпрощенныйНалоговыйРежим,
			22.0,	6.0,	2.9,	5.1, 0);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20140101',УпрощенныйНалоговыйРежим,
			22.0,	0.0,	2.9,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20200101',УпрощенныйНалоговыйРежим,
			26.0,	0.0,	2.9,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС
	
	ЕНВД = РегламентированнаяОтчетностьПереопределяемый.СсылкаНаОбъектПоИдентификатору("Справочник.ВидыТарифовСтраховыхВзносов", "ЕНВД");
	
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20100101',ЕНВД,
			14.0,	6.0,	0.0,	0.0,	0.0);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС, ТФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20110101',ЕНВД,
			26.0,	6.0,	2.9,	3.1,	2.0);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС, ТФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20120101',ЕНВД,
			22.0,	6.0,	2.9,	5.1, 0);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20140101',ЕНВД,
			22.0,	0.0,	2.9,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20200101',ЕНВД,
			26.0,	0.0,	2.9,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС
	
	СельХозПроизводители = РегламентированнаяОтчетностьПереопределяемый.СсылкаНаОбъектПоИдентификатору("Справочник.ВидыТарифовСтраховыхВзносов", "СельХозПроизводители");
	
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20100101',СельХозПроизводители,
			15.8,	6.0,	1.9,	1.1,	1.2);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС, ТФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20110101',СельХозПроизводители,
			16.0,	6.0,	1.9,	1.1,	1.2);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС, ТФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20120101',СельХозПроизводители,
			16.0,	6.0,	1.9,	2.3, 0);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20130101',СельХозПроизводители,
			21.0,	6.0,	2.4,	3.7, 0);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20140101',СельХозПроизводители,
			21.0,	0.0,	2.4,	3.7);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20150101',СельХозПроизводители,
			22.0,	0.0,	2.9,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС

	ЕСХН = РегламентированнаяОтчетностьПереопределяемый.СсылкаНаОбъектПоИдентификатору("Справочник.ВидыТарифовСтраховыхВзносов", "ЕСХН");
	
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20100101',ЕСХН,
			10.3,	6.0,	0.0,	0.0,	0.0);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС, ТФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20110101',ЕСХН,
			16.0,	6.0,	1.9,	1.1,	1.2);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС, ТФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20120101',ЕСХН,
			16.0,	6.0,	1.9,	2.3, 0);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20130101',ЕСХН,
			21.0,	6.0,	2.4,	3.7, 0);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20140101',ЕСХН,
			21.0,	0.0,	2.4,	3.7);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20150101',ЕСХН,
			22.0,	0.0,	2.9,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС
	
	НародныеХудожественныеПромыслы = РегламентированнаяОтчетностьПереопределяемый.СсылкаНаОбъектПоИдентификатору("Справочник.ВидыТарифовСтраховыхВзносов", "НародныеХудожественныеПромыслы");		

	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20110101',НародныеХудожественныеПромыслы,
			16.0,	6.0,	1.9,	1.1,	1.2);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС, ТФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20120101',НародныеХудожественныеПромыслы,
			16.0,	6.0,	1.9,	2.3, 0);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20130101',НародныеХудожественныеПромыслы,
			21.0,	6.0,	2.4,	3.7, 0);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20140101',НародныеХудожественныеПромыслы,
			21.0,	0.0,	2.4,	3.7);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20150101',НародныеХудожественныеПромыслы,
			22.0,	0.0,	2.9,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС
			
	ОрганизацияИнвалидов = РегламентированнаяОтчетностьПереопределяемый.СсылкаНаОбъектПоИдентификатору("Справочник.ВидыТарифовСтраховыхВзносов", "ОрганизацияИнвалидов");
	
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20100101',ОрганизацияИнвалидов,
			14.0,	6.0,	0.0,	0.0,	0.0);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС, ТФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20110101',ОрганизацияИнвалидов,
			16.0,	6.0,	1.9,	1.1,	1.2);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС, ТФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20120101',ОрганизацияИнвалидов,
			16.0,	6.0,	1.9,	2.3, 0);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20130101',ОрганизацияИнвалидов,
			21.0,	6.0,	2.4,	3.7, 0);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20140101',ОрганизацияИнвалидов,
			21.0,	0.0,	2.4,	3.7);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20150101',ОрганизацияИнвалидов,
			22.0,	0.0,	2.9,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС
	
	РезидентТехникоВнедренческойЗоны = РегламентированнаяОтчетностьПереопределяемый.СсылкаНаОбъектПоИдентификатору("Справочник.ВидыТарифовСтраховыхВзносов", "РезидентТехникоВнедренческойЗоны");
		
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20100101',РезидентТехникоВнедренческойЗоны,
			14.0,	6.0,	0.0,	0.0,	0.0);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС, ТФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20110101',РезидентТехникоВнедренческойЗоны,
			 8.0,	6.0,	2.0,	2.0,	2.0);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС, ТФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20120101',РезидентТехникоВнедренческойЗоны,
			 8.0,	6.0,	2.0,	4.0, 0);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20140101',РезидентТехникоВнедренческойЗоны,
			 8.0,	0.0,	2.0,	4.0);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20180101',РезидентТехникоВнедренческойЗоны,
			13.0,	0.0,	2.9,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20190101',РезидентТехникоВнедренческойЗоны,
			20.0,	0.0,	2.9,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20200101',РезидентТехникоВнедренческойЗоны,
			26.0,	0.0,	2.9,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС
	
	ITОрганизации = РегламентированнаяОтчетностьПереопределяемый.СсылкаНаОбъектПоИдентификатору("Справочник.ВидыТарифовСтраховыхВзносов", "ITОрганизации");
	
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20100101',ITОрганизации,
			14.0,	6.0,	0.0,	0.0,	0.0);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС, ТФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20110101',ITОрганизации,
			 8.0,	6.0,	2.0,	2.0,	2.0);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС, ТФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20120101',ITОрганизации,
			 8.0,	6.0,	2.0,	4.0, 0);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20140101',ITОрганизации,
			 8.0,	0.0,	2.0,	4.0);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20240101',ITОрганизации,
			26.0,	0.0,	2.9,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС
	
	ХозОбществаБюджетныхВУЗов = РегламентированнаяОтчетностьПереопределяемый.СсылкаНаОбъектПоИдентификатору("Справочник.ВидыТарифовСтраховыхВзносов", "ХозОбществаБюджетныхВУЗов");
		
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20100101',ХозОбществаБюджетныхВУЗов,
			 0.0,	0.0,	0.0,	0.0,	0.0);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС, ТФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20110101',ХозОбществаБюджетныхВУЗов,
			 8.0,	6.0,	2.0,	2.0,	2.0);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС, ТФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20120101',ХозОбществаБюджетныхВУЗов,
			 8.0,	6.0,	2.0,	4.0, 0);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20140101',ХозОбществаБюджетныхВУЗов,
			 8.0,	0.0,	2.0,	4.0);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20180101',ХозОбществаБюджетныхВУЗов,
			13.0,	0.0,	2.9,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20190101',ХозОбществаБюджетныхВУЗов,
			20.0,	0.0,	2.9,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20200101',ХозОбществаБюджетныхВУЗов,
			26.0,	0.0,	2.9,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС
	
	СМИ = РегламентированнаяОтчетностьПереопределяемый.СсылкаНаОбъектПоИдентификатору("Справочник.ВидыТарифовСтраховыхВзносов", "СМИ");
	
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20100101',СМИ,
			 0.0,	0.0,	0.0,	0.0,	0.0);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС, ТФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20110101',СМИ,
			20.0,	6.0,	2.9,	1.1,	2.0);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС, ТФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20120101',СМИ,
			20.8,	6.0,	2.9,	3.3, 0);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20130101',СМИ,
			21.6,	6.0,	2.9,	3.5, 0);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20140101',СМИ,
			23.2,	0.0,	2.9,	3.9);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20150101',СМИ,
			22.0,	0.0,	2.9,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20200101',СМИ,
			26.0,	0.0,	2.9,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	
	УпрощенныйНалоговыйРежимПроизводство = РегламентированнаяОтчетностьПереопределяемый.СсылкаНаОбъектПоИдентификатору("Справочник.ВидыТарифовСтраховыхВзносов", "УпрощенныйНалоговыйРежимПроизводство");
		
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20100101',УпрощенныйНалоговыйРежимПроизводство,
			14.0,	6.0,	0.0,	0.0,	0.0);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС, ТФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20110101',УпрощенныйНалоговыйРежимПроизводство,
			18.0,	6.0,	2.9,	3.1,	2.0);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС, ТФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20120101',УпрощенныйНалоговыйРежимПроизводство,
			20.0,	6.0, 0, 0, 0);	// ПФР (всего), ПФРНакопительная
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20140101',УпрощенныйНалоговыйРежимПроизводство,
			20.0,	0.0);	// ПФР (всего), ПФРНакопительная
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20190101',УпрощенныйНалоговыйРежимПроизводство,
			22.0,	0.0,	2.9,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20200101',УпрощенныйНалоговыйРежимПроизводство,
			26.0,	0.0,	2.9,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	
	ДляЧленовЭкипажейМорскихСудовПодФлагомРФ = РегламентированнаяОтчетностьПереопределяемый.СсылкаНаОбъектПоИдентификатору("Справочник.ВидыТарифовСтраховыхВзносов", "ДляЧленовЭкипажейМорскихСудовПодФлагомРФ");
	
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20120101',ДляЧленовЭкипажейМорскихСудовПодФлагомРФ,
			 0, 0, 0, 0, 0);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС, ТФОМС - не взимаются
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20280101',ДляЧленовЭкипажейМорскихСудовПодФлагомРФ,
			26.0,	0.0,	2.9,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС

	ДляФармацевтовАптек = РегламентированнаяОтчетностьПереопределяемый.СсылкаНаОбъектПоИдентификатору("Справочник.ВидыТарифовСтраховыхВзносов", "ДляФармацевтовАптек");
		
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20120101',ДляФармацевтовАптек,
			20.0,	6.0, 0, 0, 0);	// ПФР (всего), ПФРНакопительная
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20140101',ДляФармацевтовАптек,
			20.0,	0.0);	// ПФР (всего), ПФРНакопительная
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20190101',ДляФармацевтовАптек,
			22.0,	0.0,	2.9,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20200101',ДляФармацевтовАптек,
			26.0,	0.0,	2.9,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	
	НекоммерческиеОрганизации = РегламентированнаяОтчетностьПереопределяемый.СсылкаНаОбъектПоИдентификатору("Справочник.ВидыТарифовСтраховыхВзносов", "НекоммерческиеОрганизации");
		
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20120101',НекоммерческиеОрганизации,
			20.0,	6.0, 0, 0, 0);	// ПФР (всего), ПФРНакопительная
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20140101',НекоммерческиеОрганизации,
			20.0,	0.0);	// ПФР (всего), ПФРНакопительная
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20190101',НекоммерческиеОрганизации,
			22.0,	0.0,	2.9,	1.8,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20200101',НекоммерческиеОрганизации,
	26.0,	0.0,	2.9,	1.8,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	
	БлаготворительныеОрганизации = РегламентированнаяОтчетностьПереопределяемый.СсылкаНаОбъектПоИдентификатору("Справочник.ВидыТарифовСтраховыхВзносов", "БлаготворительныеОрганизации");
		
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20120101',БлаготворительныеОрганизации,
			20.0,	6.0, 0, 0, 0);	// ПФР (всего), ПФРНакопительная
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20140101',БлаготворительныеОрганизации,
			20.0,	0.0);	// ПФР (всего), ПФРНакопительная
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20190101',БлаготворительныеОрганизации,
			26.0,	0.0,	2.9,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС
			
	ОрганизацииОказывающиеИнжиниринговыеУслуги = РегламентированнаяОтчетностьПереопределяемый.СсылкаНаОбъектПоИдентификатору("Справочник.ВидыТарифовСтраховыхВзносов", "ОрганизацииОказывающиеИнжиниринговыеУслуги");
		
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20120101',ОрганизацииОказывающиеИнжиниринговыеУслуги,
			22.0,	6.0,	2.9,	5.1, 0);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20140101',ОрганизацииОказывающиеИнжиниринговыеУслуги,
			22.0,	0.0,	2.9,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20200101',ОрганизацииОказывающиеИнжиниринговыеУслуги,
			26.0,	0.0,	2.9,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС

	УчастникПроектаИнновационныйЦентрСколково = РегламентированнаяОтчетностьПереопределяемый.СсылкаНаОбъектПоИдентификатору("Справочник.ВидыТарифовСтраховыхВзносов", "УчастникПроектаИнновационныйЦентрСколково");
		
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20100101',УчастникПроектаИнновационныйЦентрСколково,
			14.0,	6.0);	// ПФР (всего), ПФРНакопительная
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20140101',УчастникПроектаИнновационныйЦентрСколково,
			14.0,	0.0);	// ПФР (всего), ПФРНакопительная
	
	ИндивидуальныйПредпринимательПрименяющийПатент = РегламентированнаяОтчетностьПереопределяемый.СсылкаНаОбъектПоИдентификатору("Справочник.ВидыТарифовСтраховыхВзносов", "ИндивидуальныйПредпринимательПрименяющийПатент");
	
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20130101',ИндивидуальныйПредпринимательПрименяющийПатент,
			20.0,	6.0);	// ПФР (всего), ПФРНакопительная
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20140101',ИндивидуальныйПредпринимательПрименяющийПатент,
			20.0,	0.0);	// ПФР (всего), ПФРНакопительная
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20190101',ИндивидуальныйПредпринимательПрименяющийПатент,
			22.0,	0.0,	2.9,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20200101',ИндивидуальныйПредпринимательПрименяющийПатент,
			26.0,	0.0,	2.9,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	
	УчастникОсобойЗоныВКрыму = РегламентированнаяОтчетностьПереопределяемый.СсылкаНаОбъектПоИдентификатору("Справочник.ВидыТарифовСтраховыхВзносов", "УчастникОсобойЗоныВКрыму");
	
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,'20150101',УчастникОсобойЗоныВКрыму,
			6.0,	0.0,	1.5,	0.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФФОМС
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,ДатаСведений,ВидТарифа,ПФР = 0,ПФРНакопительная = 0,ФСС = 0,ФФОМС = 0,ТФОМС = 0)

    НоваяСтрока = НаборЗаписей.Добавить();
	НоваяСтрока.Период = ДатаСведений;
	НоваяСтрока.ВидТарифа = ВидТарифа;
	НоваяСтрока.ПФР = ПФР;
	НоваяСтрока.ПФРНакопительная = ПФРНакопительная;
	НоваяСтрока.ФСС = ФСС;
	НоваяСтрока.ТФОМС = ТФОМС;
	НоваяСтрока.ФФОМС = ФФОМС;

КонецПроцедуры

#КонецЕсли