
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СтруктураПараметров = ПолучитьСтруктуруПараметров(ПараметрКоманды);
	ОткрытьФорму(
		"Справочник.ВидыНачисленийИУдержаний.Форма.ФормаРедактированияСчетовУчета",
		СтруктураПараметров,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка
	);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруПараметров(ПараметрКоманды)
	
	СтруктураПараметров = Новый Структура(
		"СчетЗатрат, Ссылка",
		ПараметрКоманды.СчетЗатрат, ПараметрКоманды.Ссылка);
		
	Возврат СтруктураПараметров;
	
КонецФункции
