
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗначениеВРеквизитФормы(ДанныеФормыВЗначение(Параметры.ДеревоВидовОпераций, Тип("ДеревоЗначений")), "ДеревоЗначений");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДеревоЗначенийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Выбрать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Выбрать()
	
	Если ТипЗнч(Элементы.ДеревоЗначений.ТекущиеДанные.ВидОперации) = Тип("Строка") Тогда
		ПоказатьПредупреждение(Неопределено, "Выберите операцию (не группу)");
	Иначе
		Закрыть(Элементы.ДеревоЗначений.ТекущиеДанные.ВидОперации);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
