
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ssl = Новый ЗащищенноеСоединениеOpenSSL(
	Новый СертификатКлиентаWindows(),
	Новый СертификатыУдостоверяющихЦентровWindows()); 
	
	Соединение = Новый HTTPСоединение("www.bitrix24.com",,,, ПолучитьПрокси(),,ssl);	
				 
	ИмяФайлаОтвета = ПолучитьИмяВременногоФайла();
	
	Попытка
	
		HTTPОтвет 	= Соединение.Получить("1c_version.php", ИмяФайлаОтвета);
		
	Исключение
		
		Сообщить("Не удалось получить данные с сервера. Проверьте настройки подключения к Интернет.")
		
	КонецПопытки;
	
	СтрАктуальнойВерсии = ПолучитьСтруктуруАктуальнойВерсиейМодуля(ИмяФайлаОтвета);
	
	ТекущаяВерсияМодуляЧ 	= Число(ПолучитьВерсиюМодуля());	
	АктуальнаяВерсияМодуляЧ = Число(СтрАктуальнойВерсии.ВерсияМодуля);	
	
	Если АктуальнаяВерсияМодуляЧ > ТекущаяВерсияМодуляЧ тогда
		
		стрПараметры = Новый Структура;
		стрПараметры.Вставить("ИнформацияООбновлении", СтрАктуальнойВерсии);
		
		ОткрытьФорму("ОбщаяФорма.Б_Битрикс24_1С_ФормаИнформацииООбновленииБ24", стрПараметры,,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	Иначе
		ПоказатьПредупреждение(, "У Вас установлена последняя версия модуля 'Битрикс 24 CRM + 1С'",, "Битрикс 24 CRM + 1С");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПрокси()
	
	НастройкаПроксиСервера = ПолучениеФайловИзИнтернета.НастройкиПроксиНаСервере();
	
	Если НастройкаПроксиСервера <> Неопределено
		И НастройкаПроксиСервера["ИспользоватьПрокси"] = Ложь Тогда
		НастройкаПроксиСервера = Неопределено;
	КонецЕсли;
	
	Протокол = "https";
	Прокси = ?(НастройкаПроксиСервера = Неопределено, Неопределено, Б_Битрикс24_1С_Сервер.ПолучитьПрокси(НастройкаПроксиСервера, Протокол));

	Возврат Прокси;

КонецФункции

&НаСервере
Функция ПолучитьСтруктуруАктуальнойВерсиейМодуля(ИмяФайлаОтвета)
	
	ТзнВерсииМодулей = Б_Битрикс24_1С_Сервер.РазобратьФайлСАктуальнымиВерсиямиМодулей(ИмяФайлаОтвета);
	//Обработка таблицы с версиями
	лНазваниеМодуля			= "B24+1C";                                                                      
	лНазваниеКонфигурации 	= Б_Битрикс24_1С_Сервер.ПолучитьСлужебноеНазваниеКонфигурации();
	
	НайденныеСтроки = ТзнВерсииМодулей.НайтиСтроки(Новый Структура("НаименованиеКонфигурации, НаименованиеМодуля", лНазваниеКонфигурации, лНазваниеМодуля));
	
	СтрСВерсией = Новый Структура;
	СтрСВерсией.Вставить("НаименованиеКонфигурации","");	
	СтрСВерсией.Вставить("РелизКонфигурации","");	
	СтрСВерсией.Вставить("НаименованиеМодуля","");	
	СтрСВерсией.Вставить("ВерсияМодуля","0");	
	СтрСВерсией.Вставить("Адрес","");	
	
	Если НайденныеСтроки.Количество()>0 тогда
		
		СтрСВерсией.НаименованиеКонфигурации= НайденныеСтроки[0].НаименованиеКонфигурации;
		СтрСВерсией.РелизКонфигурации 		= НайденныеСтроки[0].РелизКонфигурации;
		СтрСВерсией.НаименованиеМодуля 		= НайденныеСтроки[0].НаименованиеМодуля;
		СтрСВерсией.ВерсияМодуля 			= НайденныеСтроки[0].ВерсияМодуля;
		СтрСВерсией.Адрес 					= НайденныеСтроки[0].Адрес;
		
	КонецЕсли;
	
	Возврат СтрСВерсией;
	
КонецФункции

&НаСервере
Функция ПолучитьВерсиюМодуля()
	Возврат Б_Битрикс24_1С_Сервер.Версия();
КонецФункции
