
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеФормой();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура БиллингПокрываетПотребностиПриИзменении(Элемент)
	
	УправлениеФормой();
	Если Элементы.ПричинаОтказа.Видимость Тогда
		ТекущийЭлемент = Элементы.ПричинаОтказа;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СхемаРаботыБиллингаПриИзменении(Элемент)
	
	УправлениеФормой();
	Если Элементы.СхемаРаботыБиллингаДругой.Видимость Тогда
		ЭтотОбъект.ТекущийЭлемент = Элементы.СхемаРаботыБиллингаДругой;
	Иначе
		ТекущийЭлемент = Элементы.СхемаРаботыБиллинга;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КакОтражаетсяАбонплатаПриИзменении(Элемент)
	
	УправлениеФормой();
	Если Элементы.КакОтражаетсяАбонплатаПочемуНеАвтоматически.Видимость Тогда
		ТекущийЭлемент = Элементы.КакОтражаетсяАбонплатаПочемуНеАвтоматически;
	Иначе
		ТекущийЭлемент = Элементы.КакОтражаетсяАбонплата;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КакимиДокументамиФиксируютсяДополнительныеРаботыПриИзменении(Элемент)
	
	УправлениеФормой();
	Если Элементы.КакимиДокументамиФиксируютсяДополнительныеРаботыДругой.Видимость Тогда
		ТекущийЭлемент = Элементы.КакимиДокументамиФиксируютсяДополнительныеРаботыДругой;
	Иначе
		ТекущийЭлемент = Элементы.КакимиДокументамиФиксируютсяДополнительныеРаботы;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СценарийВыставленияСчетов5ПриИзменении(Элемент)
	
	УправлениеФормой();
	Если Элементы.ЧастотаВыставленияСчетовДругой.Видимость Тогда
		ТекущийЭлемент = Элементы.ЧастотаВыставленияСчетовДругой;
	Иначе
		ТекущийЭлемент = Элементы.ЧастотаВыставленияСчетов;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокВыставленияСчетов4ПриИзменении(Элемент)
	
	УправлениеФормой();
	Если Элементы.ПорядокВыставленияСчетовДругой.Видимость Тогда
		ТекущийЭлемент = Элементы.ПорядокВыставленияСчетовДругой;
	Иначе
		ТекущийЭлемент = Элементы.ПорядокВыставленияСчетов;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользуетсяАвтоматическаяОтправкаДокументовНаПочтуПриИзменении(Элемент)
	
	УправлениеФормой();
	Если ИспользуетсяАвтоматическаяОтправкаДокументовНаПочту = Элементы.ИспользуетсяАвтоматическаяОтправкаДокументовНаПочту.СписокВыбора[0].Значение Тогда
		ТекущийЭлемент = Элементы.ИспользуетсяАвтоматическаяОтправкаДокументовАкты;
	Иначе
		ТекущийЭлемент = Элементы.ИспользуетсяАвтоматическаяОтправкаДокументовНаПочту;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НачатьОпрос(Команда)
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОпрос;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтказатьсяОтОпроса(Команда)
	
	ЗавершитьРаботуСОпросом();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакончитьОпрос(Команда)
	
	ТекстПисьма = СформироватьТекст();
	
	Получатель = Новый СписокЗначений;
	Получатель.Добавить("sbm@1c.ru", "Фирма 1С");
	
	ПараметрыПисьма = Новый Структура;
	ПараметрыПисьма.Вставить("Получатель", Получатель);
	ПараметрыПисьма.Вставить("Тема", "Опрос по биллингу");
	ПараметрыПисьма.Вставить("Текст", ТекстПисьма);
	
	ОП = Новый ОписаниеОповещения("ПослеОтправкиПисьма", ЭтотОбъект);
	РаботаСПочтовымиСообщениямиКлиент.СоздатьНовоеПисьмо(ПараметрыПисьма, ОП);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакончитьОпросПозже(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеФормой()
	
	Элементы.ПричинаОтказа.Видимость = (БиллингПокрываетПотребности = Элементы.БиллингПокрываетПотребности.СписокВыбора[1].Значение);
	
	Элементы.СхемаРаботыБиллингаДругой.Видимость = (СхемаРаботыБиллинга = Элементы.СхемаРаботыБиллинга.СписокВыбора[3].Значение);
	Элементы.КакОтражаетсяАбонплатаПочемуНеАвтоматически.Видимость = (КакОтражаетсяАбонплата = Элементы.КакОтражаетсяАбонплата.СписокВыбора[1].Значение);
	Элементы.КакимиДокументамиФиксируютсяДополнительныеРаботыДругой.Видимость = (КакимиДокументамиФиксируютсяДополнительныеРаботы = Элементы.КакимиДокументамиФиксируютсяДополнительныеРаботы.СписокВыбора[2].Значение);
	Элементы.ЧастотаВыставленияСчетовДругой.Видимость = ЧастотаВыставленияСчетов3;
	
	Элементы.ПорядокВыставленияСчетовДругой.Видимость = ПорядокВыставленияСчетов4;
	
	Элементы.ИспользуетсяАвтоматическаяОтправкаДокументовАкты.Видимость = (ИспользуетсяАвтоматическаяОтправкаДокументовНаПочту = Элементы.ИспользуетсяАвтоматическаяОтправкаДокументовНаПочту.СписокВыбора[0].Значение);
	Элементы.ИспользуетсяАвтоматическаяОтправкаДокументовСчета.Видимость = (ИспользуетсяАвтоматическаяОтправкаДокументовНаПочту = Элементы.ИспользуетсяАвтоматическаяОтправкаДокументовНаПочту.СписокВыбора[0].Значение);
	Элементы.ИспользуетсяАвтоматическаяОтправкаДокументовСчетаФактуры.Видимость = (ИспользуетсяАвтоматическаяОтправкаДокументовНаПочту = Элементы.ИспользуетсяАвтоматическаяОтправкаДокументовНаПочту.СписокВыбора[0].Значение);
	
КонецПроцедуры

Функция СформироватьТекст()
	
	ТекстПисьма = СтрШаблон(
		"Вид бизнеса: %1
		|Покрывает ли биллинг потребности? %2
		|Клиенты: %3
		|Схема работы биллинга: %4
		|Как отражается абонплата: %5
		|Какими документами фиксируются дополнительные работы: %6
		|Как выставляется абонплата и дополнительные работы: %7
		|Частота выставления счетов: %8
		|Порядок выставления счетов: %9
		|Отправка пакета документов по почте: %10",
		ВидБизнеса,
		БиллингПокрываетПотребности + ?(БиллингПокрываетПотребности = Элементы.БиллингПокрываетПотребности.СписокВыбора[1].Значение, " (" + ПричинаОтказа + ")", ""),
		?(ВашиКлиентыФизическиеЛица, Элементы.ВашиКлиентыФизическиеЛица.Заголовок, "") + ?(ВашиКлиентыФизическиеЛица И ВашиКлиентыЮридическиеЛица, ", ", "") + ?(ВашиКлиентыЮридическиеЛица, Элементы.ВашиКлиентыЮридическиеЛица.Заголовок, ""),
		СхемаРаботыБиллинга + ?(СхемаРаботыБиллинга = Элементы.СхемаРаботыБиллинга.СписокВыбора[3].Значение, " (" + СхемаРаботыБиллингаДругой + ")", ""),
		КакОтражаетсяАбонплата + ?(КакОтражаетсяАбонплата = Элементы.КакОтражаетсяАбонплата.СписокВыбора[1].Значение, " (" + КакОтражаетсяАбонплатаПочемуНеАвтоматически + ")", ""),
		КакимиДокументамиФиксируютсяДополнительныеРаботы + ?(КакимиДокументамиФиксируютсяДополнительныеРаботы = Элементы.КакимиДокументамиФиксируютсяДополнительныеРаботы.СписокВыбора[2].Значение, " (" + КакимиДокументамиФиксируютсяДополнительныеРаботыДругой + ")", ""),
		КакВыставляетсяАбонплатаИДопРаботы,
		?(ЧастотаВыставленияСчетов1, Элементы.ЧастотаВыставленияСчетов1.Заголовок, "") + ?(ЧастотаВыставленияСчетов1 И ЧастотаВыставленияСчетов2, ", ", "") + ?(ЧастотаВыставленияСчетов2, Элементы.ЧастотаВыставленияСчетов2.Заголовок, "") + ?((ЧастотаВыставленияСчетов1 ИЛИ ЧастотаВыставленияСчетов2) И ЧастотаВыставленияСчетов3, ", ", "") + ?(ЧастотаВыставленияСчетов3, Элементы.ЧастотаВыставленияСчетов3.Заголовок + " (" + ЧастотаВыставленияСчетовДругой + ")", ""),
		?(ПорядокВыставленияСчетов1, Элементы.ПорядокВыставленияСчетов1.Заголовок, "") + ?(ПорядокВыставленияСчетов1 И ПорядокВыставленияСчетов2, ", ", "") + ?(ПорядокВыставленияСчетов2, Элементы.ПорядокВыставленияСчетов2.Заголовок, "") + ?((ПорядокВыставленияСчетов1 ИЛИ ПорядокВыставленияСчетов2) И ПорядокВыставленияСчетов3, ", ", "") + ?(ПорядокВыставленияСчетов3, Элементы.ПорядокВыставленияСчетов3.Заголовок, "")+ ?((ПорядокВыставленияСчетов1 ИЛИ ПорядокВыставленияСчетов2 ИЛИ ПорядокВыставленияСчетов3) И ПорядокВыставленияСчетов4, ", ", "") + ?(ПорядокВыставленияСчетов4, Элементы.ПорядокВыставленияСчетов4.Заголовок + " (" + ПорядокВыставленияСчетовДругой + ")", ""),
		ИспользуетсяАвтоматическаяОтправкаДокументовНаПочту + ?(ИспользуетсяАвтоматическаяОтправкаДокументовСчета, ", " + Элементы.ИспользуетсяАвтоматическаяОтправкаДокументовСчета.Заголовок, "")  + ?(ИспользуетсяАвтоматическаяОтправкаДокументовАкты, ", " + Элементы.ИспользуетсяАвтоматическаяОтправкаДокументовАкты.Заголовок, "")  + ?(ИспользуетсяАвтоматическаяОтправкаДокументовСчетаФактуры, ", " + Элементы.ИспользуетсяАвтоматическаяОтправкаДокументовСчетаФактуры.Заголовок, "")
	);
	
	ТекстПисьма = ТекстПисьма + "
	|Комментарий: " + Комментарий;
	
	Возврат ТекстПисьма;
	
КонецФункции

&НаКлиенте
Процедура ПослеОтправкиПисьма(Результат, Параметры) Экспорт
	
	Если Результат = Истина Тогда
		ЗавершитьРаботуСОпросом();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРаботуСОпросом()
	
	ЗавершитьРаботуСОпросомСервер();
	Закрыть(Истина);
	
КонецПроцедуры

Процедура ЗавершитьРаботуСОпросомСервер()
	
	УправлениеНебольшойФирмойСервер.УстановитьНастройкуПользователя(Истина, "ОпросПоПодсистемеБиллингЗавершен");
	
КонецПроцедуры

#КонецОбласти
