#Область ПроцедурыИФункцииОбщегоНазначения

// Процедура обновляет наименование, если пользователь не менял его вручную.
//
&НаКлиенте
Процедура ОбновитьАвтонаименование(Обновить = Истина, УстановитьМодифицированность = Ложь)
	
	Если Не ЗначениеЗаполнено(Объект.Наименование) ИЛИ (Обновить И ИспользуетсяАвтоНаименование И Не НаименованиеИзмененоПользователем) Тогда
		Объект.Наименование = СформироватьАвтоНаименованиеНаКлиенте();
		ИспользуетсяАвтоНаименование = Истина;
		
		Если УстановитьМодифицированность Тогда
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Функция возвращает сформированное автонаименование.
//
&НаКлиенте
Функция СформироватьАвтоНаименованиеНаКлиенте()
	
	Элементы.Наименование.СписокВыбора.Очистить();
	
	СтрокаНаименования = "";
	
	Если Объект.СпособПредоставления = СпособПредоставленияПроцент Тогда
		
		СтрокаНаименования = "" + Объект.ЗначениеСкидкиНаценки + НСтр("ru = '%'");
		
	ИначеЕсли Объект.СпособПредоставления = СпособПредоставленияСумма Тогда
		
		СтрокаНаименования = "" + Объект.ЗначениеСкидкиНаценки + " " + Объект.ВалютаПредоставления;
		
	КонецЕсли;
	
	Элементы.Наименование.СписокВыбора.Добавить(СтрокаНаименования);
	
	Если Объект.УсловияПредоставления.Количество() = 1 Тогда
		СтрокаНаименования = СтрокаНаименования + " ("+Объект.УсловияПредоставления[0].УсловиеПредоставления+")";
		Элементы.Наименование.СписокВыбора.Добавить(СтрокаНаименования);
	ИначеЕсли Объект.УсловияПредоставления.Количество() > 1 Тогда
		
		КоличествоУсловий = Объект.УсловияПредоставления.Количество();
		
		Если КоличествоУсловий >= 2 Тогда
			СтрокаНаименования = СтрокаНаименования + " " +НСтр("ru = '(несколько условий)'");
			Элементы.Наименование.СписокВыбора.Добавить(СтрокаНаименования);
		КонецЕсли;
		
	ИначеЕсли Объект.УсловияПредоставления.Количество() = 0 Тогда
		СтрокаНаименования = СтрокаНаименования + " " + НСтр("ru = 'без условий'");
		Элементы.Наименование.СписокВыбора.Добавить(СтрокаНаименования);
	КонецЕсли;
	
	СуммаВДокументе = (Объект.СпособПредоставления = СпособПредоставленияСумма И Объект.ОбластьПредоставления = ОбластьВДокументе);
	Если Объект.НоменклатураГруппыЦеновыеГруппы.Количество() > 0 И НЕ СуммаВДокументе Тогда
		СтрокаНаименования = СтрокаНаименования + НСтр("ru = ', с уточнением'");
		Элементы.Наименование.СписокВыбора.Добавить(СтрокаНаименования);
	КонецЕсли;
	
	Если (Объект.ПолучателиСкидкиКонтрагенты.Количество() > 0 И Объект.Назначение <> НазначениеРозница) 
		ИЛИ (Объект.ПолучателиСкидкиСклады.Количество() > 0 И Объект.Назначение <> НазначениеОпт) Тогда
		СтрокаНаименования = СтрокаНаименования + НСтр("ru = ', указаны получатели'");
		Элементы.Наименование.СписокВыбора.Добавить(СтрокаНаименования);
	КонецЕсли;
	
	Если Объект.ВремяПоДнямНедели.Количество() > 0 Тогда
		СтрокаНаименования = СтрокаНаименования + НСтр("ru = ', по расписанию'");
		Элементы.Наименование.СписокВыбора.Добавить(СтрокаНаименования);
	КонецЕсли;
	
	Возврат СтрокаНаименования;

КонецФункции

// Функция возвращает сформированное автонаименование.
//
&НаСервере
Функция СформироватьАвтоНаименованиеНаСервере()
	
	Элементы.Наименование.СписокВыбора.Очистить();
	
	СтрокаНаименования = "";
	
	Если Объект.СпособПредоставления = СпособПредоставленияПроцент Тогда
		
		СтрокаНаименования = "" + Объект.ЗначениеСкидкиНаценки + НСтр("ru = '%'");
		
	ИначеЕсли Объект.СпособПредоставления = СпособПредоставленияСумма Тогда
		
		СтрокаНаименования = "" + Объект.ЗначениеСкидкиНаценки + " " + Объект.ВалютаПредоставления;
		
	КонецЕсли;
	
	Элементы.Наименование.СписокВыбора.Добавить(СтрокаНаименования);
	
	Если Объект.УсловияПредоставления.Количество() = 1 Тогда
		
		СтрокаНаименования = СтрокаНаименования + " ("+Объект.УсловияПредоставления[0].УсловиеПредоставления+")";
		Элементы.Наименование.СписокВыбора.Добавить(СтрокаНаименования);
		
	ИначеЕсли Объект.УсловияПредоставления.Количество() > 1 Тогда
		
		КоличествоУсловий = Объект.УсловияПредоставления.Количество();
		
		Если КоличествоУсловий >= 2 Тогда
			СтрокаНаименования = СтрокаНаименования + " " +НСтр("ru = '(несколько условий)'");
			Элементы.Наименование.СписокВыбора.Добавить(СтрокаНаименования);
		КонецЕсли;
		
	ИначеЕсли Объект.УсловияПредоставления.Количество() = 0 Тогда
		
		СтрокаНаименования = СтрокаНаименования + " " + НСтр("ru = 'без условий'");
		Элементы.Наименование.СписокВыбора.Добавить(СтрокаНаименования);
		
	КонецЕсли;
	
	СуммаВДокументе = (Объект.СпособПредоставления = СпособПредоставленияСумма И Объект.ОбластьПредоставления = ОбластьВДокументе);
	Если Объект.НоменклатураГруппыЦеновыеГруппы.Количество() > 0 И НЕ СуммаВДокументе Тогда
		СтрокаНаименования = СтрокаНаименования + НСтр("ru = ', с уточнением'");
		Элементы.Наименование.СписокВыбора.Добавить(СтрокаНаименования);
	КонецЕсли;
	
	Если (Объект.ПолучателиСкидкиКонтрагенты.Количество() > 0 И Объект.Назначение <> НазначениеРозница) 
		ИЛИ (Объект.ПолучателиСкидкиСклады.Количество() > 0 И Объект.Назначение <> НазначениеОпт) Тогда
		СтрокаНаименования = СтрокаНаименования + НСтр("ru = ', указаны получатели'");
		Элементы.Наименование.СписокВыбора.Добавить(СтрокаНаименования);
	КонецЕсли;
	
	Если Объект.ВремяПоДнямНедели.Количество() > 0 Тогда
		СтрокаНаименования = СтрокаНаименования + НСтр("ru = ', по расписанию'");
		Элементы.Наименование.СписокВыбора.Добавить(СтрокаНаименования);
	КонецЕсли;
	
	Возврат СтрокаНаименования;

КонецФункции

// Функция возвращает вариант совместного применения автоматических скидок актуальный для текущей скидки.
//
&НаСервереБезКонтекста
Функция ПолучитьТекущийВариантСовместногоПрименения(Родитель)

	Если Родитель.Пустая() Тогда
		Возврат Константы.ВариантыСовместногоПримененияСкидокНаценок.Получить();
	Иначе
		Возврат Родитель.ВариантСовместногоПрименения;
	КонецЕсли;

КонецФункции // ПолучитьТекущийВариантСовместногоПриме()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Чтобы уменьшить количество безконтестных вызвов сервера.
	СпособПредоставленияПроцент = Перечисления.СпособыПредоставленияСкидокНаценок.Процент;
	СпособПредоставленияСумма = Перечисления.СпособыПредоставленияСкидокНаценок.Сумма;
	ВариантОграниченияПоНоменклатуре = Перечисления.ВариантыОграниченийСкидокПоНоменклатуре.ПоНоменклатуре;
	ВариантОграниченияПоКатегориям = Перечисления.ВариантыОграниченийСкидокПоНоменклатуре.ПоКатегориям;
	ВариантОграниченияПоЦеновымГруппам = Перечисления.ВариантыОграниченийСкидокПоНоменклатуре.ПоЦеновымГруппам;
	НазначениеРозница = Перечисления.НазначенияАвтоматическихСкидок.Розница;
	НазначениеОпт = Перечисления.НазначенияАвтоматическихСкидок.Опт;
	ОбластьВДокументе = Перечисления.ВариантыОбластейОграниченияСкидокНаценок.ВДокументе;
	
	РазрешеноРедактированиеЦенДокументов = УправлениеНебольшойФирмойУправлениеДоступомПовтИсп.РазрешеноРедактированиеЦенДокументов();
	ЭтаФорма.ТолькоПросмотр = НЕ РазрешеноРедактированиеЦенДокументов;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Наименование = СформироватьАвтоНаименованиеНаСервере();
	Иначе
		СформироватьАвтоНаименованиеНаСервере();
	КонецЕсли;
	
	Для каждого ВариантНаименования Из Элементы.Наименование.СписокВыбора Цикл
		Если Объект.Наименование = ВариантНаименования.Значение Тогда
			ИспользуетсяАвтоНаименование = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	// Определим видимость реквизита доп. упорядочивания.
	Если Объект.РеквизитДопУпорядочивания > 0 Тогда
		Элементы.РеквизитДопУпорядочивания.Видимость = Истина;
	Иначе
		Если Объект.Родитель.Пустая() Тогда
			ТекВариантСовместногоПрименения = Константы.ВариантыСовместногоПримененияСкидокНаценок.Получить();
		Иначе
			ТекВариантСовместногоПрименения = Объект.Родитель.ВариантСовместногоПрименения;
		КонецЕсли;
		
		Элементы.РеквизитДопУпорядочивания.Видимость = (ТекВариантСовместногоПрименения = Перечисления.ВариантыСовместногоПримененияСкидокНаценок.Вытеснение 
														ИЛИ ТекВариантСовместногоПрименения = Перечисления.ВариантыСовместногоПримененияСкидокНаценок.Умножение);
	КонецЕсли;
	
	ВариантОграниченияПоНоменклатуреДоИзменения = Объект.ВариантОграниченияПоНоменклатуре;
	Элементы.ДекорацияРодительВариантСовместногоПрименения.Заголовок = Строка(Объект.Родитель.ВариантСовместногоПрименения);
	Элементы.ДекорацияРодительВариантСовместногоПрименения.Видимость = Не Объект.Родитель.Пустая();
	
	УправлениеНебольшойФирмойКлиентСервер.УстановитьКартинкуДляКомментария(Элементы.ГруппаДополнительно, Объект.Комментарий);
	
	УправлениеВидимостьюНаСервере();
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаОповещения.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "УсловиеПредоставления_Запись" Тогда
		ОбновитьАвтонаименование(Истина, Истина);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ПередЗаписью.
//
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.ДатаНачала > Объект.ДатаОкончания Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Дата начала больше даты окончания!'");
		Сообщение.Поле = "Объект.ДатаНачала";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииДляУправленияВнешнимВидомФормы

// Процедура управляет видимостью элементов в зависимости о варианта ограничения, способа и области предоставления скидки.
//
&НаСервере
Процедура УправлениеВидимостьюНаСервере()

	Если Объект.ВариантОграниченияПоНоменклатуре.Пустая() Тогда
		Объект.ВариантОграниченияПоНоменклатуре = ВариантОграниченияПоНоменклатуре;
	КонецЕсли;
	
	СуммаВДокументе = (Объект.СпособПредоставления = СпособПредоставленияСумма 
						И Объект.ОбластьПредоставления = ОбластьВДокументе);
		
	Элементы.Уточнения.Видимость = Не СуммаВДокументе;
	Если Объект.ВариантОграниченияПоНоменклатуре = ВариантОграниченияПоНоменклатуре Тогда
		Элементы.НоменклатураГруппыЦеновыеГруппыЗначениеУточнения.Заголовок = "Номенклатура";
		Элементы.НоменклатураГруппыЦеновыеГруппыЗначениеУточнения.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
		
		Элементы.ДекорацияПодсказкаУточнения.Заголовок = "Заполните уточнения, если требуется, чтобы у определённых товаров или групп товаров значение скидки отличалось от основного значения. Если список не заполнен, то для всех позиций номенклатуры используется основное значение скидки.";
		
		Элементы.НоменклатураГруппыЦеновыеГруппыХарактеристика.Видимость = Истина;
		Элементы.НоменклатураГруппыЦеновыеГруппыДобавитьГруппу.Видимость = Истина;
	ИначеЕсли Объект.ВариантОграниченияПоНоменклатуре = ВариантОграниченияПоКатегориям Тогда
		Элементы.НоменклатураГруппыЦеновыеГруппыЗначениеУточнения.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.КатегорииНоменклатуры");
		Элементы.НоменклатураГруппыЦеновыеГруппыЗначениеУточнения.Заголовок = "Категория номенклатуры";
		
		Элементы.ДекорацияПодсказкаУточнения.Заголовок = "Заполните уточнения, если требуется, чтобы у товаров определённых категорий значение скидки отличалось от основного значения. Если список не заполнен, то для всех категорий используется основное значение скидки.";
		
		Элементы.НоменклатураГруппыЦеновыеГруппыХарактеристика.Видимость = Ложь;
		Элементы.НоменклатураГруппыЦеновыеГруппыДобавитьГруппу.Видимость = Истина;
	ИначеЕсли Объект.ВариантОграниченияПоНоменклатуре = ВариантОграниченияПоЦеновымГруппам Тогда
		Элементы.НоменклатураГруппыЦеновыеГруппыЗначениеУточнения.Заголовок = "Ценовая группа";
		Элементы.НоменклатураГруппыЦеновыеГруппыЗначениеУточнения.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ЦеновыеГруппы");
		
		Элементы.ДекорацияПодсказкаУточнения.Заголовок = "Заполните уточнения, если требуется, чтобы у товаров определённых ценовых групп значение скидки отличалось от основного значения. Если список не заполнен, то для всех ценовых групп используется основное значение скидки.";
		
		Элементы.НоменклатураГруппыЦеновыеГруппыХарактеристика.Видимость = Ложь;
		Элементы.НоменклатураГруппыЦеновыеГруппыДобавитьГруппу.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.ВалютаПредоставления.Видимость = (Объект.СпособПредоставления = СпособПредоставленияСумма);
	
	НастройкаВидимостиПолучателейНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

// Процедура - обработчик события ПриИзменении элемента ВариантОграниченияПоНоменклатуре.
//
&НаКлиенте
Процедура ВариантОграниченияПоНоменклатуреПриИзменении(Элемент)
	
	Если Объект.НоменклатураГруппыЦеновыеГруппы.Количество() > 0 Тогда
		Описание = Новый ОписаниеОповещения("ВариантОграниченияПоНоменклатуреПриИзмененииЗаврешение", ЭтотОбъект);
		ПоказатьВопрос(Описание, "Таблица уточнений будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет,"Изменение варианта уточнения");
	Иначе
		ВариантОграниченияПоНоменклатуреДоИзменения = Объект.ВариантОграниченияПоНоменклатуре;
		УправлениеВидимостьюНаСервере();
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении элемента ВариантОграниченияПоНоменклатуре (зевершение после ответа на вопрос об удалении строк в ТЧ).
//
&НаКлиенте
Процедура ВариантОграниченияПоНоменклатуреПриИзмененииЗаврешение(РезультатОтвета, ДополнительныеПараметры) Экспорт

	Если РезультатОтвета <> КодВозвратаДиалога.Да Тогда
		Объект.ВариантОграниченияПоНоменклатуре = ВариантОграниченияПоНоменклатуреДоИзменения;
		Возврат;
	КонецЕсли;
	
	ВариантОграниченияПоНоменклатуреДоИзменения = Объект.ВариантОграниченияПоНоменклатуре;
	УправлениеВидимостьюНаСервере();
	Объект.НоменклатураГруппыЦеновыеГруппы.Очистить();
	
	ОбновитьАвтонаименование(Истина);
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении элемента СпособПредоставления.
//
&НаКлиенте
Процедура СпособПредоставленияПриИзменении(Элемент)
	
	УправлениеВидимостьюНаСервере();
	Объект.ЗначениеСкидкиНаценки = 0;
	
	ПоказатьСтраницуУточнений = Ложь;
	Для каждого ТекущаяСтрока Из Объект.НоменклатураГруппыЦеновыеГруппы Цикл
	
		ТекущаяСтрока.ЗначениеСкидкиНаценки = 0;
		ПоказатьСтраницуУточнений = Истина;
		
	КонецЦикла;
	
	Если ПоказатьСтраницуУточнений Тогда
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаУточненияОграниченияИРасписание;
		Элементы.СтраницыУточненийИОграничений.ТекущаяСтраница = Элементы.Уточнения;
		
		СуммаВДокументе = (Объект.СпособПредоставления = СпособПредоставленияСумма 
							И Объект.ОбластьПредоставления = ОбластьВДокументе);
							
		Если Не СуммаВДокументе Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Скидки очищены!");
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьАвтонаименование(Истина);
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении элемента ОбластьПредоставления.
//
&НаКлиенте
Процедура ОбластьПредоставленияПриИзменении(Элемент)
	
	УправлениеВидимостьюНаСервере();
	ОбновитьАвтонаименование(Истина);
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении элемента Наименование.
//
&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	НаименованиеИзмененоПользователем = Истина;
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении элемента ЗначениеСкидкиНаценки.
//
&НаКлиенте
Процедура ЗначениеСкидкиНаценкиПриИзменении(Элемент)
	
	Если Объект.СпособПредоставления = СпособПредоставленияПроцент Тогда
		Если Объект.ЗначениеСкидкиНаценки > 100 Тогда
			ТекстСообщения = НСтр("ru = 'Процент скидки должен быть не более 100%'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, 
																,
																"ЗначениеСкидкиНаценки",
																"Объект");
			Объект.ЗначениеСкидкиНаценки = 0;
		КонецЕсли;
	КонецЕсли;
	ОбновитьАвтонаименование(Истина);

КонецПроцедуры

// Процедура - обработчик события ПриИзменении элемента Родитель.
//
&НаКлиенте
Процедура РодительПриИзменении(Элемент)
	
	РодительПриИзмененииНаСервере();
	
КонецПроцедуры

// Серверная часть процедуры РодительПриИзменении.
//
&НаСервере
Процедура РодительПриИзмененииНаСервере()
	
	ТекВариантСовместногоПрименения = ПолучитьТекущийВариантСовместногоПрименения(Объект.Родитель);
	
	Элементы.РеквизитДопУпорядочивания.Видимость = (Объект.РеквизитДопУпорядочивания > 0 ИЛИ ТекВариантСовместногоПрименения = ПредопределенноеЗначение("Перечисление.ВариантыСовместногоПримененияСкидокНаценок.Вытеснение") 
													ИЛИ ТекВариантСовместногоПрименения = ПредопределенноеЗначение("Перечисление.ВариантыСовместногоПримененияСкидокНаценок.Умножение"));
	
	Элементы.ДекорацияРодительВариантСовместногоПрименения.Заголовок = Строка(ТекВариантСовместногоПрименения);
	Элементы.ДекорацияРодительВариантСовместногоПрименения.Видимость = Не Объект.Родитель.Пустая();
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении элемента Назначение.
//
&НаКлиенте
Процедура НазначениеПриИзменении(Элемент)
	
	НастройкаВидимостиПолучателейНаСервере();
	ОбновитьАвтонаименование(Истина);
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода Комментарий.
//
&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	
	ПодключитьОбработчикОжидания("Подключаемый_УстановитьКартинкуДляКомментария", 0.5, Истина);
	
КонецПроцедуры // КомментарийПриИзменении()

&НаКлиенте
Процедура Подключаемый_УстановитьКартинкуДляКомментария()
	
	УправлениеНебольшойФирмойКлиентСервер.УстановитьКартинкуДляКомментария(Элементы.ГруппаДополнительно, Объект.Комментарий);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличныхЧастей

// Процедура - обработчик события ПриИзменении элемента УсловияПредоставления формы.
//
&НаКлиенте
Процедура УсловияПредоставленияПриИзменении(Элемент)
	
	ОбновитьАвтонаименование(Истина);
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении ТЧ ВремяПоДнямНедели формы.
//
&НаКлиенте
Процедура ВремяПоДнямНеделиПриИзменении(Элемент)
	
	ОбновитьАвтонаименование(Истина);
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении ТЧ ПолучателиСкидкиКонтрагенты формы.
//
&НаКлиенте
Процедура ПолучателиСкидкиПриИзменении(Элемент)
	
	ОбновитьАвтонаименование(Истина);
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении ТЧ ПолучателиСкидкиСклады формы.
//
&НаКлиенте
Процедура ПолучателиСкидкиСкладыПриИзменении(Элемент)
	
	ОбновитьАвтонаименование(Истина);
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении колонки ЗначениеСкидки в ТЧ НоменклатураГруппыЦеновыеГруппы формы.
//
&НаКлиенте
Процедура НоменклатураГруппыЦеновыеГруппыЗначениеСкидкиНаценкиПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.НоменклатураГруппыЦеновыеГруппы.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		Если Объект.СпособПредоставления = СпособПредоставленияПроцент Тогда
			Если ТекущаяСтрока.ЗначениеСкидкиНаценки > 100 Тогда
				ТекстСообщения = НСтр("ru = 'Процент скидки должен быть не более 100%'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, 
																	,
																	"НоменклатураГруппыЦеновыеГруппы["+(ТекущаяСтрока.НомерСтроки-1)+"].ЗначениеСкидкиНаценки",
																	"Объект");
				ТекущаяСтрока.ЗначениеСкидкиНаценки = 0;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьАвтонаименование(Истина);
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении ТЧ НоменклатураГруппыЦеновыеГруппы формы.
//
&НаКлиенте
Процедура НоменклатураГруппыЦеновыеГруппыПриИзменении(Элемент)
	
	ОбновитьАвтонаименование(Истина);
	
КонецПроцедуры

// Процедура - обработчик события ПриНачалеРедактирования ТЧ ВремяПоДнямНедели формы.
//
&НаКлиенте
Процедура ВремяПоДнямНеделиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.Выбран = Истина;
		Элемент.ТекущиеДанные.ВремяНачала = '00010101000000';
		Элемент.ТекущиеДанные.ВремяОкончания = '00010101235959';
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииДляУправленияВнешнимВидомФормы

// Процедура управляет видимостью элементов формы в зависимости от назначения автоматической скидки.
//
&НаСервере
Процедура НастройкаВидимостиПолучателейНаСервере()

	Если Объект.Назначение = НазначениеРозница Тогда
		Элементы.ГруппаКонтрагенты.Видимость = Ложь;
		Элементы.ГруппаСклады.Видимость = Истина;
		Элементы.ГруппаСкладыИКонтрагенты.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
		
		Элементы.ДекорацияПодсказкаПолучатели.Заголовок = "Заполните список складов, если скидка (наценка) будет предоставляться только на определённых складах. "+
		"Если список не заполнен, то скидка (наценка) будет предоставляться на всех складах.";
	ИначеЕсли Объект.Назначение = НазначениеОпт Тогда
		Элементы.ГруппаКонтрагенты.Видимость = Истина;
		Элементы.ГруппаСклады.Видимость = Ложь;
		Элементы.ГруппаСкладыИКонтрагенты.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
		
		Элементы.ДекорацияПодсказкаПолучатели.Заголовок = "Заполните список контрагентов, если скидка (наценка) будет предоставляться только определённому списку контрагентов. "+
		"Если список не заполнен, то скидка (наценка) будет предоставляться всем контрагентам.";
	Иначе
		Элементы.ГруппаКонтрагенты.Видимость = Истина;
		Элементы.ГруппаСклады.Видимость = Истина;
		Элементы.ГруппаСкладыИКонтрагенты.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
		
		Элементы.ДекорацияПодсказкаПолучатели.Заголовок = "Заполните список контрагентов или складов, если скидка (наценка) будет предоставляться только определённому списку контрагентов (опт) "+
		"или на определённых складах (розница). Если список контрагентов (складов) не заполнен, то скидка (наценка) будет предоставляться всем контрагентам (на всех складах).";
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийКомандФормы

&НаКлиенте
Процедура ДобавитьГруппуНоменклатурыКатегорийЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		НоваяСтрока = Объект.НоменклатураГруппыЦеновыеГруппы.Добавить();
		НоваяСтрока.ЗначениеУточнения = РезультатЗакрытия;
		Элементы.НоменклатураГруппыЦеновыеГруппы.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьГруппу(Команда)
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ДобавитьГруппуНоменклатурыКатегорийЗавершение", ЭтотОбъект);
	Если Объект.ВариантОграниченияПоНоменклатуре = ВариантОграниченияПоНоменклатуре Тогда
		ОткрытьФорму("Справочник.Номенклатура.ФормаВыбораГруппы",, ЭтотОбъект,,,, ОповещениеОЗакрытии);
	ИначеЕсли Объект.ВариантОграниченияПоНоменклатуре = ВариантОграниченияПоКатегориям Тогда
		ПараметрыОткрытия = Новый Структура("");
		ОткрытьФорму("Справочник.КатегорииНоменклатуры.ФормаВыбораГруппы", ПараметрыОткрытия, ЭтотОбъект,,,, ОповещениеОЗакрытии);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобваитьГруппуКонтрагентовЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		НоваяСтрока = Объект.ПолучателиСкидкиКонтрагенты.Добавить();
		НоваяСтрока.Получатель = РезультатЗакрытия;
		Элементы.ПолучателиСкидки.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобваитьГруппуКонтрагентов(Команда)
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ДобваитьГруппуКонтрагентовЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.Контрагенты.ФормаВыбораГруппы",, ЭтотОбъект,,,, ОповещениеОЗакрытии);
	
КонецПроцедуры

#КонецОбласти

