

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
// Процедура - обработчик события ПриСозданииНаСервере формы.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("Владелец") Тогда
		
		Если ЗначениеЗаполнено(Параметры.Отбор.Владелец) Тогда
			
			ТипВладелец = Параметры.Отбор.Владелец.ТипНоменклатуры;
			
			Если (ТипВладелец = Перечисления.ТипыНоменклатуры.Операция
				ИЛИ ТипВладелец = Перечисления.ТипыНоменклатуры.ВидРабот
				ИЛИ ТипВладелец = Перечисления.ТипыНоменклатуры.Услуга
				ИЛИ (НЕ Константы.ФункциональнаяОпцияИспользоватьПодсистемуПроизводство.Получить() И ТипВладелец = Перечисления.ТипыНоменклатуры.Запас)
				ИЛИ (НЕ Константы.ФункциональнаяОпцияИспользоватьПодсистемуРаботы.Получить() И ТипВладелец = Перечисления.ТипыНоменклатуры.Работа)) Тогда
			
				Сообщение = Новый СообщениеПользователю();
				ТекстНадписи = НСтр("ru = 'Для номенклатуры типа %ТПНоменклатура% спецификация не указывается!'");
				ТекстНадписи = СтрЗаменить(ТекстНадписи, "%ТПНоменклатура%", ТипВладелец);
				Сообщение.Текст = ТекстНадписи;
				Сообщение.Сообщить();
				Отказ = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Калькуляция
	Если Параметры.Отбор.Свойство("ЗаказПокупателя") Тогда
		
		ЗаказПокупателя = Параметры.Отбор.ЗаказПокупателя;
		
		Если ЗначениеЗаполнено(ЗаказПокупателя) И ТипЗнч(ЗаказПокупателя)=Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			
			МассивЗначений = Новый Массив;
			МассивЗначений.Добавить(ЗаказПокупателя);
			МассивЗначений.Добавить(Документы.ЗаказПокупателя.ПустаяСсылка());
			Параметры.Отбор.ЗаказПокупателя = Новый ФиксированныйМассив(МассивЗначений);
			
		КонецЕсли;
		
	КонецЕсли; 
	// Конец Калькуляция	
	
КонецПроцедуры