
&НаСервере
Функция ПолучитьТипДенежныхСредств(ДокументСсылка)
	
	Возврат ДокументСсылка.ТипДенежныхСредств;
	
КонецФункции

&НаСервере
Функция ПолучитьТипДенежныхСредствПолучатель(ДокументСсылка)
	
	Возврат ДокументСсылка.ТипДенежныхСредствПолучатель;
	
КонецФункции

&НаКлиенте
// Процедура обработки команды.
//
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Параметры = Новый Структура("Основание", ПараметрКоманды);
	
	ТипДенежныхСредств = ПолучитьТипДенежныхСредств(ПараметрКоманды);
	ТипДенежныхСредствПолучатель = ПолучитьТипДенежныхСредствПолучатель(ПараметрКоманды);
	
	Если ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Наличные") Тогда
		ОткрытьФорму("Документ.РасходИзКассы.ФормаОбъекта", Параметры);
	Иначе
		ОткрытьФорму("Документ.РасходСоСчета.ФормаОбъекта", Параметры);
	КонецЕсли;
	
	Если ТипДенежныхСредствПолучатель = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Наличные") Тогда
		ОткрытьФорму("Документ.ПоступлениеВКассу.ФормаОбъекта", Параметры);
	Иначе
		ОткрытьФорму("Документ.ПоступлениеНаСчет.ФормаОбъекта", Параметры);
	КонецЕсли;
	
КонецПроцедуры // ОбработкаКоманды()
