
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура заполняет реквизиты формы из параметров.
//
&НаСервере
Процедура ЗаполнитьРеквизитыПоПараметрам()
	
	Если Параметры.Свойство("КратностьДня") Тогда
		КратностьДня = Параметры.КратностьДня;
		КратностьДняПриОткрытии = Параметры.КратностьДня;
	КонецЕсли;
	
КонецПроцедуры // ПроверитьМодифицированностьФормы()

// Процедура проверяет модифицированность формы.
//
&НаКлиенте
Процедура ПроверитьМодифицированностьФормы()
	
	БылиВнесеныИзменения = Ложь;
	
	ИзмененияКратностьДня = КратностьДняПриОткрытии <> КратностьДня;
	
	Если ИзмененияКратностьДня Тогда
		БылиВнесеныИзменения = Истина;
	КонецЕсли;
	
КонецПроцедуры // ПроверитьМодифицированностьФормы()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события ПриСозданииНаСервере формы.
// В процедуре осуществляется
// - инициализация параметров формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьРеквизитыПоПараметрам();
	
	БылиВнесеныИзменения = Ложь;
	
КонецПроцедуры // ПриСозданииНаСервере()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

// Процедура - обработчик события нажатия кнопки ОК.
//
&НаКлиенте
Процедура КомандаОК(Команда)
	
	ПроверитьМодифицированностьФормы();
	
	СтруктураРеквизитовФормы = Новый Структура;
	
	СтруктураРеквизитовФормы.Вставить("БылиВнесеныИзменения", БылиВнесеныИзменения);
	
	СтруктураРеквизитовФормы.Вставить("КратностьДня", КратностьДня);
	
	Закрыть(СтруктураРеквизитовФормы);
	
КонецПроцедуры // КомандаОК()
