#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПривестиДанныеКСогласованномуСостоянию();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура согласовывает состояние одних реквизитов объекта в зависимости от других
//
Процедура ПривестиДанныеКСогласованномуСостоянию()
	
	Если ИзмерениеПланирования <> Перечисления.ИзмеренияПланирования.Номенклатура Тогда
		
		ДетализироватьДоЗаказа	= Ложь;
		ПланироватьКоличество	= Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли