
&НаСервере
Процедура ПодготовитьСведенияДляОтрисовкиНаФормах(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	
	Если Форма.ИмяФормы = "Справочник.Организации.Форма.ФормаЭлемента" Тогда
		
		СтраницаФранчайзи = Элементы.Добавить("ГруппаНастроекФранчайзи", Тип("ГруппаФормы"), Элементы.СписокРеквизитов);
		СтраницаФранчайзи.Заголовок = "1С: Франчайзи";
		СтраницаФранчайзи.Вид   = ВидГруппыФормы.ОбычнаяГруппа;
		
		
		// Код партнера
		Поле = ДобавитьПолеФормы(Элементы, "бизКодПартнера","Код партнера" , СтраницаФранчайзи); 
		Поле.РастягиватьПоГоризонтали = Ложь;
		
		// бизЛогинFTPРазработчика
		Поле = ДобавитьПолеФормы(Элементы, "бизЛогинFTPРазработчика", "Логин разработчика на FTP сервере фирмы ""1С""", СтраницаФранчайзи);
		Поле.РастягиватьПоГоризонтали = Истина;
		
		// бизПарольFTPРазработчика
		Поле = ДобавитьПолеФормы(Элементы, "бизПарольFTPРазработчика", "Пароль разработчика на FTP сервере фирмы ""1С""", СтраницаФранчайзи);
		Поле.РежимПароля = Истина;
		Поле.РастягиватьПоГоризонтали = Истина;
		
		////Поле реквизита ОГРН
		//Поле =   ДобавитьПолеФормы(Элементы, "ОГРН", "ОГРН", СтраницаФранчайзи);
		//Поле.РастягиватьПоГоризонтали = Ложь;
		
	ИначеЕсли Форма.ИмяФормы = "Справочник.ФизическиеЛица.Форма.ФормаЭлемента"   Тогда
		
		////Поле реквизита ИНН
		//Поле =   ДобавитьПолеФормы(Элементы, "ИНН", "ИНН", СтраницаФранчайзи);
		//Поле.РастягиватьПоГоризонтали = Ложь;
		
	ИначеЕсли Форма.ИмяФормы = "Справочник.Контрагенты.Форма.ФормаЭлемента" Тогда
		
		
		//ГруппаДополнительныеСведенияФранчайзи = Элементы.Добавить("ГруппаДополнительныеСведенияФранчайзи",Тип("ГруппаФормы"),Элементы.Реквизиты);
		//ГруппаДополнительныеСведенияФранчайзи.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		//ГруппаДополнительныеСведенияФранчайзи.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		//ГруппаДополнительныеСведенияФранчайзи.Отображение = ОтображениеОбычнойГруппы.СлабоеВыделение;
		//ГруппаДополнительныеСведенияФранчайзи.ОтображатьЗаголовок = Истина;
		//ГруппаДополнительныеСведенияФранчайзи.РастягиватьПоГоризонтали = Истина;
		//ГруппаДополнительныеСведенияФранчайзи.Заголовок = "Дополнительные сведения для 1С:Франчайзи";
		//ГруппаДополнительныеСведенияФранчайзи.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
		//ГруппаДополнительныеСведенияФранчайзи.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
		//
		//
		//Поле = ДобавитьПолеФормы(Элементы, "бизПолноеНаименованиеПоУчредительнымДокументам", "Наименование по уч. документам", Элементы.ГруппаДополнительныеСведенияФранчайзи);			
		//ГруппаСведенияОРегистрации = Элементы.Добавить("ГруппаСведенияОРегистрации",Тип("ГруппаФормы"),Элементы.ГруппаДополнительныеСведенияФранчайзи);
		//ГруппаСведенияОРегистрации.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		//ГруппаСведенияОРегистрации.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		//ГруппаСведенияОРегистрации.Отображение = ОтображениеОбычнойГруппы.Нет;
		//ГруппаСведенияОРегистрации.ОтображатьЗаголовок = Ложь;
		//ГруппаСведенияОРегистрации.РастягиватьПоГоризонтали = Истина;
		//
		//Поле = ДобавитьПолеФормы(Элементы, "бизСвидетельствоИПСерияНомер", "Свидетельство регистрации ИП, серия_№", Элементы.ГруппаСведенияОРегистрации,Ложь);
		//Поле = ДобавитьПолеФормы(Элементы, "бизСвидетельствоИПДата", "от ", Элементы.ГруппаСведенияОРегистрации,Ложь);
		//Поле = ДобавитьПолеФормы(Элементы, "бизОГРН", "ОГРН", Элементы.ГруппаСведенияОРегистрации,Ложь);
		
	КонецЕсли;	
КонецПроцедуры



&НаСервере
Функция ДобавитьПолеФормы(ЭлементыФормы, ИмяЭлементаУправления, Заголовок = "", ПоместитьНа, РастягиватьПоГоризонтали = Истина)
	
	Поле = ЭлементыФормы.Добавить(ИмяЭлементаУправления, Тип("ПолеФормы"), ПоместитьНа);
	Поле.ПутьКДанным = "Объект." + ИмяЭлементаУправления;
	Поле.Вид = ВидПоляФормы.ПолеВвода;
	Поле.Заголовок = Заголовок;
	Поле.РастягиватьПоГоризонтали = РастягиватьПоГоризонтали;
	Возврат Поле;
	
КонецФункции




