#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	НастройкиОтчета = КомпоновщикНастроек.Настройки;
	
	ПараметрНачалоПериода = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода"));
	ПараметрКонецПериода = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"));
	
	Если ПараметрНачалоПериода <> Неопределено И ПараметрНачалоПериода.Использование
		И ПараметрКонецПериода <> Неопределено И ПараметрКонецПериода.Использование
		И ТипЗнч(ПараметрНачалоПериода.Значение) = Тип("СтандартнаяДатаНачала")
		И ТипЗнч(ПараметрКонецПериода.Значение) = Тип("СтандартнаяДатаНачала")
		И ПараметрНачалоПериода.Значение.Дата <> Дата(1,1,1)
		И ПараметрКонецПериода.Значение.Дата <> Дата(1,1,1)
		И ПараметрНачалоПериода.Значение.Дата > ПараметрКонецПериода.Значение.Дата Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст	 = НСтр("ru = 'Дата начала периода не должна превышать дату окончания!'");
		Сообщение.Сообщить();
		
		СтандартнаяОбработка = Ложь;
		Возврат;
		
	КонецЕсли;
	
	ЗаголовокКД = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы.Найти("Заголовок");
	ЗаголовокКД.Значение = "Отчет о закрытии месяца за " + Формат(ПараметрКонецПериода.Значение, "ДФ='ММММ гггг'") + " г.";
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли