#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	ЕстьОшибки = Ложь;

	МассивДопустимыхСвойств = РегистрыСведений.СвойстваХранилищаОблачногоАрхива.ПолучитьЗначенияДопустимыхСвойств();

	Для каждого ТекущаяЗапись Из ЭтотОбъект Цикл
		Если МассивДопустимыхСвойств.Найти(ТекущаяЗапись.Свойство) = Неопределено Тогда
			ЕстьОшибки = Истина;
			ТекстСообщения = СтрШаблон(
				НСтр("ru='Недопустимое значение свойства: [%1]'"),
				ТекущаяЗапись.Свойство);
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = ТекстСообщения;
			Сообщение.Поле  = "Свойство";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЦикла;

	Отказ = ЕстьОшибки;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
#КонецОбласти

#КонецЕсли