
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.Отбор);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Ложь;
	ПараметрыФормы = Новый Структура;
	
	Если Не ПустаяСтрока(ПолноеИмяТипаПараметраВводаНаОсновании) Тогда
		Отказ = Истина;
		ПараметрыФормы.Вставить("ПолноеИмяТипаОснования", ПолноеИмяТипаПараметраВводаНаОсновании);
	КонецЕсли;
	
	Если ПредназначенДляЭлектронныхПисем Тогда
		Отказ = Истина;
		ПараметрыФормы.Вставить("ВидСообщения", "Письмо");
	ИначеЕсли ПредназначенДляSMS Тогда
		Отказ = Истина;
		ПараметрыФормы.Вставить("ВидСообщения", "СообщениеSMS");
	КонецЕсли;
	
	Если Отказ Тогда
		ОткрытьФорму("Справочник.ШаблоныСообщений.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
