
////////////////////////////////////////////////////////////////////////////////
// Клиентские процедуры работы с обсуждениями (кэширование на время сеанса)
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс
// Вызывает процедуру формирования массива структур, содержащий имена и описания пользователей для использования в тексте обсуждений.
// 
// Параметры: Нет
//
// Возвращаемое значение:
//  Массив           - по числу пользователей: 
//   * Пользователь  - эл. справочника Пользователи
//   * Представление - Строка - Наименование пользователя,
//   * Имя 			 - Строка - Наименование пользователя сплошной строкой с нижним подчеркиванием, по типу "Фамилия_Имя";
//   * ДляПоиска 	 - Строка - Наименование пользователя сплошной строкой с нижним подчеркиванием, по типу "Фамилия_Имя",
//	 				   в нижнем регистре
Функция СловарьОписанийПользователей() Экспорт
	
	Возврат ОбсужденияВызовСервера.СловарьОписанийПользователей();
	
КонецФункции

Функция ДоступныМеханизмы8_3_6() Экспорт
	
	Возврат ОбсужденияВызовСервера.ДоступныМеханизмы8_3_6();
	
КонецФункции

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

#КонецОбласти 

 