////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
// Процедура - обработчик события ПриСозданииНаСервере формы.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если НЕ ЗначениеЗаполнено(Запись.ИсходныйКлючЗаписи.Номенклатура) Тогда
		ЗначениеНастройки = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователи.ТекущийПользователь(), "ОсновнаяОрганизация");
		Если ЗначениеЗаполнено(ЗначениеНастройки) Тогда
			Запись.Организация = ЗначениеНастройки;
		Иначе
			Запись.Организация = Справочники.Организации.ОсновнаяОрганизация;		
		КонецЕсли;
	КонецЕсли;
	
	Если Константы.УчетПоКомпании.Получить() Тогда
		Запись.Организация = Константы.Компания.Получить();
		Элементы.Организация.ТолькоПросмотр = Истина;
	КонецЕсли; 
	
КонецПроцедуры // ПриСозданииНаСервере()
