
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.СформироватьПриОткрытии = Истина;
	Отчет.Период = Параметры.Период;
	
	Если ЗначениеЗаполнено(Параметры.Организация) Тогда
		Организация = Параметры.Организация;
	Иначе
		Организация = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователи.ТекущийПользователь(), "ОсновнаяОрганизация");
		Если Не ЗначениеЗаполнено(Организация) Тогда
			Организация =УправлениеНебольшойФирмойСервер.ПолучитьПредопределеннуюОрганизацию();
		КонецЕсли;
	КонецЕсли;
	Если Параметры.УчетВыплатТекущегоГода Тогда
		Настройка  = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("УчетВыплатТекущегоГода");
		Если Настройка <> Неопределено Тогда
			Настройка.Использование = Истина;
			Настройка.Значение = Истина;
		КонецЕсли;
	КонецЕсли;
	УправлениеНебольшойФирмойОтчеты.УстановитьЗначениеПользовательскойНастройки(Отчет.КомпоновщикНастроек, "Организация", Организация);
	УправлениеНебольшойФирмойОтчеты.УстановитьЗначениеПользовательскойНастройки(Отчет.КомпоновщикНастроек, "ВидВзаиморасчетов", Параметры.ВидВзаиморасчетов);
	// Для взносов в ПФР свыше 300 тр не включаем взносы за прошлый год, срок уплаты которых до 1 апреля
	Если Параметры.ВидВзаиморасчетов.Количество() = 1
		И Параметры.ВидВзаиморасчетов[0].Значение = Справочники.ВидыНалогов.ПФРСвыше300тр Тогда
		УправлениеНебольшойФирмойОтчеты.УстановитьЗначениеПользовательскойНастройки(Отчет.КомпоновщикНастроек, "СрокУплаты", ДобавитьМесяц(НачалоГода(Параметры.Период.ДатаНачала),4));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	
	Если Параметры.УчетВыплатТекущегоГода Тогда
		Настройка  = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("УчетВыплатТекущегоГода");
		Если Настройка <> Неопределено Тогда
			Настройка.Использование = Истина;
			Настройка.Значение = Истина;
		КонецЕсли;
	КонецЕсли;
	УправлениеНебольшойФирмойОтчеты.УстановитьЗначениеПользовательскойНастройки(Отчет.КомпоновщикНастроек, "Организация", Организация);
	УправлениеНебольшойФирмойОтчеты.УстановитьЗначениеПользовательскойНастройки(Отчет.КомпоновщикНастроек, "ВидВзаиморасчетов", Параметры.ВидВзаиморасчетов);
	Если Параметры.ВидВзаиморасчетов.Количество() = 1
		И Параметры.ВидВзаиморасчетов[0].Значение = Справочники.ВидыНалогов.ПФРСвыше300тр Тогда
		УправлениеНебольшойФирмойОтчеты.УстановитьЗначениеПользовательскойНастройки(Отчет.КомпоновщикНастроек, "СрокУплаты", ДобавитьМесяц(НачалоГода(Параметры.Период.ДатаНачала),4));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если Параметры.УчетВыплатТекущегоГода Тогда
		Настройка  = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("УчетВыплатТекущегоГода");
		Если Настройка <> Неопределено Тогда
			Настройка.Использование = Истина;
			Настройка.Значение = Истина;
		КонецЕсли;
	КонецЕсли;
	УправлениеНебольшойФирмойОтчеты.УстановитьЗначениеПользовательскойНастройки(Отчет.КомпоновщикНастроек, "Организация", Организация);
	УправлениеНебольшойФирмойОтчеты.УстановитьЗначениеПользовательскойНастройки(Отчет.КомпоновщикНастроек, "ВидВзаиморасчетов", Параметры.ВидВзаиморасчетов);
	Если Параметры.ВидВзаиморасчетов.Количество() = 1
		И Параметры.ВидВзаиморасчетов[0].Значение = Справочники.ВидыНалогов.ПФРСвыше300тр Тогда
		УправлениеНебольшойФирмойОтчеты.УстановитьЗначениеПользовательскойНастройки(Отчет.КомпоновщикНастроек, "СрокУплаты", ДобавитьМесяц(НачалоГода(Параметры.Период.ДатаНачала),4));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	
	Если Параметры.УчетВыплатТекущегоГода Тогда
		Настройка  = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("УчетВыплатТекущегоГода");
		Если Настройка <> Неопределено Тогда
			Настройка.Использование = Истина;
			Настройка.Значение = Истина;
		КонецЕсли;
	КонецЕсли;
	УправлениеНебольшойФирмойОтчеты.УстановитьЗначениеПользовательскойНастройки(Отчет.КомпоновщикНастроек, "Организация", Организация);
	УправлениеНебольшойФирмойОтчеты.УстановитьЗначениеПользовательскойНастройки(Отчет.КомпоновщикНастроек, "ВидВзаиморасчетов", Параметры.ВидВзаиморасчетов);
	Если Параметры.ВидВзаиморасчетов.Количество() = 1
		И Параметры.ВидВзаиморасчетов[0].Значение = Справочники.ВидыНалогов.ПФРСвыше300тр Тогда
		УправлениеНебольшойФирмойОтчеты.УстановитьЗначениеПользовательскойНастройки(Отчет.КомпоновщикНастроек, "СрокУплаты", ДобавитьМесяц(НачалоГода(Параметры.Период.ДатаНачала),4));
	КонецЕсли;
	
КонецПроцедуры

