#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
    
    Если ЭтотОбъект.Значение = "" Тогда
        Задание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.ЧтениеНовостейСлужбыПоддержки);
        Задание.Использование = Ложь;
    Иначе
        Задание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.ЧтениеНовостейСлужбыПоддержки);
        Задание.Использование = Истина;
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти

#КонецЕсли