
#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура ПолучитьНоменклатуру(АдресВременногоХранилища)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("МассивПриходныхНакладных", ПриходныеНакладные.ВыгрузитьЗначения());
	СтруктураПараметров.Вставить("ИспользоватьХарактеристики", ИспользоватьХарактеристики);
	
	Обработки.Ценообразование.ПолучитьНоменклатуруПоПриходнымНакладным(СтруктураПараметров, АдресВременногоХранилища)
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОтчетСПредварительнымРезультатом()
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("ИмяСКД", 					"ПоПриходнымНакладным");
	ПараметрыОткрытия.Вставить("МассивПриходныхНакладных", 	ПриходныеНакладные.ВыгрузитьЗначения());
	ПараметрыОткрытия.Вставить("ИспользоватьХарактеристики",ИспользоватьХарактеристики);
	
	ОткрытьФорму("Обработка.Ценообразование.Форма.ФормаПредварительногоПросмотра", ПараметрыОткрытия, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьВХранилищеДанныеТабличнойЧасти(АдресВременногоХранилища)
	
	ПолучитьНоменклатуру(АдресВременногоХранилища);
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиСообщениеОНеправильномВыборе()
	
	ТекстСообщения = НСтр("ru ='Необходимо заполнить список приходных накладных'");
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "ПриходныеНакладные");
	
КонецПроцедуры

#КонецОбласти

#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Только номенклатуру(0); Номенкатуру и ее характеристики(1);
	ИспользоватьХарактеристики = ?(Параметры.ХарактеристикиВидны = Истина, 1, 0);
	
КонецПроцедуры

#КонецОбласти

#Область СобытияРеквизитовФормы



#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура ОК(Команда)
	
	Если ПриходныеНакладные.Количество() > 0 Тогда
		
		АдресВременногоХранилища = "";
		ЗаписатьВХранилищеДанныеТабличнойЧасти(АдресВременногоХранилища);
		
		Закрыть(Новый Структура("ВыборПроизведен, АдресВременногоХранилища", Истина, АдресВременногоХранилища));
		
	Иначе
		
		ВывестиСообщениеОНеправильномВыборе();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Новый Структура("ВыборПроизведен", Ложь));
	
КонецПроцедуры

&НаКлиенте
Процедура ПредварительныйПросмотр(Команда)
	
	Если ПриходныеНакладные.Количество() > 0 Тогда
		
		ПоказатьОтчетСПредварительнымРезультатом();
		
	Иначе
		
		ВывестиСообщениеОНеправильномВыборе();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
