
&НаКлиенте
Процедура ПометитьКакОсновной(Команда)
	//Определить текущую строку
	ТекущаяСтрокаСписка = Элементы.Список.ТекущиеДанные;
	//Проверить выделение (активизацию) хотя бы одной строки из списка
	Если ТекущаяСтрокаСписка = Неопределено Тогда
		
		ТекстСообщения = НСтр("ru = 'Не выбран программный продук, который необходимо установить программным продуктом по умолчанию'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		Возврат;
		
	КонецЕсли;
		
	ПометитьКакОсновнойНаСервере(ТекущаяСтрокаСписка);
	
	ОповеститьОбИзменении(ТекущаяСтрокаСписка.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ПометитьКакОсновнойНаСервере(ТекущаяСтрокаСписка)
	ОсновнойПП = ТекущаяСтрокаСписка.Владелец.бизОсновнойПП1С;
	КонтрагентОбъект = ТекущаяСтрокаСписка.Владелец.ПолучитьОбъект();
	КонтрагентОбъект.бизОсновнойПП1С = ТекущаяСтрокаСписка.Ссылка;
	КонтрагентОбъект.Записать();	
КонецПроцедуры






