
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТИПЗНАЧЕНИЯ(Обсуждения.Объект) КАК ТИПЗНАЧЕНИЯ
	|ИЗ
	|	РегистрСведений.Обсуждения КАК Обсуждения";
	
	Запрос.УстановитьПараметр("", );
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ТИПЗНАЧЕНИЯ");
	
	Элементы.ТипОбъекта.СписокВыбора.ЗагрузитьЗначения(Результат);
	Элементы.ТипОбъекта.СписокВыбора.СортироватьПоЗначению();
	
	Период = ТекущаяДата();
	
КонецПроцедуры

&НаСервере
Процедура УдалитьНаСервере()

	Запрос = Новый Запрос;
	Условия = "";
	Если ЗначениеЗаполнено(ТипОбъекта) Тогда
		Условия = Условия + " И ТИПЗНАЧЕНИЯ(Обсуждения.Объект) <> &ТипОбъекта ";
	КонецЕсли;
	Если Системный=1 Тогда
		Условия = Условия + " ИЛИ НЕ Обсуждения.Системный ";
	ИначеЕсли Системный=2 Тогда
		Условия = Условия + " ИЛИ Обсуждения.Системный ";
	КонецЕсли; 
	
	//Выбираются те записи, которые НЕ будут удалены
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Обсуждения.Объект,
	|	Обсуждения.МоментВремени,
	|	Обсуждения.Системный,
	|	Обсуждения.Комментарий,
	|	Обсуждения.Пользователь
	|ИЗ
	|	РегистрСведений.Обсуждения КАК Обсуждения
	|ГДЕ
	|	(Обсуждения.МоментВремени <= &НачПериода ИЛИ Обсуждения.МоментВремени >= &КонПериода) "+Условия+"
	|
	|ДЛЯ ИЗМЕНЕНИЯ
	|	РегистрСведений.Обсуждения";
	
	Запрос.УстановитьПараметр("НачПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонПериода", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ТипОбъекта", ТипОбъекта);
	Запрос.УстановитьПараметр("Системный", Истина);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	НаборЗаписей = РегистрыСведений.Обсуждения.СоздатьНаборЗаписей();
	НаборЗаписей.Загрузить(Результат);
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	УдалитьНаСервере();
КонецПроцедуры

