
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СтруктураПараметров = ПолучитьСтруктуруПараметров(ПараметрКоманды);
	ОткрытьФорму(
		"Справочник.СтруктурныеЕдиницы.Форма.ФормаРедактированияСчетовУчета",
		СтруктураПараметров,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка
	);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруПараметров(ПараметрКоманды)
	
	СтруктураПараметров = Новый Структура(
		"СчетУчетаВРознице, СчетУчетаНаценки, Ссылка",
		ПараметрКоманды.СчетУчетаВРознице, ПараметрКоманды.СчетУчетаНаценки, ПараметрКоманды.Ссылка);
		
	Возврат СтруктураПараметров;
	
КонецФункции
