#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции
	
Процедура КонсолидироватьДанныеНаСервере(ПараметрыОтчета, АдресХранилища) Экспорт
	
	Форма = ПараметрыОтчета.Форма;
	
	Успешно = Форма.КонсолидироватьНаСервере(ПараметрыОтчета.ТекстВыгрузки, ПараметрыОтчета.ОшибкаНаСервере
		, ПараметрыОтчета.ЗаполнитьДекларацию, ПараметрыОтчета.ЗаполнитьТолькоПараметры, ПараметрыОтчета.СохраненныйДок);
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ТекстВыгрузки", ПараметрыОтчета.ТекстВыгрузки);
	СтруктураДанных.Вставить("ОшибкаНаСервере", ПараметрыОтчета.ОшибкаНаСервере);
	СтруктураДанных.Вставить("Успешно", Успешно);
	
	ПоместитьВоВременноеХранилище(СтруктураДанных, АдресХранилища);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли