#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПредопределенныеПроцедурыОбработчикиСобытий

// Процедура - обработчик события ОбработкаПроверкиЗаполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Владелец.ЭтоИменнаяКарта Тогда
		ПроверяемыеРеквизиты.Добавить("ВладелецКарты");
	КонецЕсли;
	
	Если Не Владелец.Пустая() Тогда
		Если Владелец.ТипКарты = Перечисления.ТипыКарт.Магнитная Тогда
			ПроверяемыеРеквизиты.Добавить("КодКартыМагнитный");
		ИначеЕсли Владелец.ТипКарты = Перечисления.ТипыКарт.Штриховая Тогда
			ПроверяемыеРеквизиты.Добавить("КодКартыШтрихкод");
		Иначе
			ПроверяемыеРеквизиты.Добавить("КодКартыМагнитный");
			ПроверяемыеРеквизиты.Добавить("КодКартыШтрихкод");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ПередЗаписью.
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Владелец.ЭтоИменнаяКарта Тогда
		ВладелецКарты = Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;
	
	Если Владелец.ТипКарты = Перечисления.ТипыКарт.Магнитная Тогда
		КодКартыШтрихкод = "";
	ИначеЕсли Владелец.ТипКарты = Перечисления.ТипыКарт.Штриховая Тогда
		КодКартыМагнитный = "";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли