
&НаСервере
Процедура ПолучитьПараметрыЗаполнения(СтруктураЗаполнения)
	
	СтруктураЗаполнения.Вставить("Договор", СтруктураЗаполнения.Контрагент.ДоговорПоУмолчанию);
	СтруктураЗаполнения.Вставить("ВидОперации", Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд);
	СтруктураЗаполнения.Вставить("ЭтоГруппа", СтруктураЗаполнения.Контрагент.ЭтоГруппа);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Если Не ЗначениеЗаполнено(ПараметрКоманды) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураЗаполнения = Новый Структура();
	СтруктураЗаполнения.Вставить("Контрагент", ПараметрКоманды);
	ПолучитьПараметрыЗаполнения(СтруктураЗаполнения);
	
	Если СтруктураЗаполнения.ЭтоГруппа Тогда
		ВызватьИсключение НСтр("ru = 'Нельзя выбирать группу контрагентов.'");
	КонецЕсли;
	
	ОткрытьФорму("Документ.ЗаказПокупателя.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", СтруктураЗаполнения));
	
КонецПроцедуры
