////////////////////////////////////////////////////////////////////////////////
// Электронный документооборот с ПФР.
//  
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

// Создание запроса на сверку с ПФР с видом "Справка о состоянии расчетов с ПФР"
//
// Параметры:
//  Организация			 - СправочникСсылка.Организации - Организация, по которой будет создаваться сверка.
//  ПоказыватьРекламу	 - Булево - Если Ложь, то даже если 1С-отчетность не подключена, то 
//		рекламная форма показана не будет.
//
Процедура СоздатьЗапросНаСверкуРасчетовСПФР(Организация = Неопределено, ПоказыватьРекламу = Истина) Экспорт

	ВидСверки = ПредопределенноеЗначение("Перечисление.ВидыУслугПриИОС.СправкаОСостоянииРасчетов");
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Организация", 		Организация);
	ДополнительныеПараметры.Вставить("ВидСверки", 			ВидСверки);
	ДополнительныеПараметры.Вставить("ПоказыватьРекламу", 	ПоказыватьРекламу);
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"СоздатьЗапросНаСверкуПослеПолученияКонтекста", 
		ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент, 
		ДополнительныеПараметры);
		
	ДокументооборотСКОКлиент.ПолучитьКонтекстЭДО(ОписаниеОповещения);
	// В процедуре ниже ничего не писать - это асинхронный метод!
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти