#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриОпределенииНастроекОтчета(НастройкиОтчета, НастройкиВариантов) Экспорт
	
	НастройкиВариантов["Основной"].Рекомендуемый = Истина;
	НастройкиОтчета.ПоказыватьНастройкиДиаграммыНаФормеОтчета = Ложь;
	
	НастройкиОтчета.Вставить("УровеньГруппировкиСтрок", 2);
	
	УстановитьТегиВариантов(НастройкиВариантов);
	ДобавитьОписанияСвязанныхПолей(НастройкиВариантов);
	
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ОтчетыУНФ.ПриКомпоновкеРезультата(КомпоновщикНастроек, СхемаКомпоновкиДанных, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ПриКонтекстномОткрытии(Объект, ПолеСвязи, Отборы, Отказ) Экспорт
	
	Если ПолеСвязи = "Номенклатура" Тогда
		Отборы.Вставить(ПолеСвязи, Объект.Номенклатура);
	КонецЕсли;
	
	Если ПолеСвязи = "Характеристика" Тогда
		Отборы.Вставить(ПолеСвязи, Объект.Характеристика);
	КонецЕсли;
	
	Если ПолеСвязи = "СерийныйНомер" Тогда
		Отборы.Вставить(ПолеСвязи, Объект.СерийныйНомер);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьТегиВариантов(НастройкиВариантов)
	
	СтруктураВарианта = НастройкиВариантов["Основной"];
	НастройкиВариантов["Основной"].Теги = НСТР("ru = 'Номенклатура,Отгрузки,Запасы,Закупки,Остатки,Продажи,Серийные номера'");
	
КонецПроцедуры

Процедура ДобавитьОписанияСвязанныхПолей(НастройкиВариантов)
	
	ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["Основной"].СвязанныеПоля, "Номенклатура", "Справочник.Номенклатура",,, Истина);
	ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["Основной"].СвязанныеПоля, "Характеристика", "Справочник.ХарактеристикиНоменклатуры",,, Истина);
	ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["Основной"].СвязанныеПоля, "СерийныйНомер", "Справочник.СерийныеНомера",,, Истина);
	
КонецПроцедуры
 
#КонецОбласти 

ЭтоОтчетУНФ = Истина;

#КонецЕсли