
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события ПриСозданииНаСервере формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ПараметрыОтбора") Тогда
		СписокЗаказов = Параметры.ПараметрыОтбора.ОтборЗаказы;
		КратностьДня = Параметры.ПараметрыОтбора.КратностьДня;
		ОграничениеВремениПо = Параметры.ПараметрыОтбора.ОграничениеВремениПо;
		ОграничениеВремениС = Параметры.ПараметрыОтбора.ОграничениеВремениС;
		ОтображатьЗаказНаряды = Параметры.ПараметрыОтбора.ОтображатьЗаказНаряды;
		ОтображатьЗаказыНаПроизводство = Параметры.ПараметрыОтбора.ОтображатьЗаказыНаПроизводство;
		УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Ссылка", СписокЗаказов, Истина, ВидСравненияКомпоновкиДанных.ВСписке);
	КонецЕсли;
	
	// Установим формат для текущей даты: ДФ=Ч:мм
	УправлениеНебольшойФирмойСервер.УстановитьОформлениеКолонкиДата(Список);
	
КонецПроцедуры // ПриСозданииНаСервере()

// Процедура - обработчик события ПриОткрытии формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Элементы.Список.ТекущаяСтрока = Неопределено Тогда
		Элементы.КМСписокИзменить.Доступность = Ложь;
		Элементы.СписокИзменить.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры // ПриОткрытии()

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Ключ", ВыбраннаяСтрока);
	ПараметрыОткрытия.Вставить("КратностьДня", КратностьДня);
	ПараметрыОткрытия.Вставить("ОграничениеВремениПо", ОграничениеВремениПо);
	ПараметрыОткрытия.Вставить("ОграничениеВремениС", ОграничениеВремениС);
	ПараметрыОткрытия.Вставить("ОтображатьЗаказНаряды", ОтображатьЗаказНаряды);
	ПараметрыОткрытия.Вставить("ОтображатьЗаказыНаПроизводство", ОтображатьЗаказыНаПроизводство);
	
	Если ТипЗнч(ВыбраннаяСтрока) = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда
		ОткрытьФорму("Документ.ЗаказНаПроизводство.Форма.ФормаЗаявки", ПараметрыОткрытия, Элементы.Список,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ОткрытьФорму("Документ.ЗаказПокупателя.Форма.ФормаЗаявки", ПараметрыОткрытия, Элементы.Список,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Изменить(Команда)
	
	ВыбраннаяСтрока = Элементы.Список.ТекущаяСтрока;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Ключ", ВыбраннаяСтрока);
	ПараметрыОткрытия.Вставить("КратностьДня", КратностьДня);
	ПараметрыОткрытия.Вставить("ОграничениеВремениПо", ОграничениеВремениПо);
	ПараметрыОткрытия.Вставить("ОграничениеВремениС", ОграничениеВремениС);
	ПараметрыОткрытия.Вставить("ОтображатьЗаказНаряды", ОтображатьЗаказНаряды);
	ПараметрыОткрытия.Вставить("ОтображатьЗаказыНаПроизводство", ОтображатьЗаказыНаПроизводство);
	
	Если ТипЗнч(ВыбраннаяСтрока) = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда
		ОткрытьФорму("Документ.ЗаказНаПроизводство.Форма.ФормаЗаявки", ПараметрыОткрытия, Элементы.Список,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ОткрытьФорму("Документ.ЗаказПокупателя.Форма.ФормаЗаявки", ПараметрыОткрытия, Элементы.Список,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры




