
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ТипЗначения", ТипЗначения);
	ПредставлениеТипа = Строка(ТипЗначения.Типы().Получить(0));
	ТекСписок = ХранилищеСистемныхНастроек.Загрузить("БыстрыеНастройкиОформленияОтчетов", ПредставлениеТипа);
	Если НЕ ТипЗнч(ТекСписок)=Тип("СписокЗначений") Тогда
		ТекСписок = Новый СписокЗначений;
	КонецЕсли;
	Для каждого Элемент Из ТекСписок Цикл
		БыстрыеНастройки.Добавить(Элемент.Значение, Элемент.Представление,, Элемент.Картинка);
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура Принять(Команда)
	
	ПринятьНаСервере();
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПринятьНаСервере()
	
	ПредставлениеТипа = Строка(ТипЗначения.Типы().Получить(0));
	ХранилищеСистемныхНастроек.Сохранить("БыстрыеНастройкиОформленияОтчетов", ПредставлениеТипа, БыстрыеНастройки);
	
КонецПроцедуры

&НаКлиенте
Процедура БыстрыеНастройкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
КонецПроцедуры

