
#Область ВспомогательныеПроцедурыИФункции

&НаКлиенте
Процедура Подключаемый_ОбработатьАктивизациюСтрокиСписка()
	
	ТекущаяСтрока = Элементы.БанковскиеВыписки.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено
		И ТекущаяСтрока.Свойство("Дата")
		И ТекущаяСтрока.Свойство("БанковскийСчетКасса") Тогда
		
		СтруктураДанные = ПолучитьДанныеПоБанковскомуСчету(ТекущаяСтрока.Дата, ТекущаяСтрока.БанковскийСчетКасса);
		ЗаполнитьЗначенияСвойств(ЭтаФорма, СтруктураДанные);
		Дата = НСтр("ru = 'Ведомость за '") + Формат(ТекущаяСтрока.Дата, "ДЛФ=D");
		НомерБанковскогоСчета = СтруктураДанные.НомерБанковскогоСчета;
		Если СтруктураДанные.УчетВалютныхОпераций Тогда
			НомерБанковскогоСчета = НомерБанковскогоСчета + " (" + ?(ЗначениеЗаполнено(ТекущаяСтрока.Валюта), ТекущаяСтрока.Валюта, НСтр("ru = '<валюта пустая>'")) + ")";
		КонецЕсли;
		
		ТаблицаИтогов[0].Значение = ИнформацияСуммаВалНачальныйОстаток;
		ТаблицаИтогов[1].Значение = ИнформацияСуммаВалПриход;
		ТаблицаИтогов[2].Значение = ИнформацияСуммаВалРасход;
		ТаблицаИтогов[3].Значение = ИнформацияСуммаВалКонечныйОстаток;
		
	Иначе
		
		ИнформацияСуммаВалКонечныйОстаток = 0;
		ИнформацияСуммаВалНачальныйОстаток = 0;
		ИнформацияСуммаВалПриход = 0;
		ИнформацияСуммаВалРасход = 0;
		Дата = "<Не выбран документ>";
		НомерБанковскогоСчета = "";
		
	Конецесли;
	
КонецПроцедуры // ОбработатьАктивизациюСтрокиСписка()

&НаСервереБезКонтекста
Функция ПолучитьДанныеПоБанковскомуСчету(Период, БанковскийСчет)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДенежныеСредстваОстаткиИОбороты.СуммаВалНачальныйОстаток КАК ИнформацияСуммаВалНачальныйОстаток,
	|	ДенежныеСредстваОстаткиИОбороты.СуммаВалПриход КАК ИнформацияСуммаВалПриход,
	|	ДенежныеСредстваОстаткиИОбороты.СуммаВалРасход КАК ИнформацияСуммаВалРасход,
	|	ДенежныеСредстваОстаткиИОбороты.СуммаВалКонечныйОстаток КАК ИнформацияСуммаВалКонечныйОстаток
	|ИЗ
	|	РегистрНакопления.ДенежныеСредства.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, День, , БанковскийСчетКасса = &БанковскийСчет) КАК ДенежныеСредстваОстаткиИОбороты";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Период));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Период));
	Запрос.УстановитьПараметр("БанковскийСчет", БанковскийСчет);
	ВыборкаРезультата = Запрос.Выполнить().Выбрать();
	
	Если ЗначениеЗаполнено(БанковскийСчет) Тогда
		НомерБанковскогоСчета = ?(ТипЗнч(БанковскийСчет) = Тип("СправочникСсылка.БанковскиеСчета"), БанковскийСчет.НомерСчета, БанковскийСчет);
	Иначе
		НомерБанковскогоСчета = "";
	КонецЕсли;
	
	Если ВыборкаРезультата.Следующий() Тогда
		СтруктураВозврата = Новый Структура("ИнформацияСуммаВалНачальныйОстаток, ИнформацияСуммаВалКонечныйОстаток, ИнформацияСуммаВалПриход, ИнформацияСуммаВалРасход, УчетВалютныхОпераций, НомерБанковскогоСчета");
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, ВыборкаРезультата);
		СтруктураВозврата.УчетВалютныхОпераций = ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций");
		СтруктураВозврата.НомерБанковскогоСчета = НомерБанковскогоСчета;
		Возврат СтруктураВозврата;
	Иначе
		Возврат Новый Структура(
			"ИнформацияСуммаВалКонечныйОстаток, ИнформацияСуммаВалНачальныйОстаток, ИнформацияСуммаВалПриход, ИнформацияСуммаВалРасход, УчетВалютныхОпераций, НомерБанковскогоСчета",
			0,0,0,0,Ложь,НомерБанковскогоСчета
		);
	КонецЕсли;
	
КонецФункции // ПолучитьДанныеПобанковскомуСчету()

#КонецОбласти

#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Отборы
	// Банк и касса
	ПрочитатьРасчетныеСчетаИКассы();
	// Конец Отборы
	
	// Итоги
	НеОтображатьИтоги = Перечисления.ВариантыОтображенияИтоговБанкИКасса.НеОтображатьИтоги;
	ВедомостьЗаДень = Перечисления.ВариантыОтображенияИтоговБанкИКасса.ВедомостьЗаДень;
	ВедомостьЗаПериод = Перечисления.ВариантыОтображенияИтоговБанкИКасса.ВедомостьЗаПериод;
	
	Если НЕ ЗначениеЗаполнено(ВариантОтображенияИтогов) ИЛИ НЕ ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций") Тогда
		ВариантОтображенияИтогов = ПредопределенноеЗначение("Перечисление.ВариантыОтображенияИтоговБанкИКасса.ВедомостьЗаДень");
		Если НЕ ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций") Тогда
			Элементы.ДекорацияОткрытьФормуНастройкиИтогов.Видимость = Ложь;
			Элементы.ДекорацияОткрытьФормуНастройкиИтогов2.Видимость = Ложь;
			Элементы.ДекорацияОткрытьФормуНастройкиИтогов3.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьТаблицуИтогов();
	// Конец Итоги
	
	//УНФ.ОтборыСписка
	Если Параметры.Свойство("ЭтоНачальнаяСтраница") Тогда
		РаботаСОтборами.ВосстановитьНастройкиОтборов(ЭтотОбъект, БанковскиеВыписки, "БанковскиеВыписки");
		ЭтоНачальнаяСтраница = Ложь;
	Иначе
		ЭтоНачальнаяСтраница = Истина;
		РаботаСОтборами.СвернутьРазвернутьОтборыНаСервере(ЭтотОбъект, Ложь);
		ПредставлениеПериода = РаботаСОтборамиКлиентСервер.ОбновитьПредставлениеПериода(Неопределено);
	КонецЕсли;
	//Конец УНФ.ОтборыСписка
	
	// Установим формат для текущей даты: ДФ=Ч:мм
	УправлениеНебольшойФирмойСервер.УстановитьОформлениеКолонкиДата(БанковскиеВыписки);
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	// Вариант отображения итогов.
	Если НЕ ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций") Тогда
		ВариантОтображенияИтогов = ПредопределенноеЗначение("Перечисление.ВариантыОтображенияИтоговБанкИКасса.ВедомостьЗаДень");
	Иначе
		ТекущийВариантОтображенияИтогов = Настройки.Получить("ВариантОтображенияИтогов");
		Если ЗначениеЗаполнено(ТекущийВариантОтображенияИтогов) Тогда
			ВариантОтображенияИтогов = ТекущийВариантОтображенияИтогов;
			ОтборВалютаВедомости = Настройки.Получить("ОтборВалютаВедомости");
			ОтборВалютаОстатков = Настройки.Получить("ОтборВалютаОстатков");
		КонецЕсли;
	КонецЕсли;
	НастройкаИтоговЗавершениеНаСервере();
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если НЕ ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций") Тогда
		ВариантОтображенияИтогов = ПредопределенноеЗначение("Перечисление.ВариантыОтображенияИтоговБанкИКасса.ВедомостьЗаДень");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если НЕ ЗавершениеРаботы Тогда
		//УНФ.ОтборыСписка
		СохранитьНастройкиОтборов();
		//Конец УНФ.ОтборыСписка
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	ЗагрузитьИзФайлаФрагмент();
	
КонецПроцедуры // ЗагрузитьИзФайла()

&НаКлиенте
Процедура ЗагрузитьИзФайлаФрагмент(ПараметрБанковскийСчет = Неопределено)
	
	Если ПараметрБанковскийСчет = Неопределено Тогда
		СтруктураПрямогоОбмена = КлиентБанкВызовСервера.ПолучитьСтруктуруПрямогоОбмена();
		Если СтруктураПрямогоОбмена.БанковскийСчет = Неопределено Тогда // Есть несколько счетов, нужно выбирать.
			Отбор = Новый Структура("ЭтоСчетОрганизации", Истина);
			ОткрытьФорму("Справочник.БанковскиеСчета.Форма.ФормаВыбораБезВладельца", Новый Структура("ТекущаяСтрока, Отбор", СтруктураПрямогоОбмена.БанковскийСчет, Отбор), ЭтаФорма);
		ИначеЕсли СтруктураПрямогоОбмена.БанковскийСчет.Пустая() Тогда  // Нет ни одной настройки обмена с банками, можно сразу выбирать файл загрузки.
			УправлениеНебольшойФирмойКлиент.ЗагрузитьДанныеИзФайлаВыписки(УникальныйИдентификатор);
		Иначе                                                           // Один счет, можно сразу подставить его.
			ОткрытьФорму(
				"Обработка.КлиентБанк.Форма.ФормаЗагрузка",
				СтруктураПрямогоОбмена
			);
		КонецЕсли;
	Иначе
		СтруктураОбмена = КлиентБанкВызовСервера.ПолучитьСтруктуруОбмена(ПараметрБанковскийСчет);
		Если НЕ СтруктураОбмена.ПрямойОбмен Тогда
			КлиентБанкКлиент.ЗагрузитьДанныеИзФайлаВыписки(УникальныйИдентификатор, СтруктураОбмена);
		Иначе
			ОткрытьФорму(
				"Обработка.КлиентБанк.Форма.ФормаЗагрузка",
				СтруктураОбмена
			);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура БанковскиеВыпискиПриАктивизацииСтроки(Элемент)
	
	Если ВариантОтображенияИтогов = ВедомостьЗаДень Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ОбработатьАктивизациюСтрокиСписка", 0.2, Истина);
	КонецЕсли;
	
КонецПроцедуры // БанковскиеВыпискиПриАктивизацииСтроки()

&НаКлиенте
Процедура БанковскиеВыпискиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование Тогда
		возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Параметр) Тогда
		возврат;
	КонецЕсли;
	
	Отказ = Истина;
	
	ИмяДокумента = РаботаСФормойДокументаКлиент.ПолучитьИмяДокументаПоТипу(Параметр);
	ДвиженияДенежныхСредствКлиент.СоздатьДокумент(ИмяДокумента, "", ДанныеМеток, "БанковскиеВыписки");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОповещениеОбИзмененииДолга" Тогда
		Если ВариантОтображенияИтогов = ВедомостьЗаДень Тогда
			Подключаемый_ОбработатьАктивизациюСтрокиСписка();
		ИначеЕсли ВариантОтображенияИтогов <> НеОтображатьИтоги Тогда // Итоги по валюте (за период) и остаток в валюте.
			НастройкаИтоговЗавершениеНаСервере();
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "Запись_ПоступлениеНаСчет" ИЛИ
		ИмяСобытия = "Запись_РасходСоСчета" Тогда
		Если Параметр.Свойство("УдалениеПомеченных") И Параметр.УдалениеПомеченных Тогда
			Возврат;
		КонецЕсли;
		Элементы.БанковскиеВыписки.ТекущаяСтрока = Параметр.Ссылка;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаОповещения()

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.БанковскиеСчета") Тогда
		ЗагрузитьИзФайлаФрагмент(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВедомостьПерейти(Команда)
	
	ОткрытьФорму("Отчет.ДенежныеСредства.Форма", Новый Структура("КлючВарианта", "Ведомость"));
	
КонецПроцедуры // ВедомостьПерейти()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьПоШаблону(Команда)
	
	ЗаполнениеОбъектовУНФКлиент.ПоказатьВыборШаблонаДляСозданияДокументаИзСписка(БанковскиеВыписки, Элементы.БанковскиеВыписки.ТекущаяСтрока);
	
КонецПроцедуры

#КонецОбласти

#Область Отборы

&НаСервере
Процедура ПрочитатьРасчетныеСчетаИКассы()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БанковскиеСчета.Ссылка,
		|	ПРЕДСТАВЛЕНИЕ(БанковскиеСчета.Ссылка) КАК Представление
		|ИЗ
		|	Справочник.БанковскиеСчета КАК БанковскиеСчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО БанковскиеСчета.Владелец = Организации.Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСчетов = РезультатЗапроса.Выбрать();
	
	Элементы.ОтборСчетИКасса.СписокВыбора.Очистить();
	
	Пока ВыборкаСчетов.Следующий() Цикл
		Элементы.ОтборСчетИКасса.СписокВыбора.Добавить(ВыборкаСчетов.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

#Область ОтборПоПериоду

// Процедура настривает период динамического списка (если требуется интерактивный выбор периода).
//
&НаКлиенте
Процедура УстановитьПериодЗавершение(Результат, Параметры) Экспорт
	
	УстановитьПериодЗавершениеНаСервере(Результат, Параметры);
	
КонецПроцедуры

// Процедура настривает период динамического списка на сервере (если требуется интерактивный выбор периода).
//
&НаСервере
Процедура УстановитьПериодЗавершениеНаСервере(Результат, Параметры)
	
	Если Результат <> Неопределено Тогда
		
		Элементы[Параметры.ИмяСписка].Период.Вариант = Результат.Вариант;
		Элементы[Параметры.ИмяСписка].Период.ДатаНачала = Результат.ДатаНачала;
		Элементы[Параметры.ИмяСписка].Период.ДатаОкончания = Результат.ДатаОкончания;
		Элементы[Параметры.ИмяСписка].Обновить();
		
		ВидПериодаЖурнала = ПолучитьПредставлениеПериода(Результат, " - ");
		
	КонецЕсли;
	
КонецПроцедуры

// Функция возвращает представление стандартного периода.
//
&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьПредставлениеПериода(СтандартныйПериод, Разделитель = " по ")
	
	ДатаНачала = СтандартныйПериод.ДатаНачала;
	ДатаОкончания = СтандартныйПериод.ДатаОкончания;
	Если Не ЗначениеЗаполнено(ДатаНачала) И Не ЗначениеЗаполнено(ДатаОкончания) Тогда
		Возврат "Интервал: <За все время>";
	ИначеЕсли СтандартныйПериод.Вариант <> ВариантСтандартногоПериода.ПроизвольныйПериод Тогда
		Возврат "Интервал: <" + СтандартныйПериод.Вариант + ">";
	ИначеЕсли Год(ДатаНачала) = Год(ДатаОкончания) И Месяц(ДатаНачала) = Месяц(ДатаОкончания) Тогда
		Возврат "Интервал: " + Формат(ДатаНачала, "ДФ=dd")+Разделитель+Формат(ДатаОкончания, "ДФ=dd.MM.yyyy");
	ИначеЕсли Год(ДатаНачала) = Год(ДатаОкончания) Тогда
		Возврат "Интервал: " + Формат(ДатаНачала, "ДФ=dd.MM")+Разделитель+Формат(ДатаОкончания, "ДФ=dd.MM.yyyy");
	Иначе
		Возврат "Интервал: " + Формат(ДатаНачала, "ДФ=dd.MM.yyyy")+Разделитель+Формат(ДатаОкончания, "ДФ=dd.MM.yyyy");
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ДИНАМИЧЕСКОГО СПИСКА

// Выбор значения отбора в поле отбора
&НаКлиенте
Процедура ОтборКонтрагентОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	УстановитьМеткуИОтборСписка("БанковскиеВыписки", "Контрагент", Элемент.Родитель.Имя, ВыбранноеЗначение);
	//Элемент.ОбновитьТекстРедактирования();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	УстановитьМеткуИОтборСписка("БанковскиеВыписки", "ОрганизацияДляОтбора", Элемент.Родитель.Имя, ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВидОперацииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Строка") Тогда
		УстановитьМеткуИОтборСписка("БанковскиеВыписки", "ВидОперации", Элемент.Родитель.Имя, "Перемещение. "+СокрЛП(ВыбранноеЗначение));
	Иначе
		УстановитьМеткуИОтборСписка("БанковскиеВыписки", "ВидОперации", Элемент.Родитель.Имя, ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСчетИКассаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	//!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
	// НУЖНО ДОРАБОТАТЬ, чтобы для перемещения действовало условие ИЛИ для кассы и кассы получателя (тоже для РС)!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
	//!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
	УстановитьМеткуИОтборСписка("БанковскиеВыписки", "БанковскийСчет", Элемент.Родитель.Имя, ВыбранноеЗначение);
	//Элемент.ОбновитьТекстРедактирования();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборАвторОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	УстановитьМеткуИОтборСписка("БанковскиеВыписки", "Автор", Элемент.Родитель.Имя, ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВидОперацииНачалоВыбораЗавершение(РезультатЗавершения, ПараметрыЗавершения) Экспорт
	
	Если ЗначениеЗаполнено(РезультатЗавершения) Тогда
		Если ТипЗнч(РезультатЗавершения) = Тип("Строка") Тогда
			СтандартнаяОбработка = Ложь;
			УстановитьМеткуИОтборСписка("БанковскиеВыписки", "ВидОперации", "ГруппаОтборВидОперации", "Перемещение. "+РезультатЗавершения);
		Иначе
			СтандартнаяОбработка = Ложь;
			УстановитьМеткуИОтборСписка("БанковскиеВыписки", "ВидОперации", "ГруппаОтборВидОперации", РезультатЗавершения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область МеткиОтборов

&НаСервере
Процедура УстановитьМеткуИОтборСписка(СписокДляОтбора, ИмяПоляОтбораСписка, ГруппаРодительМетки, ВыбранноеЗначение, ПредставлениеЗначения="", ИмяПараметраЗапроса="")
	
	Если ПредставлениеЗначения="" Тогда
		ПредставлениеЗначения=Строка(ВыбранноеЗначение);
	КонецЕсли; 
	
	РаботаСОтборами.ПрикрепитьМеткуОтбора(ЭтотОбъект, ИмяПоляОтбораСписка, ГруппаРодительМетки, ВыбранноеЗначение, ПредставлениеЗначения, СписокДляОтбора, ИмяПараметраЗапроса);
	
	Если ИмяПараметраЗапроса="" Тогда
		РаботаСОтборами.УстановитьОтборСписка(ЭтотОбъект, ЭтотОбъект[СписокДляОтбора], ИмяПоляОтбораСписка);
	Иначе	
		
		СтруктураОтбораМеток = Новый Структура("ИмяПараметраЗапроса", ИмяПараметраЗапроса);
		НайденныеСтроки = ДанныеМеток.НайтиСтроки(СтруктураОтбораМеток);
		МассивОтбора = Новый Массив;
		Для каждого стр Из НайденныеСтроки Цикл
			МассивОтбора.Добавить(стр.Метка);
		КонецЦикла;
		ЭтотОбъект[СписокДляОтбора].Параметры.УстановитьЗначениеПараметра("БезОтбора", НайденныеСтроки.Количество()=0);
		ЭтотОбъект[СписокДляОтбора].Параметры.УстановитьЗначениеПараметра(ИмяПараметраЗапроса, МассивОтбора);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_МеткаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МеткаИД = Сред(Элемент.Имя, СтрДлина("Метка_")+1);
	
	ИмяГруппыРодителя = СокрЛП(Элемент.Родитель.Имя);
	ИмяРеквизитаСписка = "БанковскиеВыписки";
	
	УдалитьМеткуОтбора(МеткаИД, ИмяРеквизитаСписка);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьМеткуОтбора(МеткаИД, ИмяРеквизитаСписка)
	
	РаботаСОтборами.УдалитьМеткуОтбораСервер(ЭтотОбъект, ЭтотОбъект[ИмяРеквизитаСписка], МеткаИД, ИмяРеквизитаСписка);

КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаНажатие(Элемент, СтандартнаяОбработка)
	
	СтруктураИменЭлементов = Новый Структура("ОтборПериод, ПредставлениеПериода, СобытиеОповещения", "ОтборПериод", "ПредставлениеПериода", "ОповещениеОбИзмененииДолга");
	
	СтандартнаяОбработка = Ложь;
	РаботаСОтборамиКлиент.ПредставлениеПериодаВыбратьПериод(ЭтотОбъект, "БанковскиеВыписки", "Дата", СтруктураИменЭлементов);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиОтборов()
	
	Если НЕ ЭтоНачальнаяСтраница Тогда
		РаботаСОтборами.СохранитьНастройкиОтборов(ЭтотОбъект, "БанковскиеВыписки");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьРазвернутьПанельОтборов(Элемент)
	
	НовоеЗначениеВидимость = НЕ Элементы.ФильтрыНастройкиИДопИнфо.Видимость;
	РаботаСОтборамиКлиент.СвернутьРазвернутьПанельОтборов(ЭтотОбъект, НовоеЗначениеВидимость);
	
КонецПроцедуры

#КонецОбласти

#Область РасходСоСчета

// Обработчик команды "РасходПоставщикуБанк" формы.
//
&НаКлиенте
Процедура РасходПоставщикуБанк(Команда)
	
	ДвиженияДенежныхСредствКлиент.СоздатьДокумент("РасходСоСчета", "Поставщику", ДанныеМеток, "БанковскиеВыписки");
	
КонецПроцедуры

// Обработчик команды "РасходЗарплатаПоВедомостиБанк" формы.
//
&НаКлиенте
Процедура РасходЗарплатаПоВедомостиБанк(Команда)
	
	ДвиженияДенежныхСредствКлиент.СоздатьДокумент("РасходСоСчета", "Зарплата", ДанныеМеток, "БанковскиеВыписки");
	
КонецПроцедуры

// Обработчик команды "РасходПокупателюБанк" формы.
//
&НаКлиенте
Процедура РасходПокупателюБанк(Команда)
	
	ДвиженияДенежныхСредствКлиент.СоздатьДокумент("РасходСоСчета", "Покупателю", ДанныеМеток, "БанковскиеВыписки");
	
КонецПроцедуры

// Обработчик команды "РасходВозвратКредитаБанк" формы.
//
&НаКлиенте
Процедура РасходВозвратКредитаБанк(Команда)
	
	ДвиженияДенежныхСредствКлиент.СоздатьДокумент("РасходСоСчета", "РасчетыПоКредитам", ДанныеМеток, "БанковскиеВыписки");
	
КонецПроцедуры

// Обработчик команды "РасходВыдачаЗаймаБанк" формы.
//
&НаКлиенте
Процедура РасходВыдачаЗаймаБанк(Команда)
	
	ДвиженияДенежныхСредствКлиент.СоздатьДокумент("РасходСоСчета", "ВыдачаЗаймаСотруднику", ДанныеМеток, "БанковскиеВыписки");
	
КонецПроцедуры

// Обработчик команды "РасходПрочееБанк" формы.
//
&НаКлиенте
Процедура РасходПрочееБанк(Команда)
	
	ДвиженияДенежныхСредствКлиент.СоздатьДокумент("РасходСоСчета", "Прочее", ДанныеМеток, "БанковскиеВыписки");
	
КонецПроцедуры

// Обработчик команды "РасходПодотчетникуБанк" формы.
//
&НаКлиенте
Процедура РасходПодотчетникуБанк(Команда)
	
	ДвиженияДенежныхСредствКлиент.СоздатьДокумент("РасходСоСчета", "Подотчетнику", ДанныеМеток, "БанковскиеВыписки");
	
КонецПроцедуры

// Обработчик команды "РасходОтчетЭквайрераБанк" формы.
//
&НаКлиенте
Процедура РасходОтчетЭквайрераБанк(Команда)
	
	ДвиженияДенежныхСредствКлиент.СоздатьДокумент("РасходСоСчета", "ВозвратОплатыНаПлатежныеКарты", ДанныеМеток, "БанковскиеВыписки");
	
КонецПроцедуры

// Обработчик команды "РасходНалогиБанк" формы.
//
&НаКлиенте
Процедура РасходНалогиБанк(Команда)
	
	ДвиженияДенежныхСредствКлиент.СоздатьДокумент("РасходСоСчета", "Налоги", ДанныеМеток, "БанковскиеВыписки");
	
КонецПроцедуры

// Обработчик команды "РасходНаРасходыБанк" формы.
//
&НаКлиенте
Процедура РасходНаРасходыБанк(Команда)
	
	ДвиженияДенежныхСредствКлиент.СоздатьДокумент("РасходСоСчета", "НаРасходы", ДанныеМеток, "БанковскиеВыписки");
	
КонецПроцедуры

// Обработчик команды "РасходПрочиеРачетыБанк" формы.
//
&НаКлиенте
Процедура РасходПрочиеРачетыБанк(Команда)
	
	ДвиженияДенежныхСредствКлиент.СоздатьДокумент("РасходСоСчета", "ПрочиеРасчеты", ДанныеМеток, "БанковскиеВыписки");
	
КонецПроцедуры

#КонецОбласти

#Область ПоступлениеНаСчет

&НаКлиенте
Процедура ПоступлениеОтПокупателяБанк(Команда)
	
	ДвиженияДенежныхСредствКлиент.СоздатьДокумент("ПоступлениеНаСчет", "ОтПокупателя", ДанныеМеток, "БанковскиеВыписки");
	
КонецПроцедуры


&НаКлиенте
Процедура ПоступлениеПрочееБанк(Команда)
	
	ДвиженияДенежныхСредствКлиент.СоздатьДокумент("ПоступлениеНаСчет", "Прочее", ДанныеМеток, "БанковскиеВыписки");
	
КонецПроцедуры


&НаКлиенте
Процедура ПоступлениеОтПоставщикаБанк(Команда)
	
	ДвиженияДенежныхСредствКлиент.СоздатьДокумент("ПоступлениеНаСчет", "ОтПоставщика", ДанныеМеток, "БанковскиеВыписки");
	
КонецПроцедуры


&НаКлиенте
Процедура ПоступлениеПолучениеКредитаБанк(Команда)
	
	ДвиженияДенежныхСредствКлиент.СоздатьДокумент("ПоступлениеНаСчет", "РасчетыПоКредитам", ДанныеМеток, "БанковскиеВыписки");
	
КонецПроцедуры


&НаКлиенте
Процедура ПоступлениеВозвратЗаймаСотрудникомБанк(Команда)
	
	ДвиженияДенежныхСредствКлиент.СоздатьДокумент("ПоступлениеНаСчет", "ВозвратЗаймаСотрудником", ДанныеМеток, "БанковскиеВыписки");
	
КонецПроцедуры


&НаКлиенте
Процедура ПоступлениеПрочиеРасчетыБанк(Команда)
	
	ДвиженияДенежныхСредствКлиент.СоздатьДокумент("ПоступлениеНаСчет", "ПрочиеРасчеты", ДанныеМеток, "БанковскиеВыписки");
	
КонецПроцедуры


&НаКлиенте
Процедура ПоступлениеОтПодотчетникаБанк(Команда)
	
	ДвиженияДенежныхСредствКлиент.СоздатьДокумент("ПоступлениеНаСчет", "ОтПодотчетника", ДанныеМеток, "БанковскиеВыписки");
	
КонецПроцедуры


&НаКлиенте
Процедура ПоступлениеОтчетЭквайрераБанк(Команда)
	
	ДвиженияДенежныхСредствКлиент.СоздатьДокумент("ПоступлениеНаСчет", "ПоступлениеОплатыПоКартам", ДанныеМеток, "БанковскиеВыписки");
	
КонецПроцедуры


&НаКлиенте
Процедура ПоступлениеНалогиБанк(Команда)
	
	ДвиженияДенежныхСредствКлиент.СоздатьДокумент("ПоступлениеНаСчет", "Налоги", ДанныеМеток, "БанковскиеВыписки");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоступлениеПокупкаВалютыБанк(Команда)
	
	ДвиженияДенежныхСредствКлиент.СоздатьДокумент("ПоступлениеНаСчет", "ПокупкаВалюты", ДанныеМеток, "БанковскиеВыписки");
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ЗаполнитьТаблицуИтогов()
	
	ТаблицаИтогов.Очистить();
	
	// Начальный остаток
	СтрокаИтогов = ТаблицаИтогов.Добавить();
	СтрокаИтогов.Показатель = "Начало дня";
	СтрокаИтогов.Значение = 0;
	
	// Начальный остаток
	СтрокаИтогов = ТаблицаИтогов.Добавить();
	СтрокаИтогов.Показатель = "Поступило";
	СтрокаИтогов.Значение = 0;
	
	// Начальный остаток
	СтрокаИтогов = ТаблицаИтогов.Добавить();
	СтрокаИтогов.Показатель = "Списано";
	СтрокаИтогов.Значение = 0;
	
	// Начальный остаток
	СтрокаИтогов = ТаблицаИтогов.Добавить();
	СтрокаИтогов.Показатель = "Конец дня";
	СтрокаИтогов.Значение = 0;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнформациюОбИтогахПоВалюте()
	
	Если НЕ ОтборВалютаВедомости.Пустая() Тогда
		
		СтруктураДанные = ПолучитьДанныеПоВалюте(ОтборПериод, ОтборВалютаВедомости);
		
		ТаблицаИтогов[0].Значение = СтруктураДанные.ИнформацияСуммаВалНачальныйОстаток;
		ТаблицаИтогов[1].Значение = СтруктураДанные.ИнформацияСуммаВалПриход;
		ТаблицаИтогов[2].Значение = СтруктураДанные.ИнформацияСуммаВалРасход;
		ТаблицаИтогов[3].Значение = СтруктураДанные.ИнформацияСуммаВалКонечныйОстаток;
		
	Иначе
		ИнформацияСуммаВалКонечныйОстаток = 0;
		ИнформацияСуммаВалНачальныйОстаток = 0;
		ИнформацияСуммаВалПриход = 0;
		ИнформацияСуммаВалРасход = 0;
		Дата = "";
	Конецесли;
	
КонецПроцедуры // ОбработатьАктивизациюСтрокиСписка()

&НаСервереБезКонтекста
Функция ПолучитьДанныеПоВалюте(Период, Валюта)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДенежныеСредстваОстаткиИОбороты.СуммаВалНачальныйОстаток КАК ИнформацияСуммаВалНачальныйОстаток,
	|	ДенежныеСредстваОстаткиИОбороты.СуммаВалПриход КАК ИнформацияСуммаВалПриход,
	|	ДенежныеСредстваОстаткиИОбороты.СуммаВалРасход КАК ИнформацияСуммаВалРасход,
	|	ДенежныеСредстваОстаткиИОбороты.СуммаВалКонечныйОстаток КАК ИнформацияСуммаВалКонечныйОстаток
	|ИЗ
	|	РегистрНакопления.ДенежныеСредства.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , Валюта = &Валюта) КАК ДенежныеСредстваОстаткиИОбороты";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Период.ДатаНачала));
	Запрос.УстановитьПараметр("КонецПериода", ?(Период.ДатаОкончания = '00010101', '39991231', КонецДня(Период.ДатаОкончания)));
	Запрос.УстановитьПараметр("Валюта", Валюта);
	ВыборкаРезультата = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаРезультата.Следующий() Тогда
		СтруктураВозврата = Новый Структура("ИнформацияСуммаВалНачальныйОстаток, ИнформацияСуммаВалКонечныйОстаток, ИнформацияСуммаВалПриход, ИнформацияСуммаВалРасход, УчетВалютныхОпераций, НомерБанковскогоСчета");
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, ВыборкаРезультата);
		СтруктураВозврата.УчетВалютныхОпераций = ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций");
		Возврат СтруктураВозврата;
	Иначе
		Возврат Новый Структура(
			"ИнформацияСуммаВалКонечныйОстаток, ИнформацияСуммаВалНачальныйОстаток, ИнформацияСуммаВалПриход, ИнформацияСуммаВалРасход, УчетВалютныхОпераций, НомерБанковскогоСчета",
			0,0,0,0,Ложь
		);
	КонецЕсли;
	
КонецФункции // ПолучитьДанныеПобанковскомуСчету()

&НаСервереБезКонтекста
Функция ПолучитьОстатокВВалюте(Валюта)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 1) КАК Курс,
		|	ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 1) КАК Кратность
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Валюта) КАК КурсыВалютСрезПоследних";
	
	Запрос.УстановитьПараметр("Валюта", Валюта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПоВалюте = РезультатЗапроса.Выбрать();
	ВыборкаПоВалюте.Следующий();
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ДенежныеСредстваОстатки.СуммаВалОстаток * ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 1) * &Кратность / (ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 1) * &Курс)) КАК ОстатокВВалюте
		|ИЗ
		|	РегистрНакопления.ДенежныеСредства.Остатки(ДатаВремя(3999, 12, 31), ) КАК ДенежныеСредстваОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
		|		ПО ДенежныеСредстваОстатки.Валюта = КурсыВалютСрезПоследних.Валюта";
	
	Запрос.УстановитьПараметр("Валюта", Валюта);
	Запрос.УстановитьПараметр("Кратность", ВыборкаПоВалюте.Кратность);
	Запрос.УстановитьПараметр("Курс", ВыборкаПоВалюте.Курс);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СтруктураВозврата = Новый Структура("Курс, Остаток", ВыборкаПоВалюте.Курс, 0);
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		СтруктураВозврата.Вставить("Остаток", ВыборкаДетальныеЗаписи.ОстатокВВалюте);
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаКлиенте
Процедура ДекорацияОткрытьФормуНастройкиИтоговНажатие(Элемент)
	
	НастройкаИтогов(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаИтогов(Команда)
	
	СтруктураПараметров = Новый Структура();
	
	СтруктураПараметров.Вставить("ВариантОтображенияИтогов", ВариантОтображенияИтогов);
	СтруктураПараметров.Вставить("ВалютаВедомости", ОтборВалютаВедомости);
	СтруктураПараметров.Вставить("ВалютаОстатков", ОтборВалютаОстатков);
	
	ОткрытьФорму("ОбщаяФорма.ФормаНастройкиИтоговБанкИКасса", 
		СтруктураПараметров, 
		ЭтотОбъект, 
		УникальныйИдентификатор,,,
		Новый ОписаниеОповещения("НастройкаИтоговЗавершение", ЭтотОбъект), 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаИтоговЗавершение(РезультатЗавершения, ПараметрыЗавершения) Экспорт
	
	Если ТипЗнч(РезультатЗавершения) = Тип("Структура") Тогда
		
		ВариантОтображенияИтогов = РезультатЗавершения.ВариантОтображенияИтогов;
		ОтборВалютаВедомости = РезультатЗавершения.ВалютаВедомости;
		ОтборВалютаОстатков = РезультатЗавершения.ВалютаОстатков;
		
		НастройкаИтоговЗавершениеНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастройкаИтоговЗавершениеНаСервере() Экспорт
	
	Если ВариантОтображенияИтогов = ПредопределенноеЗначение("Перечисление.ВариантыОтображенияИтоговБанкИКасса.ВедомостьЗаДень") Тогда
		
		Элементы.ИнформацияСуммаВалНачальныйОстаток.Видимость = Истина;
		Элементы.ИнформацияСуммаВалПриход.Видимость = Истина;
		Элементы.ИнформацияСуммаВалРасход.Видимость = Истина;
		
		Элементы.ИнформацияСуммаВалНачальныйОстаток.Заголовок = "Начало дня";
		Элементы.ИнформацияСуммаВалКонечныйОстаток.Заголовок = "Конец дня";
		Элементы.ИнформацияСуммаВалКонечныйОстаток.Шрифт = Новый Шрифт(Элементы.ИнформацияСуммаВалКонечныйОстаток.Шрифт,,, Ложь);
		
		ТаблицаИтогов[0].Показатель = НСтр("ru = 'Начало дня'");
		ТаблицаИтогов[3].Показатель = НСтр("ru = 'Конец дня'");
		
		Элементы.СтраницаЗаДень.Видимость = Истина;
		Элементы.СтраницаЗаПериод.Видимость = Ложь;
		Элементы.СтраницаВВалюте.Видимость = Ложь;
		Элементы.СтраницаНеОтображатьИтоги.Видимость = Ложь;
		
		Элементы.Группа5.Видимость = Ложь;
		Элементы.ТаблицаИтогов.Видимость = Истина;
		
		Элементы.СтраницыИтоги.ТекущаяСтраница = Элементы.СтраницаЗаДень;
		
	ИначеЕсли ВариантОтображенияИтогов = ПредопределенноеЗначение("Перечисление.ВариантыОтображенияИтоговБанкИКасса.ВедомостьЗаПериод") Тогда
		
		ЗаполнитьИнформациюОбИтогахПоВалюте();
		
		//Элементы.ДекорацияВедомостьПоВалюте.Заголовок = НСтр("ru = 'Ведомость по валюте '")+""""+ОтборВалютаВедомости + """";
		Элементы.ДекорацияВедомостьПоВалюте.Заголовок = НСтр("ru = 'Ведомость по валюте: '")+ОтборВалютаВедомости;
		
		Элементы.ИнформацияСуммаВалНачальныйОстаток.Видимость = Истина;
		Элементы.ИнформацияСуммаВалПриход.Видимость = Истина;
		Элементы.ИнформацияСуммаВалРасход.Видимость = Истина;
		
		Элементы.ИнформацияСуммаВалНачальныйОстаток.Заголовок = "Начало периода";
		Элементы.ИнформацияСуммаВалКонечныйОстаток.Заголовок = "Конец периода";
		Элементы.ИнформацияСуммаВалКонечныйОстаток.Шрифт = Новый Шрифт(Элементы.ИнформацияСуммаВалКонечныйОстаток.Шрифт,,, Ложь);
		
		Если НЕ ЗначениеЗаполнено(ОтборПериод.ДатаНачала) И НЕ ЗначениеЗаполнено(ОтборПериод.ДатаОкончания) Тогда
			ТаблицаИтогов[0].Показатель = НСтр("ru = 'За все время'");
			ТаблицаИтогов[3].Показатель = НСтр("ru = 'Остаток'");
		Иначе
			ТаблицаИтогов[0].Показатель = НСтр("ru = 'С '")+Формат(ОтборПериод.ДатаНачала, "ДФ=dd.MM.yyyy");
			ТаблицаИтогов[3].Показатель = НСтр("ru = 'По '")+Формат(ОтборПериод.ДатаОкончания, "ДФ=dd.MM.yyyy");
		КонецЕсли;
		
		Элементы.СтраницаЗаДень.Видимость = Ложь;
		Элементы.СтраницаЗаПериод.Видимость = Истина;
		Элементы.СтраницаВВалюте.Видимость = Ложь;
		Элементы.СтраницаНеОтображатьИтоги.Видимость = Ложь;
		
		Элементы.Группа5.Видимость = Ложь;
		Элементы.ТаблицаИтогов.Видимость = Истина;
		
		Элементы.СтраницыИтоги.ТекущаяСтраница = Элементы.СтраницаЗаПериод;
		
	ИначеЕсли ВариантОтображенияИтогов = ПредопределенноеЗначение("Перечисление.ВариантыОтображенияИтоговБанкИКасса.ОстаткиПересчитанныеВВалюту") Тогда
		
		СтруктураДанных = ПолучитьОстатокВВалюте(ОтборВалютаОстатков);
		Элементы.ОтборКурс.Заголовок = НСтр("ru = 'Курс на '")+Формат(ТекущаяДатаСеанса(), "ДФ=dd.MM.yyyy")+"";
		ОтборКурс = ""+СтруктураДанных.Курс;
		ИнформацияСуммаВалКонечныйОстаток = СтруктураДанных.Остаток;
		Элементы.ДекорацияОстатокВВалюте.Заголовок = НСтр("ru = 'Остатки в валюте: '")+ОтборВалютаОстатков;
		
		Элементы.ИнформацияСуммаВалНачальныйОстаток.Видимость = Ложь;
		Элементы.ИнформацияСуммаВалПриход.Видимость = Ложь;
		Элементы.ИнформацияСуммаВалРасход.Видимость = Ложь;
		
		Элементы.ИнформацияСуммаВалКонечныйОстаток.Заголовок = НСтр("ru = 'Остаток'");
		
		Элементы.СтраницаЗаДень.Видимость = Ложь;
		Элементы.СтраницаЗаПериод.Видимость = Ложь;
		Элементы.СтраницаВВалюте.Видимость = Истина;
		Элементы.СтраницаНеОтображатьИтоги.Видимость = Ложь;
		
		Элементы.Группа5.Видимость = Истина;
		Элементы.ТаблицаИтогов.Видимость = Ложь;
		
		Элементы.СтраницыИтоги.ТекущаяСтраница = Элементы.СтраницаВВалюте;
		
	Иначе
		
		Элементы.СтраницаЗаДень.Видимость = Ложь;
		Элементы.СтраницаЗаПериод.Видимость = Ложь;
		Элементы.СтраницаВВалюте.Видимость = Ложь;
		Элементы.СтраницаНеОтображатьИтоги.Видимость = Истина;
		
		Элементы.Группа5.Видимость = Ложь;
		Элементы.ТаблицаИтогов.Видимость = Ложь;
		
		Элементы.СтраницыИтоги.ТекущаяСтраница = Элементы.СтраницаНеОтображатьИтоги;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияНастройкаВыводаИтоговНажатие(Элемент)
	
	НастройкаИтогов(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОстатокВВалютеНажатие(Элемент)
	
	//НастройкаИтогов(Неопределено);
	ПериодОтчета = Новый СтандартныйПериод;
	ПериодОтчета.ДатаНачала = ТекущаяДата(); //Элементы.БанковскиеВыписки.ТекущиеДанные.Дата;
	ПериодОтчета.ДатаОкончания = ТекущаяДата(); //Элементы.БанковскиеВыписки.ТекущиеДанные.Дата;
	ПараметрыОтчета = Новый Структура("СтПериод", ПериодОтчета);
	
	ОткрытьФорму("Отчет.ДенежныеСредства.Форма", Новый Структура("КлючВарианта, СформироватьПриОткрытии, Отбор", "ОстаткиВВалюте", Истина, ПараметрыОтчета));
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияВедомостьПоВалютеНажатие(Элемент)
	
	//НастройкаИтогов(Неопределено);
	ПараметрыОтчета = Новый Структура("СтПериод, Валюта", ОтборПериод, ОтборВалютаВедомости);
	ОткрытьФорму("Отчет.ДенежныеСредства.Форма", Новый Структура("КлючВарианта, СформироватьПриОткрытии, Отбор", "ВедомостьВВалюте", Истина, ПараметрыОтчета));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВалютаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	УстановитьМеткуИОтборСписка("БанковскиеВыписки", "Валюта", Элемент.Родитель.Имя, ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВидОперацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("ЖурналДокументов.ДокументыПоБанку.Форма.ФормаВыбораВидаОперации",,,,,, Новый ОписаниеОповещения("ОтборВидОперацииНачалоВыбораЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура Дата1Нажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элементы.БанковскиеВыписки.ТекущиеДанные <> Неопределено Тогда
		ПериодОтчета = Новый СтандартныйПериод;
		ПериодОтчета.ДатаНачала = Элементы.БанковскиеВыписки.ТекущиеДанные.Дата;
		ПериодОтчета.ДатаОкончания = Элементы.БанковскиеВыписки.ТекущиеДанные.Дата;
		ПараметрыОтчета = Новый Структура("СтПериод", ПериодОтчета);
	Иначе
		ПериодОтчета = Новый СтандартныйПериод;
		ПериодОтчета.ДатаНачала = '00010101';
		ПериодОтчета.ДатаОкончания = '00010101';
		ПараметрыОтчета = Новый Структура("СтПериод", ПериодОтчета);
	КонецЕсли;
	
	ОткрытьФорму("Отчет.ДенежныеСредства.Форма", Новый Структура("КлючВарианта, СформироватьПриОткрытии, Отбор", "ВедомостьВВалюте", Истина, ПараметрыОтчета));
	
КонецПроцедуры
