
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура;
	Если ТипЗнч(ПараметрыВыполненияКоманды.Источник) = Тип("УправляемаяФорма") Тогда
		ПараметрыФормы.Вставить("СтрокаПоиска", ПредставлениеФормы(ПараметрыВыполненияКоманды.Источник.ИмяФормы));
	КонецЕсли;
	
	ОткрытьФорму("Обработка.НастройкаПрограммы.Форма",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка
	);
	
КонецПроцедуры

&НаСервере
Функция ПредставлениеФормы(знач ИмяФормы)
	
	Результат = "";
	
	ФормаМетаданных = Метаданные.НайтиПоПолномуИмени(ИмяФормы);
	Если ФормаМетаданных <> Неопределено Тогда
		Результат = ФормаМетаданных.Родитель().Представление();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции