#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	
	// Биллинг
	ДоговорОбслуживанияНаправлениеДеятельности = Неопределено;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Контрагенты") Тогда
		// Программное заполнение по методу Заполнить()
		
		СтандартнаяОбработка = Ложь;
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, "Покупатель,Поставщик,ПрочиеОтношения");
		
		ОрганизацияПоУмолчанию = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ПользователиКлиентСервер.АвторизованныйПользователь(), "ОсновнаяОрганизация");
		Если Не ЗначениеЗаполнено(ОрганизацияПоУмолчанию) Тогда
			ОрганизацияПоУмолчанию = Справочники.Организации.ОсновнаяОрганизация;
		КонецЕсли;
		
		Наименование		= "Основной договор";
		ВалютаРасчетов		= Константы.НациональнаяВалюта.Получить();
		Организация			= ОрганизацияПоУмолчанию;
		ВидЦен				= Справочники.ВидыЦен.ПолучитьОсновнойВидЦенПродажи();
		Владелец			= ДанныеЗаполнения;
		СрокОплатыПоставщику = Константы.СрокОплатыПоставщику.Получить();
		СрокОплатыПокупателя = Константы.СрокОплатыПокупателя.Получить();
		ВидДоговора			= Перечисления.ВидыДоговоров.СПокупателем;
		Если ЗначенияРеквизитов.Поставщик И Не ЗначенияРеквизитов.Покупатель Тогда
			ВидДоговора		= Перечисления.ВидыДоговоров.СПоставщиком;
		ИначеЕсли ЗначенияРеквизитов.ПрочиеОтношения И Не ЗначенияРеквизитов.Покупатель И Не ЗначенияРеквизитов.Поставщик Тогда
			ВидДоговора		= Перечисления.ВидыДоговоров.Прочее;
		КонецЕсли;
		
		// Заполним вид цен котрагента
		Если ПолучитьФункциональнуюОпцию("УчетЦенКонтрагентов") Тогда
			
			УстановитьПривилегированныйРежим(Истина);
			
			НовыйВидЦенКонтрагентов = Справочники.ВидыЦенКонтрагентов.ВидЦенКонтрагентаПоУмолчанию(ДанныеЗаполнения);
			Если НЕ ЗначениеЗаполнено(НовыйВидЦенКонтрагентов) Тогда 
				
				НовыйВидЦенКонтрагентов = Справочники.ВидыЦенКонтрагентов.НайтиЛюбойПервыйВидЦенКонтрагента(ДанныеЗаполнения);
				
				Если НЕ ЗначениеЗаполнено(НовыйВидЦенКонтрагентов) Тогда
					
					НовыйВидЦенКонтрагентов = Справочники.ВидыЦенКонтрагентов.СоздатьВидЦенКонтрагента(ДанныеЗаполнения, ВалютаРасчетов);
					
				КонецЕсли;
				
			КонецЕсли;
			
			УстановитьПривилегированныйРежим(Ложь);
			
			ВидЦенКонтрагента = НовыйВидЦенКонтрагентов;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Вид цен.
	Если ЗначениеЗаполнено(ВидСкидкиНаценки) Тогда
		ПроверяемыеРеквизиты.Добавить("ВидЦен");
	КонецЕсли;
	
	// Биллинг
	Если ЭтоДоговорОбслуживания Тогда
		ПроверяемыеРеквизиты.Добавить("ВидЦен");
		ПроверяемыеРеквизиты.Добавить("ДоговорОбслуживанияДатаНачала");
		ПроверяемыеРеквизиты.Добавить("ДоговорОбслуживанияТарифныйПлан");
		ПроверяемыеРеквизиты.Добавить("ДоговорОбслуживанияПериодичность");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПометкаУдаления Тогда
		
		ЗначенияРеквизитовКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Владелец, "ПометкаУдаления, ДоговорПоУмолчанию");
		
		Если Не ЗначенияРеквизитовКонтрагента.ПометкаУдаления И ЗначенияРеквизитовКонтрагента.ДоговорПоУмолчанию = Ссылка Тогда
			ТекстСообщения = НСтр("ru='Договор контрагента, установленный в качестве основного, не может быть помечен на удаление.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Ссылка,,, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Ссылка <> &Ссылка
	|	И ДоговорыКонтрагентов.Владелец = &Владелец
	|	И НЕ ДоговорыКонтрагентов.Владелец.ВестиРасчетыПоДоговорам");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Владелец", Владелец);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ТекстСообщения = НСтр("ru = 'Для контрагента не ведется учет по договорам.'");
		УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
			ЭтотОбъект,
			ТекстСообщения,
			,
			,
			,
			Отказ
		);
	КонецЕсли;
	
	// Биллинг
	Если ЭтоДоговорОбслуживания И ЭтоНовый()
		ИЛИ ЭтоДоговорОбслуживания И НЕ ЭтоНовый() И НЕ Ссылка.ЭтоДоговорОбслуживания Тогда
		
		ИспользоватьНаправленияДеятельности = Константы.БиллингВестиУчетРасходовПоДоговорамОбслуживания.Получить();
		Если ИспользоватьНаправленияДеятельности Тогда
			ДоговорОбслуживанияНаправлениеДеятельности = 
				Справочники.ДоговорыКонтрагентов.СоздатьНаправлениеДеятельностиДляДоговораОбслуживания(Владелец, Наименование);
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		ДополнительныеСвойства.Вставить("ПометкаУдаления", Ссылка.ПометкаУдаления);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Биллинг
	Если ЭтоДоговорОбслуживания Тогда
		Если ЗначениеЗаполнено(ДоговорОбслуживанияНаправлениеДеятельности) Тогда
			// Если договор помечается (снимается пометка) на удаление, так же помечаем и связанное с ним направление деятельности.
			Если ДополнительныеСвойства.Свойство("ПометкаУдаления") Тогда
				Если ДополнительныеСвойства.ПометкаУдаления = Ложь И ПометкаУдаления = Истина
					ИЛИ ДополнительныеСвойства.ПометкаУдаления = Истина И ПометкаУдаления = Ложь Тогда
					
					НаправлениеДеятельностиОбъект = ДоговорОбслуживанияНаправлениеДеятельности.ПолучитьОбъект();
					НаправлениеДеятельностиОбъект.ПометкаУдаления = ПометкаУдаления;
					НаправлениеДеятельностиОбъект.Записать();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьНаименование() Экспорт
	
	Если Не ПустаяСтрока(НомерДоговора) Тогда
		Наименование = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '№ %1 %2 (%3)'"),
			СокрЛП(НомерДоговора),
			?(ЗначениеЗаполнено(ДатаДоговора), "от " + Формат(ДатаДоговора, "ДЛФ=D"), ""),
			Строка(ВалютаРасчетов));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
