///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРЫБОТЧКИ СОБЫТИЙ ФОРМЫ


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ГруппаКодВычета.Доступность = Запись.Применяется;
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРЫБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ


&НаКлиенте
Процедура ПрименяетсяПриИзменении(Элемент)
	
	Элементы.ГруппаКодВычета.Доступность = Запись.Применяется;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПодробнееКод104(Команда)
	
	РегламентированнаяОтчетностьУСНКлиент.ПоказатьОписаниеВычетаНДФЛ("104");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПодробнееКод105(Команда)
	
	РегламентированнаяОтчетностьУСНКлиент.ПоказатьОписаниеВычетаНДФЛ("105");
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////
// ОБЩИЕ ПРОЦЕДУРЫ И ФУНКЦИИ


