#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Процедура - обработчик события ОбработкаПроверкиЗаполнения объекта.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ПустаяСтрока(ИдентификаторФормул)
		ИЛИ ЦенообразованиеФормулыСервер.НайтиВидЦенПоИдентификатору(ИдентификаторФормул, Ссылка).ИдентификаторЗанят Тогда
		
		ЦенообразованиеФормулыСервер.СформироватьНовыйИдентификаторВидаЦен(ИдентификаторФормул, Наименование, Строка(Владелец));
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

#КонецЕсли