
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события ПриСозданииНаСервере формы.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПолучитьНастройки();
	ОбновитьДанные();
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийРеквизитовФормы

&НаКлиенте
// Процедура - обработчик события ПриИзменении поля ввода Организация.
//
Процедура ОрганизацияПриИзменении(Элемент)

	ОбновитьДанные();
	
КонецПроцедуры // ОрганизацияПриИзменении()

&НаКлиенте
// Процедура - обработчик события ПриИзменении поля ввода Период.
//
Процедура ПериодПриИзменении(Элемент)
	
	Если Период = '00010101' Тогда
		Период = ТекущаяДата();
	КонецЕсли;	
		
	ОбновитьДанные();
	
КонецПроцедуры

// Процедура - обработчик события Нажатие гиперссылки Подробнее из виджета Кредиторы.
//
&НаКлиенте
Процедура КредиторыПодробнееНажатие(Элемент)
	
	СвойстваОтчета = Новый Структура;
	СвойстваОтчета.Вставить("ИмяОтчета", "РасчетыСПоставщиками");
	СвойстваОтчета.Вставить("КлючВарианта", "Ведомость");
	
	ПараметрыИОтборы = Новый Массив;
	
	Настройка = Новый Структура;
	Настройка.Вставить("ИмяПоля", "Организация");
	Настройка.Вставить("ПравоеЗначение", Организация);
	ПараметрыИОтборы.Добавить(Настройка);
	
	Настройка = Новый Структура;
	Настройка.Вставить("ИмяПоля", "НачалоПериода");
	Настройка.Вставить("ПравоеЗначение", ДобавитьМесяц(НачалоДня(Период),-1));
	ПараметрыИОтборы.Добавить(Настройка);
	
	Настройка = Новый Структура;
	Настройка.Вставить("ИмяПоля", "КонецПериода");
	Настройка.Вставить("ПравоеЗначение", КонецДня(Период));
	ПараметрыИОтборы.Добавить(Настройка);
	
	КомпоновщикНастроек = УправлениеНебольшойФирмойСервер.ПолучитьПереопределенныйКомпоновщикНастроек(СвойстваОтчета, ПараметрыИОтборы);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КлючВарианта",		 		 СвойстваОтчета.КлючВарианта);
	ПараметрыФормы.Вставить("ПользовательскиеНастройки", КомпоновщикНастроек.ПользовательскиеНастройки);
	ПараметрыФормы.Вставить("СформироватьПриОткрытии",	 Истина);
	
	ОткрытьФорму("Отчет." + СвойстваОтчета.ИмяОтчета + ".Форма", ПараметрыФормы, Элемент, УникальныйИдентификатор);
	
КонецПроцедуры

// Процедура - обработчик события Нажатие гиперссылки Подробнее из виджета КредиторыПоСрокам.
//
&НаКлиенте
Процедура КредиторыПоСрокамПодробнееНажатие(Элемент)
	
	СвойстваОтчета = Новый Структура;
	СвойстваОтчета.Вставить("ИмяОтчета", "РеестрСтаренияКредиторскойЗадолженности");
	СвойстваОтчета.Вставить("КлючВарианта", "Ведомость");
	
	ПараметрыИОтборы = Новый Массив;
	
	Настройка = Новый Структура;
	Настройка.Вставить("ИмяПоля", "Организация");
	Настройка.Вставить("ПравоеЗначение", Организация);
	ПараметрыИОтборы.Добавить(Настройка);
	
	Настройка = Новый Структура;
	Настройка.Вставить("ИмяПоля", "ПериодПольз");
	Настройка.Вставить("ПравоеЗначение", КонецДня(Период));
	ПараметрыИОтборы.Добавить(Настройка);
	
	КомпоновщикНастроек = УправлениеНебольшойФирмойСервер.ПолучитьПереопределенныйКомпоновщикНастроек(СвойстваОтчета, ПараметрыИОтборы);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КлючВарианта",		 		 СвойстваОтчета.КлючВарианта);
	ПараметрыФормы.Вставить("ПользовательскиеНастройки", КомпоновщикНастроек.ПользовательскиеНастройки);
	ПараметрыФормы.Вставить("СформироватьПриОткрытии",	 Истина);
	
	ОткрытьФорму("Отчет." + СвойстваОтчета.ИмяОтчета + ".Форма", ПараметрыФормы, Элемент, УникальныйИдентификатор);
	
КонецПроцедуры

// Процедура - обработчик события Нажатие гиперссылки Подробнее из виджета КредиторыПросрочено.
//
&НаКлиенте
Процедура КредиторыПросроченоПодробнееНажатие(Элемент)
	
	СвойстваОтчета = Новый Структура;
	СвойстваОтчета.Вставить("ИмяОтчета", "РеестрСтаренияКредиторскойЗадолженности");
	СвойстваОтчета.Вставить("КлючВарианта", "Ведомость");
	
	ПараметрыИОтборы = Новый Массив;
	
	Настройка = Новый Структура;
	Настройка.Вставить("ИмяПоля", "Организация");
	Настройка.Вставить("ПравоеЗначение", Организация);
	ПараметрыИОтборы.Добавить(Настройка);
	
	Настройка = Новый Структура;
	Настройка.Вставить("ИмяПоля", "ПериодПольз");
	Настройка.Вставить("ПравоеЗначение", КонецДня(Период));
	ПараметрыИОтборы.Добавить(Настройка);
	
	Настройка = Новый Структура;
	Настройка.Вставить("ИмяПоля", "ДПросроченнаяЗадолженность");
	Настройка.Вставить("ПравоеЗначение", 0);
	Настройка.Вставить("ВидСравнения", ВидСравненияКомпоновкиДанных.Больше);
	Настройка.Вставить("ВидНастройки", "ФиксированныеНастройки");
	ПараметрыИОтборы.Добавить(Настройка);
	
	КомпоновщикНастроек = УправлениеНебольшойФирмойСервер.ПолучитьПереопределенныйКомпоновщикНастроек(СвойстваОтчета, ПараметрыИОтборы);

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КлючВарианта",		 		 СвойстваОтчета.КлючВарианта);
	ПараметрыФормы.Вставить("ПользовательскиеНастройки", КомпоновщикНастроек.ПользовательскиеНастройки);
	ПараметрыФормы.Вставить("ФиксированныеНастройки",	 КомпоновщикНастроек.ФиксированныеНастройки);
	ПараметрыФормы.Вставить("СформироватьПриОткрытии",	 Истина);
	
	ОткрытьФорму("Отчет." + СвойстваОтчета.ИмяОтчета + ".Форма", ПараметрыФормы, Элемент, УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьДанные();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

&НаСервере
// Процедура восстанавливает настройки общие для мониторов.
//
Процедура ПолучитьНастройки()
	
	Если Константы.УчетПоКомпании.Получить() Тогда
		Организация = Константы.Компания.Получить();
		Элементы.Организация.ТолькоПросмотр = Истина;
	Иначе
		Организация = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиДляМониторов", "Организация");
		Если НЕ ЗначениеЗаполнено(Организация) Тогда
			Организация = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователи.ТекущийПользователь(), "ОсновнаяОрганизация");
			Если НЕ ЗначениеЗаполнено(Организация) Тогда
				Организация = Справочники.Организации.ОсновнаяОрганизация;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Период = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиДляМониторов", "Период");
	Если НЕ ЗначениеЗаполнено(Период) Тогда
		Период = ТекущаяДатаСеанса();
	КонецЕсли;
	
КонецПроцедуры // ПолучитьНастройки()

&НаСервере
// Процедура сохраняет настройки общие для мониторов.
//
Процедура СохранитьНастройки()
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("НастройкиДляМониторов", "Организация", Организация);
	
	Если (НачалоДня(ТекущаяДатаСеанса()) = НачалоДня(Период)) Тогда
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("НастройкиДляМониторов", "Период", '00010101');
	Иначе
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("НастройкиДляМониторов", "Период", Период);
	КонецЕсли;

КонецПроцедуры // СохранитьНастройки()

&НаСервере
// Процедура обновляет данные на форме.
//
Процедура ОбновитьДанные()
	
	ПредставлениеПериода = Формат(ДобавитьМесяц(Период, -1), "ДЛФ=DD") + " — " + Формат(Период, "ДЛФ=DD") + ?(НачалоДня(Период) = НачалоДня(ТекущаяДатаСеанса()), " (Сегодня)", "");
	
	ОбновитьДиаграммуКредиторы();
	ОбновитьДиаграммуИВиджетКредиторыПоСрокам();
	ОбновитьДиаграммуДинамикаЗадолженности();
	ОбновитьВиджетКредиторы();
	ОбновитьВиджетПросроченно();
	
	СохранитьНастройки();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДиаграммуКредиторы()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчетыСПоставщикамиОстатки.Контрагент,
		|	РасчетыСПоставщикамиОстатки.Контрагент.Представление,
		|	РасчетыСПоставщикамиОстатки.СуммаОстаток КАК Долг
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщиками.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)) КАК РасчетыСПоставщикамиОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	Долг УБЫВ";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", КонецДня(Период));
	
	ДиаграммаКредиторы.Обновление = Ложь;
	ДиаграммаКредиторы.Очистить();
	ДиаграммаКредиторы.АвтоТранспонирование = Ложь;
	ДиаграммаКредиторы.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки, -1);
	
	Точка = ДиаграммаКредиторы.Точки.Добавить("Долг = ");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Серия = ДиаграммаКредиторы.Серии.Добавить(Выборка.КонтрагентПредставление);
		Серия.Расшифровка = Выборка.Контрагент;
		Подсказка = "Задолженность " + Выборка.КонтрагентПредставление + " " + Выборка.Долг;
		ДиаграммаКредиторы.УстановитьЗначение(Точка, Серия, Выборка.Долг, , Подсказка);
		
	КонецЦикла;

	ДиаграммаКредиторы.АвтоТранспонирование = Истина;
	ДиаграммаКредиторы.Обновление = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДиаграммуИВиджетКредиторыПоСрокам()
	
	ШиринаКонтрагент  = 25;
	ШиринаМенее7 = 9;
	ШиринаМенее30 = 9;
	ШиринаБолее31 = 9;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РасчетыСПоставщикамиОстатки.Контрагент КАК Контрагент,
		|	РасчетыСПоставщикамиОстатки.Контрагент.Представление,
		|	СУММА(ВЫБОР
		|			КОГДА РАЗНОСТЬДАТ(РасчетыСПоставщикамиОстатки.Документ.Дата, &Период, ДЕНЬ) <= 7
		|					И РАЗНОСТЬДАТ(РасчетыСПоставщикамиОстатки.Документ.Дата, &Период, ДЕНЬ) >= 0
		|				ТОГДА РасчетыСПоставщикамиОстатки.СуммаОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ДолгМенее7,
		|	СУММА(ВЫБОР
		|			КОГДА РАЗНОСТЬДАТ(РасчетыСПоставщикамиОстатки.Документ.Дата, &Период, ДЕНЬ) >= 8
		|					И РАЗНОСТЬДАТ(РасчетыСПоставщикамиОстатки.Документ.Дата, &Период, ДЕНЬ) <= 30
		|				ТОГДА РасчетыСПоставщикамиОстатки.СуммаОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ДолгМенее30,
		|	СУММА(ВЫБОР
		|			КОГДА РАЗНОСТЬДАТ(РасчетыСПоставщикамиОстатки.Документ.Дата, &Период, ДЕНЬ) >= 31
		|				ТОГДА РасчетыСПоставщикамиОстатки.СуммаОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ДолгБолее31
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщиками.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)) КАК РасчетыСПоставщикамиОстатки
		|ГДЕ
		|	РасчетыСПоставщикамиОстатки.СуммаОстаток > 0
		|	И РАЗНОСТЬДАТ(РасчетыСПоставщикамиОстатки.Документ.Дата, &Период, ДЕНЬ) >= 0
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыСПоставщикамиОстатки.Контрагент,
		|	РасчетыСПоставщикамиОстатки.Контрагент.Представление
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДолгБолее31 УБЫВ,
		|	ДолгМенее30 УБЫВ,
		|	ДолгМенее7 УБЫВ
		|ИТОГИ ПО
		|	ОБЩИЕ";
		
	Запрос.УстановитьПараметр("Период", КонецДня(Период));
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Элементы.ДекорацияКредиторыМенее7Итог.Заголовок = "";
	Элементы.ДекорацияКредиторыМенее30Итог.Заголовок = "";
	Элементы.ДекорацияКредиторыБолее31Итог.Заголовок = "";
	
	ДиаграммаКредиторыПоСрокам.Обновление = Ложь;
	ДиаграммаКредиторыПоСрокам.Очистить();
	ДиаграммаКредиторыПоСрокам.АвтоТранспонирование = Ложь;
	ДиаграммаКредиторыПоСрокам.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки, -1);
	
	Точка = ДиаграммаКредиторыПоСрокам.Точки.Добавить("Долг = ");
	
	ДолгМенее7 = "до 7 дней";
	ДолгМенее30 = "8 - 30 дней";
	ДолгБолее31 = "от 31 дня";
	
	Элементы.КонтрагентыПоСрокам.Заголовок = "";
	Элементы.КонтрагентыПоСрокам.Подсказка = "";
	Элементы.КредиторыМенее7.Заголовок = "";
	Элементы.КредиторыМенее7.Подсказка = "";
	Элементы.КредиторыМенее30.Заголовок = "";
	Элементы.КредиторыМенее30.Подсказка = "";
	Элементы.КредиторыБолее31.Заголовок = "";
	Элементы.КредиторыБолее31.Подсказка = "";
	
	ВыборкаОбщийИтог = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаОбщийИтог.Следующий() Тогда
		
		Элементы.ДекорацияКредиторыМенее7Итог.Заголовок = УправлениеНебольшойФирмойСервер.СформироватьЗаголовок(ВыборкаОбщийИтог.ДолгМенее7);
		Элементы.ДекорацияКредиторыМенее30Итог.Заголовок = УправлениеНебольшойФирмойСервер.СформироватьЗаголовок(ВыборкаОбщийИтог.ДолгМенее30);
		Элементы.ДекорацияКредиторыБолее31Итог.Заголовок = УправлениеНебольшойФирмойСервер.СформироватьЗаголовок(ВыборкаОбщийИтог.ДолгБолее31);
		
		Серия = ДиаграммаКредиторыПоСрокам.Серии.Добавить(ДолгМенее7);
		Серия.Цвет = УправлениеНебольшойФирмойСервер.ЦветДляМониторов("Зеленый");
		Подсказка = "Просрочено менее 7 дней " + ВыборкаОбщийИтог.ДолгМенее7;
		ДиаграммаКредиторыПоСрокам.УстановитьЗначение(Точка, Серия, ВыборкаОбщийИтог.ДолгМенее7, , Подсказка);
		
		Серия = ДиаграммаКредиторыПоСрокам.Серии.Добавить(ДолгМенее30);
		Серия.Цвет = УправлениеНебольшойФирмойСервер.ЦветДляМониторов("Желтый");
		Подсказка = "Просрочено от 8 до 30 дней " + ВыборкаОбщийИтог.ДолгМенее30;
		ДиаграммаКредиторыПоСрокам.УстановитьЗначение(Точка, Серия, ВыборкаОбщийИтог.ДолгМенее30, , Подсказка);
		
		Серия = ДиаграммаКредиторыПоСрокам.Серии.Добавить(ДолгБолее31);
		Серия.Цвет = УправлениеНебольшойФирмойСервер.ЦветДляМониторов("Красный");
		Подсказка = "Просрочено более 31 дней " + ВыборкаОбщийИтог.ДолгБолее31;
		ДиаграммаКредиторыПоСрокам.УстановитьЗначение(Точка, Серия, ВыборкаОбщийИтог.ДолгБолее31, , Подсказка);
		
		Выборка = ВыборкаОбщийИтог.Выбрать();
		
		Для Индекс = 1 По 6 Цикл
			
			Если Выборка.Следующий() Тогда
				
				ДолгМенее7Представление = Формат(Выборка.ДолгМенее7, "ЧДЦ=2; ЧРГ=' '; ЧН=0,00; ЧГ=3,0");
				ДолгМенее30Представление = Формат(Выборка.ДолгМенее30, "ЧДЦ=2; ЧРГ=' '; ЧН=0,00; ЧГ=3,0");
				ДолгБолее31Представление = Формат(Выборка.ДолгБолее31, "ЧДЦ=2; ЧРГ=' '; ЧН=0,00; ЧГ=3,0");
				
				ЗаголовокКонтрагент = СтрЗаменить(Выборка.КонтрагентПредставление, " ", Символы.НПП);
				Элементы.КонтрагентыПоСрокам.Заголовок = Элементы.КонтрагентыПоСрокам.Заголовок + ?(ПустаяСтрока(Элементы.КонтрагентыПоСрокам.Заголовок),"", Символы.ПС) 
					+ Лев(ЗаголовокКонтрагент, ШиринаКонтрагент) + ?(СтрДлина(ЗаголовокКонтрагент) > ШиринаКонтрагент, "...", "");
				Элементы.КонтрагентыПоСрокам.Подсказка = Элементы.КонтрагентыПоСрокам.Подсказка + ?(ПустаяСтрока(Элементы.КонтрагентыПоСрокам.Подсказка),"", Символы.ПС) 
					+ ЗаголовокКонтрагент;
				
				Элементы.КредиторыМенее7.Заголовок = Элементы.КредиторыМенее7.Заголовок + ?(ПустаяСтрока(Элементы.КредиторыМенее7.Заголовок),"", Символы.ПС) 
					+ Лев(ДолгМенее7Представление, ШиринаМенее7) + ?(СтрДлина(ДолгМенее7Представление) > ШиринаМенее7, "...", "");
				Элементы.КредиторыМенее7.Подсказка = Элементы.КредиторыМенее7.Подсказка + ?(ПустаяСтрока(Элементы.КредиторыМенее7.Подсказка),"", Символы.ПС) 
					+ ДолгМенее7Представление;
				
				Элементы.КредиторыМенее30.Заголовок = Элементы.КредиторыМенее30.Заголовок + ?(ПустаяСтрока(Элементы.КредиторыМенее30.Заголовок),"", Символы.ПС) 
					+ Лев(ДолгМенее30Представление, ШиринаМенее30) + ?(СтрДлина(ДолгМенее30Представление) > ШиринаМенее30, "...", "");
				Элементы.КредиторыМенее30.Подсказка = Элементы.КредиторыМенее30.Подсказка + ?(ПустаяСтрока(Элементы.КредиторыМенее30.Подсказка),"", Символы.ПС) 
					+ ДолгМенее30Представление;
				
				Элементы.КредиторыБолее31.Заголовок = Элементы.КредиторыБолее31.Заголовок + ?(ПустаяСтрока(Элементы.КредиторыБолее31.Заголовок),"", Символы.ПС) 
					+ Лев(ДолгБолее31Представление, ШиринаБолее31) + ?(СтрДлина(ДолгБолее31Представление) > ШиринаБолее31, "...", "");
				Элементы.КредиторыБолее31.Подсказка = Элементы.КредиторыБолее31.Подсказка + ?(ПустаяСтрока(Элементы.КредиторыБолее31.Подсказка),"", Символы.ПС) 
					+ ДолгБолее31Представление;
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		Элементы.ДекорацияКредиторыМенее7Итог.Заголовок = "—";
		Элементы.ДекорацияКредиторыМенее30Итог.Заголовок = "—";
		Элементы.ДекорацияКредиторыБолее31Итог.Заголовок = "—";
		
	КонецЕсли;
		
	ДиаграммаКредиторыПоСрокам.АвтоТранспонирование = Истина;
	ДиаграммаКредиторыПоСрокам.Обновление = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДиаграммуДинамикаЗадолженности()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РасчетыСПоставщикамиОстаткиИОбороты.Период КАК Период,
		|	РасчетыСПоставщикамиОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщиками.ОстаткиИОбороты(
		|			&ДатаОтбораНачала,
		|			&ДатаОтбораОкончания,
		|			День,
		|			ДвиженияИГраницыПериода,
		|			Организация = &Организация
		|				И ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)) КАК РасчетыСПоставщикамиОстаткиИОбороты
		|ГДЕ
		|	РасчетыСПоставщикамиОстаткиИОбороты.СуммаКонечныйОстаток > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период
		|ИТОГИ
		|	СУММА(СуммаКонечныйОстаток)
		|ПО
		|	Период ПЕРИОДАМИ(ДЕНЬ, &ДатаОтбораНачала, &ДатаОтбораОкончания)";

	Запрос.УстановитьПараметр("ДатаОтбораНачала", ДобавитьМесяц(НачалоДня(Период),-1));
	Запрос.УстановитьПараметр("ДатаОтбораОкончания", КонецДня(Период));
	Запрос.УстановитьПараметр("Организация", Организация);
	
	ДиаграммаДинамикаЗадолженности.Обновление = Ложь;
	ДиаграммаДинамикаЗадолженности.Очистить();
	ДиаграммаДинамикаЗадолженности.АвтоТранспонирование = Ложь;
	ДиаграммаДинамикаЗадолженности.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки, -1);

	Серия = ДиаграммаДинамикаЗадолженности.Серии.Добавить("Период");
	Серия.Линия = Новый Линия(ТипЛинииДиаграммы.Сплошная, 2);
	Серия.Маркер = ТипМаркераДиаграммы.Нет;
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Период", "Все");
	
	Пока Выборка.Следующий() Цикл
		
		Точка = ДиаграммаДинамикаЗадолженности.Точки.Добавить(Выборка.Период);
		Точка.Текст = Формат(Выборка.Период, "ДФ=dd.MM.yy");
		Подсказка = "Долг " + Выборка.СуммаКонечныйОстаток + " на " + Формат(Выборка.Период, "ДФ=dd.MM.yyyy");
		ДиаграммаДинамикаЗадолженности.УстановитьЗначение(Точка, Серия, Выборка.СуммаКонечныйОстаток, , Подсказка);
		 
	КонецЦикла;	
	
	ДиаграммаДинамикаЗадолженности.АвтоТранспонирование = Истина;
	ДиаграммаДинамикаЗадолженности.Обновление = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВиджетКредиторы()
	
	ШиринаКонтрагент  = 28;
	ШиринаДолг = 10;
	ШиринаАванс = 10;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РасчетыСПоставщикамиОстатки.Контрагент КАК Контрагент,
		|	РасчетыСПоставщикамиОстатки.Контрагент.Представление,
		|	СУММА(ВЫБОР
		|			КОГДА РасчетыСПоставщикамиОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|				ТОГДА РасчетыСПоставщикамиОстатки.СуммаОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаДолга,
		|	СУММА(ВЫБОР
		|			КОГДА РасчетыСПоставщикамиОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
		|				ТОГДА -РасчетыСПоставщикамиОстатки.СуммаОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаАванса
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщиками.Остатки(&ДатаОтбора, Организация = &Организация) КАК РасчетыСПоставщикамиОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыСПоставщикамиОстатки.Контрагент,
		|	РасчетыСПоставщикамиОстатки.Контрагент.Представление
		|
		|УПОРЯДОЧИТЬ ПО
		|	СуммаДолга УБЫВ
		|ИТОГИ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Контрагент),
		|	СУММА(СуммаДолга),
		|	СУММА(СуммаАванса)
		|ПО
		|	ОБЩИЕ";

	Запрос.УстановитьПараметр("ДатаОтбора", КонецДня(Период));
	Запрос.УстановитьПараметр("ДатаОтбораНачала", ДобавитьМесяц(НачалоДня(Период),-1));
	Запрос.УстановитьПараметр("Организация", Организация);
	
	ВыборкаОбщиеИтоги = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Если ВыборкаОбщиеИтоги.Следующий() Тогда
		Элементы.ДекорацияКредиторыКоличество.Заголовок = ВыборкаОбщиеИтоги.Контрагент;
		Элементы.ДекорацияКредиторыЗадолженностьИтог.Заголовок = УправлениеНебольшойФирмойСервер.СформироватьЗаголовок(ВыборкаОбщиеИтоги.СуммаДолга);
		Элементы.ДекорацияКредиторыАвансИтог.Заголовок = УправлениеНебольшойФирмойСервер.СформироватьЗаголовок(ВыборкаОбщиеИтоги.СуммаАванса);
	Иначе
		Элементы.ДекорацияКредиторыКоличество.Заголовок = "—";
		Элементы.ДекорацияКредиторыЗадолженностьИтог.Заголовок = "—";
		Элементы.ДекорацияКредиторыАвансИтог.Заголовок = "—";
	КонецЕсли;
	
	Элементы.КредиторыКонтрагент.Заголовок = "";
	Элементы.КредиторыКонтрагент.Подсказка = "";
	Элементы.КредиторыДолг.Заголовок = "";
	Элементы.КредиторыДолг.Подсказка = "";
	Элементы.КредиторыАванс.Заголовок = "";
	Элементы.КредиторыАванс.Подсказка = "";
	
	Выборка = ВыборкаОбщиеИтоги.Выбрать();
	Для Индекс = 1 По 6 Цикл
		Если Выборка.Следующий() Тогда
			
			СуммаДолгаПредставление = Формат(Выборка.СуммаДолга, "ЧДЦ=2; ЧРГ=' '; ЧН=0,00; ЧГ=3,0");
			СуммаАвансаПредставление = Формат(Выборка.СуммаАванса, "ЧДЦ=2; ЧРГ=' '; ЧН=0,00; ЧГ=3,0");
			
			ЗаголовокКонтрагент = СтрЗаменить(Выборка.КонтрагентПредставление, " ", Символы.НПП);
			Элементы.КредиторыКонтрагент.Заголовок = Элементы.КредиторыКонтрагент.Заголовок + ?(ПустаяСтрока(Элементы.КредиторыКонтрагент.Заголовок),"", Символы.ПС) 
				+ Лев(ЗаголовокКонтрагент, ШиринаКонтрагент) + ?(СтрДлина(ЗаголовокКонтрагент) > ШиринаКонтрагент, "...", "");
			Элементы.КредиторыКонтрагент.Подсказка = Элементы.КредиторыКонтрагент.Подсказка + ?(ПустаяСтрока(Элементы.КредиторыКонтрагент.Подсказка),"", Символы.ПС) 
				+ ЗаголовокКонтрагент;
				
			Элементы.КредиторыДолг.Заголовок = Элементы.КредиторыДолг.Заголовок + ?(ПустаяСтрока(Элементы.КредиторыДолг.Заголовок),"", Символы.ПС) 
				+ Лев(СуммаДолгаПредставление, ШиринаДолг) + ?(СтрДлина(СуммаДолгаПредставление) > ШиринаДолг, "...", "");
			Элементы.КредиторыДолг.Подсказка = Элементы.КредиторыДолг.Подсказка + ?(ПустаяСтрока(Элементы.КредиторыДолг.Подсказка),"", Символы.ПС) 
				+ СуммаДолгаПредставление;
				
			Элементы.КредиторыАванс.Заголовок = Элементы.КредиторыАванс.Заголовок + ?(ПустаяСтрока(Элементы.КредиторыАванс.Заголовок),"", Символы.ПС) 
				+ Лев(СуммаАвансаПредставление, ШиринаАванс) + ?(СтрДлина(СуммаАвансаПредставление) > ШиринаАванс, "...", "");
			Элементы.КредиторыАванс.Подсказка = Элементы.КредиторыАванс.Подсказка + ?(ПустаяСтрока(Элементы.КредиторыАванс.Подсказка),"", Символы.ПС) 
				+ СуммаАвансаПредставление;
				
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВиджетПросроченно()
	
	ШиринаКонтрагент = 28;
	ШиринаПросрочено = 10;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РасчетыСПоставщикамиОстатки.Контрагент КАК Контрагент,
		|	РасчетыСПоставщикамиОстатки.Контрагент.Представление,
		|	РасчетыСПоставщикамиОстатки.СуммаОстаток КАК СуммаПросрочено
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщиками.Остатки(
		|			&ДатаОтбора,
		|			Организация = &Организация
		|				И ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|				И Договор.СрокОплатыПоставщику > 0
		|				И РАЗНОСТЬДАТ(Документ.Дата, &ДатаОтбора, ДЕНЬ) > Договор.СрокОплатыПоставщику) КАК РасчетыСПоставщикамиОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыСПоставщикамиОстатки.Контрагент,
		|	РасчетыСПоставщикамиОстатки.Контрагент.Представление,
		|	РасчетыСПоставщикамиОстатки.СуммаОстаток
		|
		|УПОРЯДОЧИТЬ ПО
		|	СуммаПросрочено УБЫВ
		|ИТОГИ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Контрагент),
		|	СУММА(СуммаПросрочено)
		|ПО
		|	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("ДатаОтбора", КонецДня(Период));
	Запрос.УстановитьПараметр("Организация", Организация);
	
	ВыборкаОбщиеИтоги = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Если ВыборкаОбщиеИтоги.Следующий() Тогда
		Элементы.ДекорацияКредиторыПросроченоКоличество.Заголовок = ВыборкаОбщиеИтоги.Контрагент;
		Элементы.ДекорацияКредиторыПросроченоИтог.Заголовок = УправлениеНебольшойФирмойСервер.СформироватьЗаголовок(ВыборкаОбщиеИтоги.СуммаПросрочено);
	Иначе
		Элементы.ДекорацияКредиторыПросроченоКоличество.Заголовок = "—";
		Элементы.ДекорацияКредиторыПросроченоИтог.Заголовок = "—";
	КонецЕсли;
	
	Элементы.КредиторыПросроченоКонтрагент.Заголовок = "";
	Элементы.КредиторыПросроченоКонтрагент.Подсказка = "";
	Элементы.КредиторыПросрочено.Заголовок = "";
	Элементы.КредиторыПросрочено.Подсказка = "";
	
	Выборка = ВыборкаОбщиеИтоги.Выбрать();
	Для Индекс = 1 По 6 Цикл
		Если Выборка.Следующий() Тогда
			
			СуммаПросроченоПредставление = Формат(Выборка.СуммаПросрочено, "ЧДЦ=2; ЧРГ=' '; ЧН=0,00; ЧГ=3,0");
			
			ЗаголовокКонтрагент = СтрЗаменить(Выборка.КонтрагентПредставление, " ", Символы.НПП);
			Элементы.КредиторыПросроченоКонтрагент.Заголовок = Элементы.КредиторыПросроченоКонтрагент.Заголовок + ?(ПустаяСтрока(Элементы.КредиторыПросроченоКонтрагент.Заголовок),"", Символы.ПС) 
				+ Лев(ЗаголовокКонтрагент, ШиринаКонтрагент) + ?(СтрДлина(ЗаголовокКонтрагент) > ШиринаКонтрагент, "...", "");
			Элементы.КредиторыПросроченоКонтрагент.Подсказка = Элементы.КредиторыПросроченоКонтрагент.Подсказка + ?(ПустаяСтрока(Элементы.КредиторыПросроченоКонтрагент.Подсказка),"", Символы.ПС) 
				+ ЗаголовокКонтрагент;
				
			Элементы.КредиторыПросрочено.Заголовок = Элементы.КредиторыПросрочено.Заголовок + ?(ПустаяСтрока(Элементы.КредиторыПросрочено.Заголовок),"", Символы.ПС) 
				+ Лев(СуммаПросроченоПредставление, ШиринаПросрочено) + ?(СтрДлина(СуммаПросроченоПредставление) > ШиринаПросрочено, "...", "");
			Элементы.КредиторыПросрочено.Подсказка = Элементы.КредиторыПросрочено.Подсказка + ?(ПустаяСтрока(Элементы.КредиторыПросрочено.Подсказка),"", Символы.ПС) 
				+ СуммаПросроченоПредставление;
				
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
