
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СтруктураЗаполнения = Новый Структура();
	СтруктураЗаполнения.Вставить("ДокументЗаполнения", ПараметрКоманды);
	СтруктураЗаполнения.Вставить("СнятьРезерв", Истина);
	
	ОткрытьФорму("Документ.РезервированиеЗапасов.ФормаОбъекта", Новый Структура("Основание", СтруктураЗаполнения));
	
	СтатистикаИспользованияФормКлиент.ПроверитьЗаписатьСтатистикуКоманды(
		"СоздатьНаОсновании.РезервированиеСнятьСоздатьНаОсновании",
		ПараметрыВыполненияКоманды.Источник
	);
	
КонецПроцедуры
