Функция ПолучитьСсылкуНаСотрудникаПользователя(ТекПользователь = Неопределено) Экспорт
	Если ТекПользователь = Неопределено Тогда
		ТекПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
		ИдентификаторПользователяИБ = ТекПользователь.УникальныйИдентификатор;
	Иначе
		ИдентификаторПользователяИБ = ТекПользователь.ИдентификаторПользователяИБ;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	|	СотрудникиПользователя.Сотрудник
	|ИЗ
	|	РегистрСведений.СотрудникиПользователя КАК СотрудникиПользователя
	|ГДЕ
	|	СотрудникиПользователя.Пользователь.ИдентификаторПользователяИБ = &ИдентификаторПользователяИБ" ;
	Запрос.УстановитьПараметр("ИдентификаторПользователяИБ", ИдентификаторПользователяИБ);
	Выборка = Запрос.Выполнить().Выбрать();
	СотрудникПользователя = Справочники.Сотрудники.ПустаяСсылка();
	Если Выборка.Следующий() Тогда
		СотрудникПользователя = Выборка.Сотрудник;
	КонецЕсли; 
	
	Возврат СотрудникПользователя;
	
	
КонецФункции // ПолучитьСсылкуНаСотрудникаПользователя()
