#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Процедура заполняет справочник виды тарифов страховых взносов
//
Процедура ЗаполнитьСправочникВидыТарифовСтраховыхВзносов()Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВидыТарифовСтраховыхВзносов.Ссылка
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	НЕ ВидыТарифовСтраховыхВзносов.ПометкаУдаления");
	
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВидТарифаСсылка = РегламентированнаяОтчетностьПереопределяемый.СсылкаНаОбъектПоИдентификатору("Справочник.ВидыТарифовСтраховыхВзносов", "ОбщийНалоговыйРежим");
	Если НЕ ЗначениеЗаполнено(ВидТарифаСсылка) Тогда
		ВидТарифаОбъект = РегламентированнаяОтчетностьПереопределяемый.ОбъектСИдентификатором("Справочник.ВидыТарифовСтраховыхВзносов", "ОбщийНалоговыйРежим");
		ВидТарифаОбъект.Наименование = "Организации, применяющие ОСН, кроме с/х производителей";
		ВидТарифаОбъект.КодПФР2011 = "01";
		ВидТарифаОбъект.КодФСС2011 = "071";
		ВидТарифаОбъект.Записать();
	КонецЕсли;

	ВидТарифаСсылка = РегламентированнаяОтчетностьПереопределяемый.СсылкаНаОбъектПоИдентификатору("Справочник.ВидыТарифовСтраховыхВзносов", "СельХозПроизводители");
	Если НЕ ЗначениеЗаполнено(ВидТарифаСсылка) Тогда
		ВидТарифаОбъект = РегламентированнаяОтчетностьПереопределяемый.ОбъектСИдентификатором("Справочник.ВидыТарифовСтраховыхВзносов", "СельХозПроизводители");
		ВидТарифаОбъект.Наименование = "Организации-с/х производители, применяющие ОСН";
		ВидТарифаОбъект.КодПФР2011 = "02";
		ВидТарифаОбъект.КодФСС2011 = "041";
		ВидТарифаОбъект.Записать();
	КонецЕсли;

	ВидТарифаСсылка = РегламентированнаяОтчетностьПереопределяемый.СсылкаНаОбъектПоИдентификатору("Справочник.ВидыТарифовСтраховыхВзносов", "УпрощенныйНалоговыйРежим");
	Если НЕ ЗначениеЗаполнено(ВидТарифаСсылка) Тогда
		ВидТарифаОбъект = РегламентированнаяОтчетностьПереопределяемый.ОбъектСИдентификатором("Справочник.ВидыТарифовСтраховыхВзносов", "УпрощенныйНалоговыйРежим");
		ВидТарифаОбъект.Наименование = "Организации, применяющие УСН, кроме производственных";
		ВидТарифаОбъект.КодПФР2011 = "51";
		ВидТарифаОбъект.КодФСС2011 = "071";
		ВидТарифаОбъект.Записать();
	КонецЕсли;

	ВидТарифаСсылка = РегламентированнаяОтчетностьПереопределяемый.СсылкаНаОбъектПоИдентификатору("Справочник.ВидыТарифовСтраховыхВзносов", "ЕСХН");
	Если НЕ ЗначениеЗаполнено(ВидТарифаСсылка) Тогда
		ВидТарифаОбъект = РегламентированнаяОтчетностьПереопределяемый.ОбъектСИдентификатором("Справочник.ВидыТарифовСтраховыхВзносов", "ЕСХН");
		ВидТарифаОбъект.Наименование = "Организации-с/х производители, уплачивающие ЕСХН";
		ВидТарифаОбъект.КодПФР2011 = "04";
		ВидТарифаОбъект.КодФСС2011 = "032";
		ВидТарифаОбъект.Записать();
	КонецЕсли;

	ВидТарифаСсылка = РегламентированнаяОтчетностьПереопределяемый.СсылкаНаОбъектПоИдентификатору("Справочник.ВидыТарифовСтраховыхВзносов", "ЕНВД");
	Если НЕ ЗначениеЗаполнено(ВидТарифаСсылка) Тогда
		ВидТарифаОбъект = РегламентированнаяОтчетностьПереопределяемый.ОбъектСИдентификатором("Справочник.ВидыТарифовСтраховыхВзносов", "ЕНВД");
		ВидТарифаОбъект.Наименование = "Организации, уплачивающие ЕНВД";
		ВидТарифаОбъект.КодПФР2011 = "51";
		ВидТарифаОбъект.КодФСС2011 = "071";
		ВидТарифаОбъект.Записать();
	КонецЕсли;

	ВидТарифаСсылка = РегламентированнаяОтчетностьПереопределяемый.СсылкаНаОбъектПоИдентификатору("Справочник.ВидыТарифовСтраховыхВзносов", "ОрганизацияИнвалидов");
	Если НЕ ЗначениеЗаполнено(ВидТарифаСсылка) Тогда
		ВидТарифаОбъект = РегламентированнаяОтчетностьПереопределяемый.ОбъектСИдентификатором("Справочник.ВидыТарифовСтраховыхВзносов", "ОрганизацияИнвалидов");
		ВидТарифаОбъект.Наименование = "Организации инвалидов";
		ВидТарифаОбъект.КодПФР2011 = "03";
		ВидТарифаОбъект.КодФСС2011 = "061";
		ВидТарифаОбъект.Записать();
	КонецЕсли;

	ВидТарифаСсылка = РегламентированнаяОтчетностьПереопределяемый.СсылкаНаОбъектПоИдентификатору("Справочник.ВидыТарифовСтраховыхВзносов", "РезидентТехникоВнедренческойЗоны");
	Если НЕ ЗначениеЗаполнено(ВидТарифаСсылка) Тогда
		ВидТарифаОбъект = РегламентированнаяОтчетностьПереопределяемый.ОбъектСИдентификатором("Справочник.ВидыТарифовСтраховыхВзносов", "РезидентТехникоВнедренческойЗоны");
		ВидТарифаОбъект.Наименование = "Резиденты технико-внедренческой особой экономической зоны";
		ВидТарифаОбъект.КодПФР2011 = "36";
		ВидТарифаОбъект.КодФСС2011 = "051";
		ВидТарифаОбъект.Записать();
	КонецЕсли;

	ВидТарифаСсылка = РегламентированнаяОтчетностьПереопределяемый.СсылкаНаОбъектПоИдентификатору("Справочник.ВидыТарифовСтраховыхВзносов", "УчастникПроектаИнновационныйЦентрСколково");
	Если НЕ ЗначениеЗаполнено(ВидТарифаСсылка) Тогда
		ВидТарифаОбъект = РегламентированнаяОтчетностьПереопределяемый.ОбъектСИдентификатором("Справочник.ВидыТарифовСтраховыхВзносов", "УчастникПроектаИнновационныйЦентрСколково");
		ВидТарифаОбъект.Наименование = "Участник проекта инновационный центр ""Сколково""";
		ВидТарифаОбъект.КодПФР2011 = "10";
		ВидТарифаОбъект.КодФСС2011 = "081";
		ВидТарифаОбъект.Записать();
	КонецЕсли;

	ВидТарифаСсылка = РегламентированнаяОтчетностьПереопределяемый.СсылкаНаОбъектПоИдентификатору("Справочник.ВидыТарифовСтраховыхВзносов", "ХозОбществаБюджетныхВУЗов");
	Если НЕ ЗначениеЗаполнено(ВидТарифаСсылка) Тогда
		ВидТарифаОбъект = РегламентированнаяОтчетностьПереопределяемый.ОбъектСИдентификатором("Справочник.ВидыТарифовСтраховыхВзносов", "ХозОбществаБюджетныхВУЗов");
		ВидТарифаОбъект.Наименование = "Хозяйственные общества, созданные бюджетными научными учреждениями и ВУЗами";
		ВидТарифаОбъект.КодПФР2011 = "08";
		ВидТарифаОбъект.КодФСС2011 = "101";
		ВидТарифаОбъект.Записать();
	КонецЕсли;

	ВидТарифаСсылка = РегламентированнаяОтчетностьПереопределяемый.СсылкаНаОбъектПоИдентификатору("Справочник.ВидыТарифовСтраховыхВзносов", "ITОрганизации");
	Если НЕ ЗначениеЗаполнено(ВидТарифаСсылка) Тогда
		ВидТарифаОбъект = РегламентированнаяОтчетностьПереопределяемый.ОбъектСИдентификатором("Справочник.ВидыТарифовСтраховыхВзносов", "ITОрганизации");
		ВидТарифаОбъект.Наименование = "Организации, работающие в области информационных технологий";
		ВидТарифаОбъект.КодПФР2011 = "06";
		ВидТарифаОбъект.КодФСС2011 = "091";
		ВидТарифаОбъект.Записать();
	КонецЕсли;

	ВидТарифаСсылка = РегламентированнаяОтчетностьПереопределяемый.СсылкаНаОбъектПоИдентификатору("Справочник.ВидыТарифовСтраховыхВзносов", "УпрощенныйНалоговыйРежимПроизводство");
	Если НЕ ЗначениеЗаполнено(ВидТарифаСсылка) Тогда
		ВидТарифаОбъект = РегламентированнаяОтчетностьПереопределяемый.ОбъектСИдентификатором("Справочник.ВидыТарифовСтраховыхВзносов", "УпрощенныйНалоговыйРежимПроизводство");
		ВидТарифаОбъект.Наименование = "Организации, применяющие УСН, занятые производством и приравненными видами деятельности";
		ВидТарифаОбъект.КодПФР2011 = "07";
		ВидТарифаОбъект.КодФСС2011 = "071";
		ВидТарифаОбъект.Записать();
	КонецЕсли;

	ВидТарифаСсылка = РегламентированнаяОтчетностьПереопределяемый.СсылкаНаОбъектПоИдентификатору("Справочник.ВидыТарифовСтраховыхВзносов", "СМИ");
	Если НЕ ЗначениеЗаполнено(ВидТарифаСсылка) Тогда
		ВидТарифаОбъект = РегламентированнаяОтчетностьПереопределяемый.ОбъектСИдентификатором("Справочник.ВидыТарифовСтраховыхВзносов", "СМИ");
		ВидТарифаОбъект.Наименование = "Организации - средства массовой информации";
		ВидТарифаОбъект.КодПФР2011 = "09";
		ВидТарифаОбъект.КодФСС2011 = "111";
		ВидТарифаОбъект.Записать();
	КонецЕсли;

	ВидТарифаСсылка = РегламентированнаяОтчетностьПереопределяемый.СсылкаНаОбъектПоИдентификатору("Справочник.ВидыТарифовСтраховыхВзносов", "НародныеХудожественныеПромыслы");
	Если НЕ ЗначениеЗаполнено(ВидТарифаСсылка) Тогда
		ВидТарифаОбъект = РегламентированнаяОтчетностьПереопределяемый.ОбъектСИдентификатором("Справочник.ВидыТарифовСтраховыхВзносов", "НародныеХудожественныеПромыслы");
		ВидТарифаОбъект.Наименование = "Организации народных художественных промыслов и семейных (родовых) общин";
		ВидТарифаОбъект.КодПФР2011 = "02";
		ВидТарифаОбъект.КодФСС2011 = "071";
		ВидТарифаОбъект.Записать();
	КонецЕсли;

	ВидТарифаСсылка = РегламентированнаяОтчетностьПереопределяемый.СсылкаНаОбъектПоИдентификатору("Справочник.ВидыТарифовСтраховыхВзносов", "ДляЧленовЭкипажейМорскихСудовПодФлагомРФ");
	Если НЕ ЗначениеЗаполнено(ВидТарифаСсылка) Тогда
		ВидТарифаОбъект = РегламентированнаяОтчетностьПереопределяемый.ОбъектСИдентификатором("Справочник.ВидыТарифовСтраховыхВзносов", "ДляЧленовЭкипажейМорскихСудовПодФлагомРФ");
		ВидТарифаОбъект.Наименование = "Для членов экипажей морских судов под флагом РФ";
		ВидТарифаОбъект.КодПФР2011 = "";
		ВидТарифаОбъект.КодФСС2011 = "";
		ВидТарифаОбъект.Записать();
	КонецЕсли;

	ВидТарифаСсылка = РегламентированнаяОтчетностьПереопределяемый.СсылкаНаОбъектПоИдентификатору("Справочник.ВидыТарифовСтраховыхВзносов", "ДляФармацевтовАптек");
	Если НЕ ЗначениеЗаполнено(ВидТарифаСсылка) Тогда
		ВидТарифаОбъект = РегламентированнаяОтчетностьПереопределяемый.ОбъектСИдентификатором("Справочник.ВидыТарифовСтраховыхВзносов", "ДляФармацевтовАптек");
		ВидТарифаОбъект.Наименование = "Для фармацевтов аптек";
		ВидТарифаОбъект.КодПФР2011 = "";
		ВидТарифаОбъект.КодФСС2011 = "";
		ВидТарифаОбъект.Записать();
	КонецЕсли;

	ВидТарифаСсылка = РегламентированнаяОтчетностьПереопределяемый.СсылкаНаОбъектПоИдентификатору("Справочник.ВидыТарифовСтраховыхВзносов", "НекоммерческиеОрганизации");
	Если НЕ ЗначениеЗаполнено(ВидТарифаСсылка) Тогда
		ВидТарифаОбъект = РегламентированнаяОтчетностьПереопределяемый.ОбъектСИдентификатором("Справочник.ВидыТарифовСтраховыхВзносов", "НекоммерческиеОрганизации");
		ВидТарифаОбъект.Наименование = "Некоммерческие организации";
		ВидТарифаОбъект.КодПФР2011 = "";
		ВидТарифаОбъект.КодФСС2011 = "";
		ВидТарифаОбъект.Записать();
	КонецЕсли;

	ВидТарифаСсылка = РегламентированнаяОтчетностьПереопределяемый.СсылкаНаОбъектПоИдентификатору("Справочник.ВидыТарифовСтраховыхВзносов", "БлаготворительныеОрганизации");
	Если НЕ ЗначениеЗаполнено(ВидТарифаСсылка) Тогда
		ВидТарифаОбъект = РегламентированнаяОтчетностьПереопределяемый.ОбъектСИдентификатором("Справочник.ВидыТарифовСтраховыхВзносов", "БлаготворительныеОрганизации");
		ВидТарифаОбъект.Наименование = "Благотворительные организации";
		ВидТарифаОбъект.КодПФР2011 = "";
		ВидТарифаОбъект.КодФСС2011 = "";
		ВидТарифаОбъект.Записать();
	КонецЕсли;

	ВидТарифаСсылка = РегламентированнаяОтчетностьПереопределяемый.СсылкаНаОбъектПоИдентификатору("Справочник.ВидыТарифовСтраховыхВзносов", "ОрганизацииОказывающиеИнжиниринговыеУслуги");
	Если НЕ ЗначениеЗаполнено(ВидТарифаСсылка) Тогда
		ВидТарифаОбъект = РегламентированнаяОтчетностьПереопределяемый.ОбъектСИдентификатором("Справочник.ВидыТарифовСтраховыхВзносов", "ОрганизацииОказывающиеИнжиниринговыеУслуги");
		ВидТарифаОбъект.Наименование = "Организации, оказывающие инжиниринговые услуги";
		ВидТарифаОбъект.КодПФР2011 = "";
		ВидТарифаОбъект.КодФСС2011 = "";
		ВидТарифаОбъект.Записать();
	КонецЕсли;	
	
	ВидТарифаСсылка = РегламентированнаяОтчетностьПереопределяемый.СсылкаНаОбъектПоИдентификатору("Справочник.ВидыТарифовСтраховыхВзносов", "ИндивидуальныйПредпринимательПрименяющийПатент");
	Если НЕ ЗначениеЗаполнено(ВидТарифаСсылка) Тогда
		ВидТарифаОбъект = РегламентированнаяОтчетностьПереопределяемый.ОбъектСИдентификатором("Справочник.ВидыТарифовСтраховыхВзносов", "ИндивидуальныйПредпринимательПрименяющийПатент");
		ВидТарифаОбъект.Наименование = "Индивидуальный предприниматель, применяющий патент";
		ВидТарифаОбъект.КодПФР2011 = "";
		ВидТарифаОбъект.КодФСС2011 = "";
		ВидТарифаОбъект.Записать();
	КонецЕсли;	
	
	ВидТарифаСсылка = РегламентированнаяОтчетностьПереопределяемый.СсылкаНаОбъектПоИдентификатору("Справочник.ВидыТарифовСтраховыхВзносов", "УчастникОсобойЗоныВКрыму");
	Если НЕ ЗначениеЗаполнено(ВидТарифаСсылка) Тогда
		ВидТарифаОбъект = РегламентированнаяОтчетностьПереопределяемый.ОбъектСИдентификатором("Справочник.ВидыТарифовСтраховыхВзносов", "УчастникОсобойЗоныВКрыму");
		ВидТарифаОбъект.Наименование = "Участник свободной экономической зоны в Крыму";
		ВидТарифаОбъект.КодПФР2011 = "";
		ВидТарифаОбъект.КодФСС2011 = "";
		ВидТарифаОбъект.Записать();
	КонецЕсли;	
	
	ВидТарифаСсылка = РегламентированнаяОтчетностьПереопределяемый.СсылкаНаОбъектПоИдентификатору("Справочник.ВидыТарифовСтраховыхВзносов", "ИндивидуальныйПредпринимательПрименяющийПатент");
	Если НЕ ЗначениеЗаполнено(ВидТарифаСсылка) Тогда
		ВидТарифаОбъект = РегламентированнаяОтчетностьПереопределяемый.ОбъектСИдентификатором("Справочник.ВидыТарифовСтраховыхВзносов", "ИндивидуальныйПредпринимательПрименяющийПатент");
		ВидТарифаОбъект.Наименование = "Индивидуальный предприниматель, применяющий патент";
		ВидТарифаОбъект.КодПФР2011 = "";
		ВидТарифаОбъект.КодФСС2011 = "";
		ВидТарифаОбъект.Записать();
	КонецЕсли;	
	
	ВидТарифаСсылка = РегламентированнаяОтчетностьПереопределяемый.СсылкаНаОбъектПоИдентификатору("Справочник.ВидыТарифовСтраховыхВзносов", "УчастникОсобойЗоныВКрыму");
	Если НЕ ЗначениеЗаполнено(ВидТарифаСсылка) Тогда
		ВидТарифаОбъект = РегламентированнаяОтчетностьПереопределяемый.ОбъектСИдентификатором("Справочник.ВидыТарифовСтраховыхВзносов", "УчастникОсобойЗоныВКрыму");
		ВидТарифаОбъект.Наименование = "Участник свободной экономической зоны в Крыму";
		ВидТарифаОбъект.КодПФР2011 = "";
		ВидТарифаОбъект.КодФСС2011 = "";
		ВидТарифаОбъект.Записать();
	КонецЕсли;	
	
КонецПроцедуры	

Процедура ДобавитьТарифыПатентИОсобаяЗонаКрым() Экспорт
	
	ВидТарифаСсылка = РегламентированнаяОтчетностьПереопределяемый.СсылкаНаОбъектПоИдентификатору("Справочник.ВидыТарифовСтраховыхВзносов", "ИндивидуальныйПредпринимательПрименяющийПатент");
	Если НЕ ЗначениеЗаполнено(ВидТарифаСсылка) Тогда
		ВидТарифаОбъект = РегламентированнаяОтчетностьПереопределяемый.ОбъектСИдентификатором("Справочник.ВидыТарифовСтраховыхВзносов", "ИндивидуальныйПредпринимательПрименяющийПатент");
		ВидТарифаОбъект.Наименование = "Индивидуальный предприниматель, применяющий патент";
		ВидТарифаОбъект.КодПФР2011 = "";
		ВидТарифаОбъект.КодФСС2011 = "";
		ВидТарифаОбъект.КодПФР2012 = "16";
		ВидТарифаОбъект.КодФСС2012 = "041";
		ВидТарифаОбъект.Записать();
	КонецЕсли;	
	
	ВидТарифаСсылка = РегламентированнаяОтчетностьПереопределяемый.СсылкаНаОбъектПоИдентификатору("Справочник.ВидыТарифовСтраховыхВзносов", "УчастникОсобойЗоныВКрыму");
	Если НЕ ЗначениеЗаполнено(ВидТарифаСсылка) Тогда
		ВидТарифаОбъект = РегламентированнаяОтчетностьПереопределяемый.ОбъектСИдентификатором("Справочник.ВидыТарифовСтраховыхВзносов", "УчастникОсобойЗоныВКрыму");
		ВидТарифаОбъект.Наименование = "Участник свободной экономической зоны в Крыму";
		ВидТарифаОбъект.КодПФР2011 = "";
		ВидТарифаОбъект.КодФСС2011 = "";
		ВидТарифаОбъект.Записать();
	КонецЕсли;	
	
КонецПроцедуры

Процедура ЗаполнитьКодыВидовТарифаСтраховыхВзносов_2012() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка,
	|	""01"" КАК КодПФР2012,
	|	""071"" КАК КодФСС2012
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.ИдентификаторОбъекта = ""ОбщийНалоговыйРежим""
	|	И ВидыТарифовСтраховыхВзносов.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносов.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка,
	|	""18"",
	|	""041""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.ИдентификаторОбъекта = ""СельХозПроизводители""
	|	И ВидыТарифовСтраховыхВзносов.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносов.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка,
	|	""52"",
	|	""071""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.ИдентификаторОбъекта = ""УпрощенныйНалоговыйРежим""
	|	И ВидыТарифовСтраховыхВзносов.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносов.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка,
	|	""04"",
	|	""032""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.ИдентификаторОбъекта = ""ЕСХН""
	|	И ВидыТарифовСтраховыхВзносов.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносов.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка,
	|	""53"",
	|	""071""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.ИдентификаторОбъекта = ""ЕНВД""
	|	И ВидыТарифовСтраховыхВзносов.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносов.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка,
	|	""03"",
	|	""061""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.ИдентификаторОбъекта = ""ОрганизацияИнвалидов""
	|	И ВидыТарифовСтраховыхВзносов.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносов.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка,
	|	""36"",
	|	""051""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.ИдентификаторОбъекта = ""РезидентТехникоВнедренческойЗоны""
	|	И ВидыТарифовСтраховыхВзносов.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносов.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка,
	|	""10"",
	|	""081""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.ИдентификаторОбъекта = ""УчастникПроектаИнновационныйЦентрСколково""
	|	И ВидыТарифовСтраховыхВзносов.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносов.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка,
	|	""06"",
	|	""091""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.ИдентификаторОбъекта = ""ITОрганизации""
	|	И ВидыТарифовСтраховыхВзносов.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносов.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка,
	|	""08"",
	|	""101""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.ИдентификаторОбъекта = ""ХозОбществаБюджетныхВУЗов""
	|	И ВидыТарифовСтраховыхВзносов.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносов.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка,
	|	""07"",
	|	""121""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.ИдентификаторОбъекта = ""УпрощенныйНалоговыйРежимПроизводство""
	|	И ВидыТарифовСтраховыхВзносов.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносов.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка,
	|	""09"",
	|	""071""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.ИдентификаторОбъекта = ""СМИ""
	|	И ВидыТарифовСтраховыхВзносов.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносов.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка,
	|	""19"",
	|	""042""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.ИдентификаторОбъекта = ""НародныеХудожественныеПромыслы""
	|	И ВидыТарифовСтраховыхВзносов.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносов.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка,
	|	""15"",
	|	""131""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.ИдентификаторОбъекта = ""ДляЧленовЭкипажейМорскихСудовПодФлагомРФ""
	|	И ВидыТарифовСтраховыхВзносов.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносов.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка,
	|	""11"",
	|	""141""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.ИдентификаторОбъекта = ""ДляФармацевтовАптек""
	|	И ВидыТарифовСтраховыхВзносов.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносов.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка,
	|	""12"",
	|	""151""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.ИдентификаторОбъекта = ""НекоммерческиеОрганизации""
	|	И ВидыТарифовСтраховыхВзносов.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносов.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка,
	|	""13"",
	|	""161""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.ИдентификаторОбъекта = ""БлаготворительныеОрганизации""
	|	И ВидыТарифовСтраховыхВзносов.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносов.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка,
	|	""14"",
	|	""071""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.ИдентификаторОбъекта = ""ОрганизацииОказывающиеИнжиниринговыеУслуги""
	|	И ВидыТарифовСтраховыхВзносов.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносов.КодФСС2012 = """"
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносов.Ссылка,
	|	""16"",
	|	""041""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносов КАК ВидыТарифовСтраховыхВзносов
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносов.ИдентификаторОбъекта = ""ИндивидуальныйПредпринимательПрименяющийПатент""
	|	И ВидыТарифовСтраховыхВзносов.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносов.КодФСС2012 = """"";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ВидТарифаОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(ВидТарифаОбъект,Выборка,,"Ссылка");
		ВидТарифаОбъект.Записать();
	КонецЦикла;

КонецПроцедуры	

// Возвращает реквизиты справочника, которые образуют естественный ключ
//  для элементов справочника.
//
// Возвращаемое значение: Массив(Строка) - массив имен реквизитов, образующих
//  естественный ключ.
//
Функция ПоляЕстественногоКлюча() Экспорт
	
	Результат = Новый Массив();
	
	Результат.Добавить("Наименование");
	Результат.Добавить("ПометкаУдаления");
	
	Возврат Результат;
	
КонецФункции

#КонецЕсли