///////////////////////////////////////////////////////////////////////////////
// Размещаются процедуры и функции для работы по разделу Календарь отчетности

// Открывает форму начального заполнения документов в переданной форме
Процедура ОткрытьФормуНачалаЗаполнения(Форма, ПараметрыОткрытия=Неопределено) Экспорт
	
	Если ПараметрыОткрытия = Неопределено Тогда
		ПараметрыОткрытия = Новый Структура;
	КонецЕсли;
	
	ОткрытьФорму("Обработка.ОбработкиНалоговИОтчетности.Форма.ОписанияЗадачИСтартВыполнения", ПараметрыОткрытия);
	
КонецПроцедуры