#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ИнтерфейсПечати

Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ПлатежнаяВедомость";
	
	ПервыйДокумент = Истина;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПлатежнаяВедомость.Дата КАК ДатаДокумента,
		|	ПлатежнаяВедомость.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ПлатежнаяВедомость.ПериодРегистрации КАК ПериодРегистрации,
		|	ПлатежнаяВедомость.Номер,
		|	ПлатежнаяВедомость.Организация.Префикс КАК Префикс,
		|	ПлатежнаяВедомость.ВалютаДокумента,
		|	ПлатежнаяВедомость.Организация.НаименованиеПолное,
		|	ПлатежнаяВедомость.Организация
		|ИЗ
		|	Документ.ПлатежнаяВедомость КАК ПлатежнаяВедомость
		|ГДЕ
		|	ПлатежнаяВедомость.Ссылка = &ТекущийДокумент";
		
		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент",   ТекущийДокумент);
		Запрос.УстановитьПараметр("ПериодРегистрации", КонецМесяца(ТекущийДокумент.ПериодРегистрации));
		Запрос.УстановитьПараметр("Осн", НСтр("ru = 'Осн.'"));
		Запрос.УстановитьПараметр("Совм", НСтр("ru = 'Совм.'"));
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПлатежнаяВедомостьСотрудники.Сотрудник.Код КАК ТабельныйНомер,
		|	ВЫБОР
		|		КОГДА ПлатежнаяВедомостьСотрудники.Сотрудник.ТипЗанятости = ЗНАЧЕНИЕ(Перечисление.ТипыЗанятости.ОсновноеМестоРаботы)
		|			ТОГДА &Осн
		|		ИНАЧЕ &Совм
		|	КОНЕЦ КАК ХарактерРаботы,
		|	СУММА(ПлатежнаяВедомостьСотрудники.СуммаПлатежа) КАК Сумма,
		|	ФИОФизЛицСрезПоследних.Фамилия,
		|	ФИОФизЛицСрезПоследних.Имя,
		|	ФИОФизЛицСрезПоследних.Отчество,
		|	ФИОФизЛицСрезПоследних.Период,
		|	ПлатежнаяВедомостьСотрудники.Сотрудник КАК Физлицо,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ФИОФизЛицСрезПоследних.Фамилия, """") <> """"
		|			ТОГДА ФИОФизЛицСрезПоследних.Фамилия + "" "" + ФИОФизЛицСрезПоследних.Имя + "" "" + ФИОФизЛицСрезПоследних.Отчество
		|		ИНАЧЕ ПлатежнаяВедомостьСотрудники.Сотрудник.Наименование
		|	КОНЕЦ КАК СотрудникПредставление
		|ИЗ
		|	Документ.ПлатежнаяВедомость.Сотрудники КАК ПлатежнаяВедомостьСотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ПериодРегистрации, ) КАК ФИОФизЛицСрезПоследних
		|		ПО ПлатежнаяВедомостьСотрудники.Сотрудник.Физлицо = ФИОФизЛицСрезПоследних.ФизЛицо
		|ГДЕ
		|	ПлатежнаяВедомостьСотрудники.Ссылка = &ТекущийДокумент
		|
		|СГРУППИРОВАТЬ ПО
		|	ФИОФизЛицСрезПоследних.Имя,
		|	ФИОФизЛицСрезПоследних.Отчество,
		|	ВЫБОР
		|		КОГДА ПлатежнаяВедомостьСотрудники.Сотрудник.ТипЗанятости = ЗНАЧЕНИЕ(Перечисление.ТипыЗанятости.ОсновноеМестоРаботы)
		|			ТОГДА &Осн
		|		ИНАЧЕ &Совм
		|	КОНЕЦ,
		|	ФИОФизЛицСрезПоследних.Фамилия,
		|	ПлатежнаяВедомостьСотрудники.Сотрудник,
		|	ФИОФизЛицСрезПоследних.Период,
		|	ПлатежнаяВедомостьСотрудники.Сотрудник.Код,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ФИОФизЛицСрезПоследних.Фамилия, """") <> """"
		|			ТОГДА ФИОФизЛицСрезПоследних.Фамилия + "" "" + ФИОФизЛицСрезПоследних.Имя + "" "" + ФИОФизЛицСрезПоследних.Отчество
		|		ИНАЧЕ ПлатежнаяВедомостьСотрудники.Сотрудник.Наименование
		|	КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	СотрудникПредставление";
		
		Выборка = Запрос.Выполнить().Выбрать();

		ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПлатежнаяВедомость_Макет";
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПлатежнаяВедомость.ПФ_MXL_Макет");
		
		ОбластьШапкаДокумента = Макет.ПолучитьОбласть("ШапкаДокумента");
		ОбластьШапка          = Макет.ПолучитьОбласть("Шапка");
		ОбластьДетали         = Макет.ПолучитьОбласть("Детали");
		ОбластьПодвал         = Макет.ПолучитьОбласть("Подвал");
		
		Если Шапка.ДатаДокумента < Дата('20110101') Тогда
			НомерДокумента = УправлениеНебольшойФирмойСервер.ПолучитьНомерНаПечать(Шапка.Номер, Шапка.Префикс);
		Иначе
			НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Шапка.Номер, Истина, Истина);
		КонецЕсли;		
		
		ОбластьШапкаДокумента.Параметры.НазваниеОрганизации = Шапка.ОрганизацияНаименованиеПолное;
		ОбластьШапкаДокумента.Параметры.Подразделение = Шапка.СтруктурнаяЕдиница;
		ОбластьШапкаДокумента.Параметры.СуммаДокПрописью = РаботаСКурсамиВалют.СформироватьСуммуПрописью(ТекущийДокумент.Сотрудники.Итог("СуммаПлатежа"), Шапка.ВалютаДокумента);
		ОбластьШапкаДокумента.Параметры.СуммаДок = ТекущийДокумент.Сотрудники.Итог("СуммаПлатежа");
		ОбластьШапкаДокумента.Параметры.Валюта = Шапка.ВалютаДокумента;
		ОбластьШапкаДокумента.Параметры.НомерДок = НомерДокумента;
		ОбластьШапкаДокумента.Параметры.ДатаДок = Шапка.ДатаДокумента;
		ОбластьШапкаДокумента.Параметры.ОтчетныйПериодС = Шапка.ПериодРегистрации;
		ОбластьШапкаДокумента.Параметры.ОтчетныйПериодПо = КонецМесяца(Шапка.ПериодРегистрации);
		
		Руководители = УправлениеНебольшойФирмойСервер.ОтветственныеЛицаОрганизационнойЕдиницы(Шапка.Организация, Шапка.ДатаДокумента);
		ОбластьШапкаДокумента.Параметры.Заполнить(Руководители);
		
		ТабличныйДокумент.Вывести(ОбластьШапкаДокумента);
		
		ОбластьШапка.Параметры.НадписьСумма = "Сумма, " + (Шапка.ВалютаДокумента);
		ТабличныйДокумент.Вывести(ОбластьШапка);
			
		НПП = 0;
		Пока Выборка.Следующий() Цикл
			НПП = НПП + 1;
			ОбластьДетали.Параметры.НомерСтроки = НПП;
			ОбластьДетали.Параметры.Заполнить(Выборка);
			Если ЗначениеЗаполнено(Выборка.Фамилия) Тогда
				ФИО = УправлениеНебольшойФирмойСервер.ПолучитьФамилиюИмяОтчество(Выборка.Фамилия, Выборка.Имя, Выборка.Отчество, Истина);
				ОбластьДетали.Параметры.ФизЛицо = ?(ЗначениеЗаполнено(ФИО), ФИО, Выборка.Физлицо);
			КонецЕсли; 
			ТабличныйДокумент.Вывести(ОбластьДетали);
		КонецЦикла;
		
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
	
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатнаяФорма()

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПлатежнаяВедомость") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПлатежнаяВедомость", "Платежная ведомость", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;
	
	// параметры отправки печатных форм по электронной почте
	УправлениеНебольшойФирмойСервер.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
КонецПроцедуры // Печать()

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПлатежнаяВедомость";
	КомандаПечати.Представление = НСтр("ru = 'Платежная ведомость'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 1;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли