&НаКлиенте
Перем УдаляемыеСтроки;

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ НА СЕРВЕРЕ

&НаСервере
Функция ПроверитьЗаполнениеНаСервере()Экспорт
	ДокументОбъект = РеквизитФормыВЗначение ("Объект", Тип("ДокументОбъект.РеестрСЗВ_6_2"));
	Возврат ДокументОбъект.ПроверитьЗаполнение();
КонецФункции

&НаСервере
Процедура ЗаполнитьСуммыВзносовНаСервере()
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьДанныеФизЛицДокументаНаСервере() 
	
КонецПроцедуры	

&НаСервере
Процедура ОбработкаПодбораНаСервере(МассивСотрудников)
	
КонецПроцедуры

&НаСервере
Процедура СотрудникиСотрудникПриИзмененииНаСервере()
	
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьДанныеОСтажеНаСервере()
	
КонецПроцедуры	

&НаСервере 
Процедура ЗаполнитьВсеАдресаНаСервере()
	
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьИзменившиесяАдресаНаСервере()
	
КонецПроцедуры

&НаСервере
Процедура СформироватьФайлНаСервере()
	
КонецПроцедуры	

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ (НА КЛИЕНТЕ)

&НаКлиенте
Процедура ЗаполнитьИнфоНадпись()
КонецПроцедуры	

&НаКлиенте
Процедура ОткрытьФормуРедактированияПериодовСтажа(Элемент)	
	Сотрудник = Элементы.Сотрудники.ТекущиеДанные.Сотрудник;
	СтруктураПоиска = Новый Структура("Сотрудник", Сотрудник);
	НайденныеСтрокиСтажа = Объект.ЗаписиОСтаже.НайтиСтроки(СтруктураПоиска); 
	УдаляемыеСтроки = НайденныеСтрокиСтажа;
				
	МассивЗаписейСтажа = Новый Массив;
	
	Для Каждого СтрокаСтажаСотрудника Из НайденныеСтрокиСтажа Цикл
		СтруктураСтажа = Новый Структура("ДатаНачалаПериода, ДатаОкончанияПериода", СтрокаСтажаСотрудника.ДатаНачалаПериода, СтрокаСтажаСотрудника.ДатаОкончанияПериода);
		
		МассивЗаписейСтажа.Добавить(СтруктураСтажа);
	КонецЦикла;
	
	СтруктураПараметровФормы = Новый Структура("МассивЗаписейСтажа", МассивЗаписейСтажа);
		
	ФормаРедактированияСтажа = ПолучитьФорму("Документ.РеестрСЗВ_6_2.Форма.ФормаРедактированияСтажа", СтруктураПараметровФормы, Элемент);
			
	ФормаРедактированияСтажа.Открыть();
		
КонецПроцедуры	

&НаКлиенте
Процедура ОбработатьВыборПериодаСтажа(ВыбранноеЗначение)
	ПериодыСтажаПредставление = "";
	
	Сотрудник = Элементы.Сотрудники.ТекущиеДанные.Сотрудник;
	Если ВыбранноеЗначение <> Неопределено Тогда
		Для Каждого УдаляемаяСтрока Из УдаляемыеСтроки Цикл
			Объект.ЗаписиОСтаже.Удалить(Объект.ЗаписиОСтаже.Индекс(УдаляемаяСтрока));
		КонецЦикла;	
		
		Для Каждого ДобавляемаяСтрока Из ВыбранноеЗначение.ДобавляемыеСтроки Цикл
			СтрокаСтаж = Объект.ЗаписиОСтаже.Добавить();
			СтрокаСтаж.Сотрудник = Сотрудник;
			ЗаполнитьЗначенияСвойств(СтрокаСтаж, ДобавляемаяСтрока);
			
			ПериодыСтажаПредставление = ПериодыСтажаПредставление + Формат(СтрокаСтаж.ДатаНачалаПериода, "ДФ=dd.MM.yy") + Символы.НПП + "-" + Символы.НПП + Формат(СтрокаСтаж.ДатаОкончанияПериода, "ДФ=dd.MM.yy") + Символы.ПС;
		КонецЦикла;	
		Модифицированность = (Модифицированность Или ВыбранноеЗначение.Модифицированность);
	КонецЕсли;
	
	СтрокаСотрудники = Элементы.Сотрудники.ТекущиеДанные;
	СтрокаСотрудники.ПериодыСтажаСтрока = ПериодыСтажаПредставление;
	СтрокаСотрудники.ФиксСтаж = СтрокаСотрудники.ФиксСтаж Или ВыбранноеЗначение.Модифицированность;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Объект.ТипСведенийСЗВ = Перечисления.ТипыСведенийСЗВ.ИСХОДНАЯ Тогда
		Объект.КорректируемыйПериод = '00010101';
		КорректируемыйМесяцСтрока = "";
		Элементы.КорректируемыйПериод.ТолькоПросмотр = Истина;
		
		Элементы.СотрудникиНачисленоСтраховая.Видимость = Истина;
		Элементы.СотрудникиУплаченоСтраховая.Видимость = Истина;
		
		Элементы.СотрудникиНачисленоНакопительная.Видимость = Истина;
		Элементы.СотрудникиУплаченоНакопительная.Видимость = Истина;
		
		Элементы.СотрудникиДоначисленоНакопительная.Видимость = Ложь;
		Элементы.СотрудникиДоначисленоСтраховая.Видимость     = Ложь;
		
		Элементы.СотрудникиДоуплаченоНакопительная.Видимость = Ложь;
		Элементы.СотрудникиДоуплаченоСтраховая.Видимость     = Ложь;
	Иначе
		Если Объект.ТипСведенийСЗВ = Перечисления.ТипыСведенийСЗВ.КОРРЕКТИРУЮЩАЯ Тогда
			Элементы.СотрудникиНачисленоСтраховая.Видимость = Истина;
			Элементы.СотрудникиУплаченоСтраховая.Видимость = Истина;
			
			Элементы.СотрудникиНачисленоНакопительная.Видимость = Истина;
			Элементы.СотрудникиУплаченоНакопительная.Видимость = Истина;
			
			Элементы.СотрудникиДоначисленоНакопительная.Видимость = Истина;
			Элементы.СотрудникиДоначисленоСтраховая.Видимость     = Истина;
			
			Элементы.СотрудникиДоуплаченоНакопительная.Видимость = Истина;
			Элементы.СотрудникиДоуплаченоСтраховая.Видимость     = Истина;
		Иначе
			Элементы.СотрудникиНачисленоСтраховая.Видимость = Ложь;
			Элементы.СотрудникиУплаченоСтраховая.Видимость = Ложь;
			
			Элементы.СотрудникиНачисленоНакопительная.Видимость = Ложь;
			Элементы.СотрудникиУплаченоНакопительная.Видимость = Ложь;
	
			Элементы.СотрудникиДоначисленоНакопительная.Видимость = Ложь;
			Элементы.СотрудникиДоначисленоСтраховая.Видимость     = Ложь;
			
			Элементы.СотрудникиДоуплаченоНакопительная.Видимость = Ложь;
			Элементы.СотрудникиДоуплаченоСтраховая.Видимость     = Ложь;
    	КонецЕсли;
		
		Элементы.КорректируемыйПериод.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
	КоллекцияИменРеквизитовСодержащихАдрес.Добавить("АдресДляИнформирования");
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Элементы.Сотрудники.ТекущиеДанные = Неопределено Тогда
		ЗаписиОСтажеТекст = Нстр("ru = 'Записи о стаже:'"); 
	КонецЕсли;
	ЗаполнитьИнфоНадпись();	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ОчиститьСообщения();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Объект.ФайлСформирован И Не ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ПроверитьЗаполнениеНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ЗаполнитьИнфоНадпись();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ИзменениеДанныхФизическогоЛица" Тогда
		СтруктураОтбора = Новый Структура("Сотрудник", Источник);
		СтрокиПоСотруднику = Объект.Сотрудники.НайтиСтроки(СтруктураОтбора);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТипСведенийПриИзменении(Элемент)
	Если Объект.ТипСведенийСЗВ = ПредопределенноеЗначение("Перечисление.ТипыСведенийСЗВ.ИСХОДНАЯ") Тогда
		Объект.КорректируемыйПериод = '00010101';
		КорректируемыйПериодСтрока = "";
		Элементы.КорректируемыйПериод.ТолькоПросмотр = Истина;
		
		Элементы.СотрудникиНачисленоСтраховая.Видимость = Истина;
		Элементы.СотрудникиУплаченоСтраховая.Видимость = Истина;
		
		Элементы.СотрудникиНачисленоНакопительная.Видимость = Истина;
		Элементы.СотрудникиУплаченоНакопительная.Видимость = Истина;
		
		Элементы.СотрудникиДоначисленоНакопительная.Видимость = Ложь;
		Элементы.СотрудникиДоначисленоСтраховая.Видимость     = Ложь;
		
		Элементы.СотрудникиДоуплаченоНакопительная.Видимость = Ложь;
		Элементы.СотрудникиДоуплаченоСтраховая.Видимость     = Ложь;
	Иначе
		
		Если Объект.ТипСведенийСЗВ = ПредопределенноеЗначение("Перечисление.ТипыСведенийСЗВ.КОРРЕКТИРУЮЩАЯ") Тогда
			Элементы.СотрудникиНачисленоСтраховая.Видимость = Истина;
			Элементы.СотрудникиУплаченоСтраховая.Видимость = Истина;
			
			Элементы.СотрудникиНачисленоНакопительная.Видимость = Истина;
			Элементы.СотрудникиУплаченоНакопительная.Видимость = Истина;
			
			Элементы.СотрудникиДоначисленоНакопительная.Видимость = Истина;
			Элементы.СотрудникиДоначисленоСтраховая.Видимость     = Истина;
			
            Элементы.СотрудникиДоуплаченоНакопительная.Видимость = Истина;
			Элементы.СотрудникиДоуплаченоСтраховая.Видимость     = Истина;
		Иначе
			Элементы.СотрудникиНачисленоСтраховая.Видимость = Ложь;
			Элементы.СотрудникиУплаченоСтраховая.Видимость = Ложь;
			
			Элементы.СотрудникиНачисленоНакопительная.Видимость = Ложь;
			Элементы.СотрудникиУплаченоНакопительная.Видимость = Ложь;
						
			Элементы.СотрудникиДоначисленоНакопительная.Видимость = Ложь;
			Элементы.СотрудникиДоначисленоСтраховая.Видимость     = Ложь;	
			
			Элементы.СотрудникиДоуплаченоНакопительная.Видимость = Ложь;
			Элементы.СотрудникиДоуплаченоСтраховая.Видимость     = Ложь;
    	КонецЕсли;
		
		Элементы.КорректируемыйПериод.ТолькоПросмотр = Ложь;
		
	КонецЕсли;
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ КОМАНД

&НаКлиенте
Процедура ЗаполнитьДанныеСотрудников(Команда)
	
	ЗаполнитьДанныеФизЛицДокументаНаСервере();
	Если Не Объект.ДокументПринятВПФР Тогда
		ЗаполнитьИнфоНадпись();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	Объект.ДокументПринятВПФР = Не Объект.ДокументПринятВПФР;
	
	Если Не Объект.ДокументПринятВПФР Тогда
		ТолькоПросмотр = Ложь;
		Элементы.ОтчетныйПериод.Доступность = Истина;
		Элементы.Отменить.Доступность = Ложь;
		ЗаполнитьИнфоНадпись();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьФайл(Команда)
	ОчиститьСообщения();
	СформироватьФайлНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСуммыВзносов(Команда)
	ЗаполнитьСуммыВзносовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеОСтаже(Команда)
	ЗаполнитьДанныеОСтажеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВсеАдреса(Команда)
	ЗаполнитьВсеАдресаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзменившиесяАдреса(Команда)
	ЗаполнитьИзменившиесяАдресаНаСервере();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ "СОТРУДНИКИ"

&НаКлиенте
Процедура СотрудникиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		ОбработатьВыборПериодаСтажа(ВыбранноеЗначение);	
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда	
		ОбработкаПодбораНаСервере(ВыбранноеЗначение);
		Если Не Объект.ДокументПринятВПФР Тогда
			ЗаполнитьИнфоНадпись();
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПослеУдаления(Элемент)
	Если Не Объект.ДокументПринятВПФР Тогда
		ЗаполнитьИнфоНадпись();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если Не Объект.ДокументПринятВПФР Тогда
		ЗаполнитьИнфоНадпись();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Не ТолькоПросмотр И Поле.Имя = "ПериодыСтажа" Тогда
	    ОткрытьФормуРедактированияПериодовСтажа(Элемент);
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиФизическоеЛицоПриИзменении(Элемент)
	СотрудникиСотрудникПриИзмененииНаСервере();	
	СтрокаТаблицы = Объект.Сотрудники.НайтиПоИдентификатору(Элементы.Сотрудники.ТекущаяСтрока);
КонецПроцедуры

