#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗарегистрироватьВходящийЗвонок(ПользовательКому, АбонентОтКого, НомерТелефонаАбонента) Экспорт
	
	ИдентификаторЗвонка = Новый УникальныйИдентификатор;
	
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.ПользовательКому.Установить(ПользовательКому);
	Набор.Отбор.ИдентификаторЗвонка.Установить(ИдентификаторЗвонка);
	
	ЗаписьНабора = Набор.Добавить();
	ЗаписьНабора.ПользовательКому		= ПользовательКому;
	ЗаписьНабора.ИдентификаторЗвонка	= ИдентификаторЗвонка;
	ЗаписьНабора.АбонентОтКого			= АбонентОтКого;
	ЗаписьНабора.ДатаЗвонка				= ТекущаяДатаСеанса();
	ЗаписьНабора.НомерТелефонаАбонента	= НомерТелефонаАбонента;
	
	Набор.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли