#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ПриОпределенииНастроекОтчета(НастройкиОтчета, НастройкиВариантов) Экспорт
	
	НастройкиОтчета.Вставить("УровеньГруппировкиСтрок", 2);
	
	ЗаполнитьПредопределенныеВариантыОформления(НастройкиВариантов);
	УстановитьТегиВариантов(НастройкиВариантов);
	ДобавитьОписанияСвязанныхПолей(НастройкиВариантов);
	
КонецПроцедуры

Процедура ПриКонтекстномОткрытии(СсылкаНаОбъект, ПолеСвязи, Отборы, Отказ) Экспорт
	
	Если ПолеСвязи = "ЗаказПокупателя" Тогда
		Отборы.Вставить(ПолеСвязи, УправлениеНебольшойФирмойСервер.МассивЗаказов(СсылкаНаОбъект));
	КонецЕсли;
 	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ОтчетыУНФ.ПриКомпоновкеРезультата(КомпоновщикНастроек, СхемаКомпоновкиДанных, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПредопределенныеВариантыОформления(НастройкиВариантов)
	
	МассивПолей = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок("ВПроизводстве,Заказано,ЗаказаноПоставщикам,ЗарезервированоНаСкладе,ОсталосьОбеспечить,ОсталосьОтгрузить,Отгружено");
	Для каждого НастройкиТекВарианта Из НастройкиВариантов Цикл
		
		ВариантыОформления = НастройкиТекВарианта.Значение.ВариантыОформления;
		ОтчетыУНФ.ДобавитьВариантыОформленияКоличества(ВариантыОформления, МассивПолей);
			
	КонецЦикла; 
	
КонецПроцедуры

Процедура УстановитьТегиВариантов(НастройкиВариантов)
	
	НастройкиВариантов["Основной"].Теги = НСТР("ru = 'Покупатели,Номенклатура,Заказы,Отгрузки,Запасы,Закупки,Резервы,Продажи'");
	
КонецПроцедуры

Процедура ДобавитьОписанияСвязанныхПолей(НастройкиВариантов)
	
	ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["Основной"].СвязанныеПоля, "ЗаказПокупателя", "Документ.РасходнаяНакладная", Перечисления.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю, Истина, Истина);
	ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["Основной"].СвязанныеПоля, "ЗаказПокупателя", "Документ.РасходнаяНакладная", Перечисления.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию, Истина, Истина);
	ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["Основной"].СвязанныеПоля, "ЗаказПокупателя", "Документ.РасходнаяНакладная", Перечисления.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку, Истина, Истина);
	ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["Основной"].СвязанныеПоля, "ЗаказПокупателя", "Документ.РасходнаяНакладная", Перечисления.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение, Истина, Истина);
	
	ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["Основной"].СвязанныеПоля, "ЗаказПокупателя", "Документ.ПриходнаяНакладная", Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратОтКомиссионера, Истина, Истина);
	ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["Основной"].СвязанныеПоля, "ЗаказПокупателя", "Документ.ПриходнаяНакладная", Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратОтПереработчика, Истина, Истина);
	ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["Основной"].СвязанныеПоля, "ЗаказПокупателя", "Документ.ПриходнаяНакладная", Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя, Истина, Истина);
	ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["Основной"].СвязанныеПоля, "ЗаказПокупателя", "Документ.ПриходнаяНакладная", Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратСОтветхранения, Истина, Истина);
	
	ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["Основной"].СвязанныеПоля, "ЗаказПокупателя", "Документ.АктВыполненныхРабот",, Истина, Истина);
	ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["Основной"].СвязанныеПоля, "ЗаказПокупателя", "Документ.РезервированиеЗапасов",, Истина, Истина);
	
КонецПроцедуры

#КонецОбласти

ЭтоОтчетУНФ = Истина;

#КонецЕсли