
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ЗначенияЗаполнения = Новый Структура("Вид", ПараметрКоманды);
	ОткрытьФорму("РегистрСведений.НастройкиВидовКонтактнойИнформации.Форма.РедактированиеНастроекВида",
		Новый Структура("Ключ,ЗначенияЗаполнения", КлючЗаписи(ПараметрКоманды), ЗначенияЗаполнения),
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция КлючЗаписи(Вид)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	НастройкиВидовКонтактнойИнформации.Вид
		|ИЗ
		|	РегистрСведений.НастройкиВидовКонтактнойИнформации КАК НастройкиВидовКонтактнойИнформации
		|ГДЕ
		|	НастройкиВидовКонтактнойИнформации.Вид = &Вид";
	
	Запрос.УстановитьПараметр("Вид", Вид);
	Если Запрос.Выполнить().Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеКлючаЗаписи = Новый Структура("Вид", Вид);
	Возврат РегистрыСведений.НастройкиВидовКонтактнойИнформации.СоздатьКлючЗаписи(ДанныеКлючаЗаписи);
	
КонецФункции

#КонецОбласти
