#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	// обрезаем пробелы
	Организация = СокрЛП(Организация);
	Направление = СокрЛП(Направление);
	
	// формируем наименование
	Если ПустаяСтрока(Направление) Тогда
		Наименование = СокрЛП(Организация) + " -> " + СокрЛП(ТипНаправления);
	Иначе
		Наименование = СокрЛП(Организация) + " -> " + СокрЛП(Направление);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли