
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ЗначениеНастройки = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеНастройки("ОсновнаяФормаПрайсЛиста");
	
	ПараметрыОткрытия = Новый Структура;
	Если НЕ ЗначениеЗаполнено(ЗначениеНастройки)
		ИЛИ ЗначениеНастройки = ПредопределенноеЗначение("Перечисление.ОсновнаяФормаПрайсЛиста.СписокПрайсЛистов") Тогда
		
		ОткрытьФорму("Справочник.ПрайсЛисты.ФормаСписка", ПараметрыОткрытия, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
		
	ИначеЕсли ЗначениеНастройки = ПредопределенноеЗначение("Перечисление.ОсновнаяФормаПрайсЛиста.ФормированиеПрайсЛистов") Тогда
		
		ПараметрыОткрытия.Вставить("ОткрытьОсновнойРабочийПрайсЛист");
		ОткрытьФорму("Обработка.ФормированиеПрайсЛистов.Форма", ПараметрыОткрытия, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
		
	КонецЕсли;
	
КонецПроцедуры
