////////////////////////////////////////////////////////////////////////////////
// Подсистема "Работа с почтовыми сообщениями".
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Вызывается перед открытием формы нового письма.
// Открытие формы может быть отменено изменением параметра СтандартнаяОбработка.
//
// Параметры:
//  ПараметрыОтправки    - Структура - см. описание в РаботаСПочтовымиСообщениямиКлиент.СоздатьНовоеПисьмо;
//  ОбработчикЗавершения - ОписаниеОповещения - описание процедуры, которая будет вызвана после завершения
//                                              отправки письма.
//  СтандартнаяОбработка - Булево - признак продолжения открытия формы нового письма после выхода из этой
//                                  процедуры. Если установить Ложь, форма письма открыта не будет.
Процедура ПередОткрытиемФормыОтправкиПисьма(ПараметрыОтправки, ОбработчикЗавершения, СтандартнаяОбработка) Экспорт
	Перем Отправитель, Получатель, Вложения, Тема, Текст, УдалятьФайлыПослеОтправки, ДокументыОснования;
	
	СтандартнаяОбработка = Ложь;
	
	Если ПараметрыОтправки.Свойство("ШаблонСообщения") И Не ЗначениеЗаполнено(ПараметрыОтправки.ШаблонСообщения)
		И ПараметрыОтправки.Свойство("ПредметСообщения") И ЗначениеЗаполнено(ПараметрыОтправки.ПредметСообщения) Тогда
		
		// В форме выбора шаблона сообщения пользователь выбрал <Без шаблона>, нужно продолжить с открытием выбора печатных форм
		// см. общую команду ОтправитьПоЭлектроннойПочте
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ИмяФормыОбъектаПечати", ПараметрыОтправки.ИмяФормыОбъектаПечати);
		ПараметрыФормы.Вставить("ОбъектыОтправки", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПараметрыОтправки.ПредметСообщения));
		ОткрытьФорму("ОбщаяФорма.ВыборПечатныхФормДляОтправки", ПараметрыФормы);
		Возврат;
	КонецЕсли;
	
	ПараметрыОтправки.Свойство("Отправитель", Отправитель);
	ПараметрыОтправки.Свойство("Получатель", Получатель);
	ПараметрыОтправки.Свойство("Тема", Тема);
	ПараметрыОтправки.Свойство("Текст", Текст);
	ПараметрыОтправки.Свойство("Вложения", Вложения);
	ПараметрыОтправки.Свойство("УдалятьФайлыПослеОтправки", УдалятьФайлыПослеОтправки);
	ПараметрыОтправки.Свойство("ДокументыОснования", ДокументыОснования);
	
	Если ПараметрыОтправки.Свойство("ПредметСообщения") И ЗначениеЗаполнено(ПараметрыОтправки.ПредметСообщения) Тогда
		ДокументыОснования = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПараметрыОтправки.ПредметСообщения);
	КонецЕсли;
	
	// Используем форму документа Событие с типом "Электронное письмо"
	УправлениеНебольшойФирмойКлиент.ОткрытьФормуОтправкиПочтовогоСообщения(Отправитель, Получатель,
		Тема, Текст, Вложения, ДокументыОснования, УдалятьФайлыПослеОтправки, ОбработчикЗавершения);
	
КонецПроцедуры

#КонецОбласти