
Процедура ПриКопировании(ОбъектКопирования)
	Статус = Перечисления.BizСтатусОбслуживанияКлиента.ВРаботе;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	ЭтоВнутреннийЗаказ = Ложь;
	
	УслугиСопровожденияПП = Перечисления.бизВидыСопровожденияКлиентов.УслугиСопровожденияПП;
	
	Если ВидОперации = УслугиСопровожденияПП Тогда
		ПровестиСопровождениеПП();
	Иначе
		Если Ссылка.СостояниеЗаказа = Справочники.СостоянияЗаказовПокупателей.ВРаботе Тогда
			ПровестиПодпискиИТС();
			
		ИначеЕсли Ссылка.СостояниеЗаказа = Справочники.СостоянияЗаказовПокупателей.Завершен Тогда
			ПровестиПодпискиИТС();
			ПровестиРегистрацияОплатыИТСпоИсполнителям();
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПровестиСопровождениеПП()

	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.Период,
		|	ВложенныйЗапрос.Исполнитель,
		|	ВложенныйЗапрос.Номенклатура,
		|	ВложенныйЗапрос.Контрагент,
		|	ВложенныйЗапрос.Статус,
		|	ВложенныйЗапрос.Количество,
		|	ВложенныйЗапрос.Сумма,
		|	ВложенныйЗапрос.Содержание,
		|	ВложенныйЗапрос.Цена,
		|	ВЫБОР КОГДА ВложенныйЗапрос.Номенклатура.Наименование <> ""Доставка корреспонденции"" 
		|		ТОГДА ВложенныйЗапрос.Сумма * СвойстваСотрудниковСрезПоследних.КоофицентКЗарплате 
		|		ИНАЧЕ ВложенныйЗапрос.Сумма
		|	КОНЕЦ КАК СуммаКОплате
		|ИЗ
		|	(ВЫБРАТЬ
		|		BizАктОбслуживанияКлиентаУслуги.Ссылка.Дата КАК Период,	
		|		BizАктОбслуживанияКлиентаУслуги.Ссылка.Исполнитель КАК Исполнитель,
		|		BizАктОбслуживанияКлиентаУслуги.Номенклатура КАК Номенклатура,
		|		BizАктОбслуживанияКлиентаУслуги.Ссылка.Контрагент КАК Контрагент,
		|		BizАктОбслуживанияКлиентаУслуги.Ссылка.Статус КАК Статус,
		|		BizАктОбслуживанияКлиентаУслуги.Количество КАК Количество,
		|		BizАктОбслуживанияКлиентаУслуги.Сумма КАК Сумма,
		|		BizАктОбслуживанияКлиентаУслуги.Содержание КАК Содержание,
		|		BizАктОбслуживанияКлиентаУслуги.Цена КАК Цена
		|	ИЗ
		|		Документ.BizАктОбслуживанияКлиента.Услуги КАК BizАктОбслуживанияКлиентаУслуги
		|	ГДЕ
		|		BizАктОбслуживанияКлиентаУслуги.Ссылка = &Ссылка
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		BizАктОбслуживанияКлиента.Дата КАК Период,
		|		BizАктОбслуживанияКлиента.Исполнитель,
		|		BizАктОбслуживанияКлиента.НоменклатураВыезда,
		|		BizАктОбслуживанияКлиента.Контрагент,
		|		BizАктОбслуживанияКлиента.Статус,
		|		BizАктОбслуживанияКлиента.КоличествоВыездов,
		|		BizАктОбслуживанияКлиента.СуммаВыездов,
		|		"""",
		|		BizАктОбслуживанияКлиента.ЦенаВыезда
		|	ИЗ
		|		Документ.BizАктОбслуживанияКлиента КАК BizАктОбслуживанияКлиента
		|	ГДЕ
		|		BizАктОбслуживанияКлиента.Ссылка = &Ссылка
		|		И BizАктОбслуживанияКлиента.КоличествоВыездов > 0) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвойстваСотрудников.СрезПоследних КАК СвойстваСотрудниковСрезПоследних
		|		ПО ВложенныйЗапрос.Исполнитель = СвойстваСотрудниковСрезПоследних.Сотрудник";
		
    Запрос.УстановитьПараметр("Ссылка", Ссылка);	
	
	Результат = Запрос.Выполнить();

	Выборка = Результат.Выбрать();

	Движения.BizОбслуживаниеКлиента.Записывать = Истина;
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.BizОбслуживаниеКлиента.Добавить();
		Движение.Период			= Выборка.Период;
		Движение.Исполнитель 	= Выборка.Исполнитель;
		Движение.Номенклатура 	= Выборка.Номенклатура;
		Движение.Контрагент 	= Выборка.Контрагент;
		Движение.Статус 		= Выборка.Статус;
		Движение.Количество 	= Выборка.Количество;
		Движение.Сумма 			= Выборка.Сумма;
		Движение.СуммаКОплате 	= Выборка.СуммаКОплате;
		Движение.Содержание 	= Выборка.Содержание;
		Движение.Цена 			= Выборка.Цена;
	КонецЦикла;

КонецПроцедуры

Процедура  ПровестиРегистрацияОплатыИТСпоИсполнителям ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	BizАктОбслуживанияКлиентаПодпискиИТС.Ссылка.Контрагент,
	               |	BizАктОбслуживанияКлиентаПодпискиИТС.ВидПодписки,
	               |	BizАктОбслуживанияКлиентаПодпискиИТС.ПериодПодписки,
	               |	BizАктОбслуживанияКлиентаПодпискиИТС.СрокПодписки,
	               |	BizАктОбслуживанияКлиентаПодпискиИТС.Ссылка.Дата,
	               |	BizАктОбслуживанияКлиентаПодпискиИТС.Количество,
	               |	BizАктОбслуживанияКлиентаПодпискиИТС.Ссылка.СостояниеЗаказа,
	               |	BizАктОбслуживанияКлиентаПодпискиИТС.Исполнитель,
	               |	ЗНАЧЕНИЕ(Перечисление.BizСтатусОбслуживанияКлиента.КОплате) КАК Статус,
	               |	BizАктОбслуживанияКлиентаПодпискиИТС.Цена,
	               |	бизОплатаИТССрезПоследних.НоменклатураПодписки,
	               |	BizАктОбслуживанияКлиентаПодпискиИТС.Цена * BizАктОбслуживанияКлиентаПодпискиИТС.Количество КАК Сумма,
	               |	BizАктОбслуживанияКлиентаПодпискиИТС.Вознаграждение КАК СуммаКОплате,
	               |	BizАктОбслуживанияКлиентаПодпискиИТС.Ссылка.Организация КАК Организация
	               |ИЗ
	               |	Документ.BizАктОбслуживанияКлиента.ПодпискиИТС КАК BizАктОбслуживанияКлиентаПодпискиИТС
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бизОплатаИТС.СрезПоследних(&Дата, ) КАК бизОплатаИТССрезПоследних
	               |		ПО BizАктОбслуживанияКлиентаПодпискиИТС.ВидПодписки = бизОплатаИТССрезПоследних.ВидПодписки
	               |			И BizАктОбслуживанияКлиентаПодпискиИТС.СрокПодписки = бизОплатаИТССрезПоследних.СрокПодписки
	               |ГДЕ
	               |	BizАктОбслуживанияКлиентаПодпискиИТС.Ссылка.Ссылка = &Ссылка
	               |	И BizАктОбслуживанияКлиентаПодпискиИТС.Статус <> &Статус";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.УстановитьПараметр("Дата",Ссылка.Дата);
	Запрос.УстановитьПараметр("Статус", Перечисления.BizСтатусОбслуживанияКлиента.ВРаботе);
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Движения.BizОбслуживаниеКлиента.Записывать = Истина;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Движение = Движения.BizОбслуживаниеКлиента.Добавить();
		Движение.Период			= ВыборкаДетальныеЗаписи.Дата;
		Движение.Исполнитель 	= ВыборкаДетальныеЗаписи.Исполнитель;
		Движение.Номенклатура 	= ВыборкаДетальныеЗаписи.НоменклатураПодписки;
		Движение.Контрагент 	= ВыборкаДетальныеЗаписи.Контрагент;
		Движение.Статус 		= ВыборкаДетальныеЗаписи.Статус;
		Движение.Количество 	= ВыборкаДетальныеЗаписи.Количество;
		Движение.Цена 			= ВыборкаДетальныеЗаписи.Цена;
		Движение.Сумма 			= ВыборкаДетальныеЗаписи.Сумма;
		Движение.Статус			= ВыборкаДетальныеЗаписи.Статус;
		Движение.СуммаКОплате 	= Окр(ВыборкаДетальныеЗаписи.СуммаКОплате/2,0,1);
	КонецЦикла;
	
	
КонецПроцедуры	

Процедура ПровестиПодпискиИТС ()

	   Запрос = Новый Запрос;
		   Запрос.Текст = "ВЫБРАТЬ
		                  |	BizАктОбслуживанияКлиентаПодпискиИТС.Организация КАК Организация,
		                  |	BizАктОбслуживанияКлиентаПодпискиИТС.Ссылка.Контрагент,
		                  |	BizАктОбслуживанияКлиентаПодпискиИТС.ВидПодписки,
		                  |	BizАктОбслуживанияКлиентаПодпискиИТС.ПериодПодписки,
		                  |	BizАктОбслуживанияКлиентаПодпискиИТС.СрокПодписки,
		                  |	BizАктОбслуживанияКлиентаПодпискиИТС.Ссылка.Дата,
		                  |	BizАктОбслуживанияКлиентаПодпискиИТС.Количество,
		                  |	BizАктОбслуживанияКлиентаПодпискиИТС.Ссылка.СостояниеЗаказа,
		                  |	BizАктОбслуживанияКлиентаПодпискиИТС.Ссылка.Закрыт
		                  |ИЗ
		                  |	Документ.BizАктОбслуживанияКлиента.ПодпискиИТС КАК BizАктОбслуживанияКлиентаПодпискиИТС
		                  |ГДЕ
		                  |	BizАктОбслуживанияКлиентаПодпискиИТС.Ссылка.Ссылка = &Ссылка";
			Запрос.УстановитьПараметр("Ссылка",Ссылка);			  
	       	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
			
			Движения.бизДискиИТС.Записывать = Истина;
			Пока ВыборкаДетальныеЗаписи.Следующий()Цикл
				//Регистр накопления бизДискиИТС
				Движение = Движения.бизДискиИТС.Добавить();
				Движение.Период = ВыборкаДетальныеЗаписи.Дата;
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Организация = ?(ЗначениеЗаполнено(Ссылка.Организация),Ссылка.Организация, Ссылка.ДокументОтгрузкиИТС.Организация);
				Движение.Контрагент = ВыборкаДетальныеЗаписи.Контрагент;
				Движение.ВидПодписки = ВыборкаДетальныеЗаписи.ВидПодписки;
				Движение.ПериодПодписки = ВыборкаДетальныеЗаписи.ПериодПодписки;
				Движение.СрокПодписки = ВыборкаДетальныеЗаписи.СрокПодписки;
				Движение.Количество = ВыборкаДетальныеЗаписи.Количество;
				
				//Периодический регистр сведений бизСтатусыПодписокИТС
				
				МЗ = РегистрыСведений.бизСтатусыОбслуживанияИТС.СоздатьМенеджерЗаписи();
				МЗ.Период =  ТекущаяДата();
				МЗ.Организация = ВыборкаДетальныеЗаписи.Организация;
				МЗ.Контрагент = ВыборкаДетальныеЗаписи.Контрагент;
				МЗ.ВидПодписки = ВыборкаДетальныеЗаписи.ВидПодписки;
				МЗ.ПериодПодписки = ВыборкаДетальныеЗаписи.ПериодПодписки;
				МЗ.СрокПодписки = ВыборкаДетальныеЗаписи.СрокПодписки;
				МЗ.СостояниеЗаказа = ВыборкаДетальныеЗаписи.СостояниеЗаказа;
				МЗ.АктОбслуживанияИТС  = Ссылка;
				МЗ.АктуальностьЗаказа = ВыборкаДетальныеЗаписи.Закрыт;
				
				МЗ.Записать(Истина);					
				
			КонецЦикла;


КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	НоменклатураВыезда = Константы.BizНоменклатураВыезда.Получить();
    ВидЦенЗакупочная = Справочники.ВидыЦен.Учетная;
	ВидЦенОптовая = Справочники.ВидыЦен.Оптовая;
	
	НоменклатураВыезда = Константы.BizНоменклатураВыезда.Получить();
	ЦенаВыезда = 300;
	СуммаВыездов = КоличествоВыездов * ЦенаВыезда;
	Если ВидОперации = Перечисления.бизВидыСопровожденияКлиентов.УслугиСопровожденияПП Тогда
	СуммаДокумента = Услуги.Итог("Сумма") + СуммаВыездов;
	КонецЕсли;
КонецПроцедуры



