#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.СерийныйНомер) И ЗначениеЗаполнено(Параметры.Поставщик) Тогда
		Поставщик 		= Параметры.Поставщик;
		СерийныйНомер 	= Параметры.СерийныйНомер;
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть(ПарольДоступа);
	
КонецПроцедуры

#КонецОбласти