#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура создает пустую временную таблицу изменения движений.
//
Процедура СоздатьПустуюВременнуюТаблицуИзменение(ДополнительныеСвойства) Экспорт
	
	Если НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
	 ИЛИ НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 0
	|	ЗапасыПринятые.НомерСтроки КАК НомерСтроки,
	|	ЗапасыПринятые.Организация КАК Организация,
	|	ЗапасыПринятые.Номенклатура КАК Номенклатура,
	|	ЗапасыПринятые.Характеристика КАК Характеристика,
	|	ЗапасыПринятые.Партия КАК Партия,
	|	ЗапасыПринятые.Контрагент КАК Контрагент,
	|	ЗапасыПринятые.Договор КАК Договор,
	|	ЗапасыПринятые.Заказ КАК Заказ,
	|	ЗапасыПринятые.ТипПриемаПередачи КАК ТипПриемаПередачи,
	|	ЗапасыПринятые.Количество КАК КоличествоПередЗаписью,
	|	ЗапасыПринятые.Количество КАК КоличествоИзменение,
	|	ЗапасыПринятые.Количество КАК КоличествоПриЗаписи,
	|	ЗапасыПринятые.СуммаРасчетов КАК СуммаРасчетовПередЗаписью,
	|	ЗапасыПринятые.СуммаРасчетов КАК СуммаРасчетовИзменение,
	|	ЗапасыПринятые.СуммаРасчетов КАК СуммаРасчетовПриЗаписи
	|ПОМЕСТИТЬ ДвиженияЗапасыПринятыеИзменение
	|ИЗ
	|	РегистрНакопления.ЗапасыПринятые КАК ЗапасыПринятые");
	
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураВременныеТаблицы.Вставить("ДвиженияЗапасыПринятыеИзменение", Ложь);
	
КонецПроцедуры // СоздатьПустуюВременнуюТаблицуИзменение()

#КонецОбласти

#КонецЕсли