

#Область ОбработчикиСобытийФормы

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ВерсияУстановленногоМодуля.Заголовок = Б_Битрикс24_1С_Сервер.Версия();
	
	Элементы.ОбщаяИнформация.Заголовок = Символы.ПС + "Рекомендуется обновить модуль до версии " + Параметры.ИнформацияООбновлении.ВерсияМодуля;
	
	АдресСсылки	= Параметры.ИнформацияООбновлении.Адрес;
	
КонецПроцедуры

#КонецОбласти


#Область СобытияЖлементовФормы

&НаКлиенте
Процедура АдресМодуляНажатие(Элемент)
	ЗапуститьПриложение(АдресСсылки);
КонецПроцедуры

#КонецОбласти



