
&НаСервере
Функция ПолучитьТипДенежныхСредств(ДокументСсылка)
	
	Возврат ДокументСсылка.ТипДенежныхСредств;
	
КонецФункции // ПолучитьТипДенежныхСредств()

&НаКлиенте
// Процедура обработки команды.
//
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТипДенежныхСредств = ПолучитьТипДенежныхСредств(ПараметрКоманды);
	
	Если ПараметрыВыполненияКоманды.Источник.Элементы.Найти("ПлатежныйКалендарь") <> Неопределено Тогда
		
		ПлатежныйКалендарьТекущаяСтрока = ПараметрыВыполненияКоманды.Источник.Элементы.ПлатежныйКалендарь.ТекущиеДанные;
		
		Если ПлатежныйКалендарьТекущаяСтрока <> Неопределено Тогда
			
			СтруктураЗаполнения = Новый Структура();
			СтруктураЗаполнения.Вставить("Основание", ПараметрыВыполненияКоманды.Источник.Объект.Ссылка);
			СтруктураЗаполнения.Вставить("НомерСтроки", ПлатежныйКалендарьТекущаяСтрока.НомерСтроки);
			Параметры = Новый Структура("Основание", СтруктураЗаполнения);
			
		Иначе
			
			Параметры = Новый Структура("Основание", ПараметрКоманды);
			
		КонецЕсли;
		
	Иначе
		
		Параметры = Новый Структура("Основание", ПараметрКоманды);
		
	КонецЕсли;
	
	Если ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Наличные") Тогда
		
		ОткрытьФорму("Документ.РасходИзКассы.ФормаОбъекта", Параметры);
		
	Иначе
		
		ОткрытьФорму("Документ.РасходСоСчета.ФормаОбъекта", Параметры);
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаКоманды()
